zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_rcc.h
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   Header file of RCC LL module.
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    LL RCC RIF driver contains a set of following user APIs :
      (+) API to enable and disable Security access filtering to RCC Local Resources
      (+) API to enable and disable Privilege access filtering to RCC Local Resources
      (+) API to set and get configuration of Static or Dynamic CID access filtering to RCC Local Resources
      (+) API to take, release and get semaphore used for Dynamic CID access to RCC Local Resources

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_LL_RCC_H
#define STM32MP2xx_LL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup RCC_LL RCC
  * @{
  */

/* Private types -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/


/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Constants RCC Private Constants
  * @{
  */

/* Define all reset flags mask */
#define LL_RCC_HWRSTSCLRR_ALL  0x000F7FFFU
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Exported_Types RCC Exported Types
  * @{
  */

/**
  * @brief  RCC Clocks Frequency Structure
  */
typedef struct
{
  uint32_t AXIM_Frequency;   /*!< AXIM clock frequency */
  uint32_t MLAHB_Frequency;  /*!< MLAHB clock frequency */
  uint32_t AHB1_Frequency;   /*!< AHB1 clock frequency */
  uint32_t AHB2_Frequency;   /*!< AHB2 clock frequency */
  uint32_t AHB3_Frequency;   /*!< AHB3 clock frequency */
  uint32_t AHB4_Frequency;   /*!< AHB4 clock frequency */
  uint32_t AHB5_Frequency;   /*!< AHB5 clock frequency */
  uint32_t AHB6_Frequency;   /*!< AHB6 clock frequency */
  uint32_t AHBSR_Frequency;  /*!< AHBSR clock frequency */
  uint32_t APB1_Frequency;   /*!< APB1 clock frequency */
  uint32_t APB2_Frequency;   /*!< APB2 clock frequency */
  uint32_t APB3_Frequency;   /*!< APB3 clock frequency */
  uint32_t APB4_Frequency;   /*!< APB4 clock frequency */
#if defined(RCC_APB5DIVR_APB5DIV)
  uint32_t APB5_Frequency;   /*!< APB5 clock frequency */
#endif /* RCC_APB5DIVR_APB5DIV */
  uint32_t APBSR_Frequency;  /*!< APBSR clock frequency */
  uint32_t APBDBG_Frequency; /*!< APBDBG clock frequency */
} LL_RCC_ClocksTypeDef;


/** @defgroup LL_ES_CLOCK_FREQ Clocks Frequency Structure
  * @{
  */

/**
  * @brief  RCC Clocks Frequency Structure
  */
typedef struct
{
  uint32_t freq;
} LL_PLL_ClocksTypeDef;
/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

#if defined(CORE_CA35)
#define PLL1_TYPEDEF CA35SSC_TypeDef;
#endif /* CORE_CA35 */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_LL_EC_OSC_VALUES Oscillator Values adaptation
  * @brief    Defines used to adapt values of different oscillators
  * @note     These values could be modified in the user environment according to
  *           HW set-up.
  * @{
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE    40000000U   /*!< Value of the HSE oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSI_VALUE)
#define HSI_VALUE    64000000U  /*!< Value of the HSI oscillator in Hz */
#endif /* HSI_VALUE */

#if !defined  (LSE_VALUE)
#define LSE_VALUE    32768U     /*!< Value of the LSE oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSI_VALUE)
#define LSI_VALUE    32000U     /*!< Value of the LSI oscillator in Hz */
#endif /* LSI_VALUE */

#if !defined  (MSI_VALUE)
#define MSI_VALUE    1600000U     /*!< Value of the MSI oscillator in Hz */
#endif /* MSI_VALUE */

#if !defined  (EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE    12288000U /*!< Value of the I2S_CKIN external oscillator in Hz */
#endif /* EXTERNAL_CLOCK_VALUE */

#if !defined  (USBO_48M_VALUE)
#define USBO_48M_VALUE    48000000U /*!< Value of the rcc_ck_usbo_48m oscillator in Hz */
#endif /* USBO_48M_VALUE */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_CLOCK_SOURCE Clock Sources Defines
  * @brief    Clock Sources defines which can be used with all the clocksource functions
  * @{
  */
#define LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV     (0x0U << RCC_XBARxCFGR_XBARxSEL_Pos) /* PLL4 FOUTPOSTDIV is selected */
#define LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV     (0x1U << RCC_XBARxCFGR_XBARxSEL_Pos) /* PLL5 FOUTPOSTDIV is selected */
#define LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV     (0x2U << RCC_XBARxCFGR_XBARxSEL_Pos) /* PLL6 FOUTPOSTDIV is selected */
#define LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV     (0x3U << RCC_XBARxCFGR_XBARxSEL_Pos) /* PLL7 FOUTPOSTDIV is selected */
#define LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV     (0x4U << RCC_XBARxCFGR_XBARxSEL_Pos) /* PLL8 FOUTPOSTDIV is selected */
#define LL_RCC_XBAR_CLKSRC_HSI                  (0x5U << RCC_XBARxCFGR_XBARxSEL_Pos) /* hsi_ck is selected */
#define LL_RCC_XBAR_CLKSRC_HSE                  (0x6U << RCC_XBARxCFGR_XBARxSEL_Pos) /* hse_ck is selected */
#define LL_RCC_XBAR_CLKSRC_MSI                  (0x7U << RCC_XBARxCFGR_XBARxSEL_Pos) /* msi_ck is selected */
#define LL_RCC_XBAR_CLKSRC_HSIKER               (0x8U << RCC_XBARxCFGR_XBARxSEL_Pos) /* hsi_ker_ck is selected */
#define LL_RCC_XBAR_CLKSRC_HSEKER               (0x9U << RCC_XBARxCFGR_XBARxSEL_Pos) /* hse_ker_ck is selected */
#define LL_RCC_XBAR_CLKSRC_MSIKER               (0xAU << RCC_XBARxCFGR_XBARxSEL_Pos) /* msi_ker_ck is selected */
#define LL_RCC_XBAR_CLKSRC_SPDIF                (0xBU << RCC_XBARxCFGR_XBARxSEL_Pos) /* spdif_ck_symb is selected */
#if !defined(RCC_DERIVATIVE1_CK_IN)
#define LL_RCC_XBAR_CLKSRC_I2S                  (0xCU << RCC_XBARxCFGR_XBARxSEL_Pos) /* i2s_ck is selected */
#else
#define LL_RCC_XBAR_CLKSRC_CK_IN                (0xCU << RCC_XBARxCFGR_XBARxSEL_Pos) /* CK_IN is selected */
#endif /* RCC_DERIVATIVE1_CK_IN */
#define LL_RCC_XBAR_CLKSRC_LSI                  (0xDU << RCC_XBARxCFGR_XBARxSEL_Pos) /* lsi_ck is selected */
#define LL_RCC_XBAR_CLKSRC_LSE                  (0xEU << RCC_XBARxCFGR_XBARxSEL_Pos) /* lse_ck is selected */
/**
  * @}
  */

