zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/** @defgroup RCC_LL_EC_PREDIV_VALUE  Pre Divider Configuration Value Defines
  * @brief    Prediv defines which can be used with all the PREDIVxCFGR functions
  * @{
  */
#define LL_RCC_PREDIV_DIV1        (0x0U << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define LL_RCC_PREDIV_DIV2        (0x1U << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define LL_RCC_PREDIV_DIV4        (0x3U << RCC_PREDIVxCFGR_PREDIVx_Pos)
#define LL_RCC_PREDIV_DIV1024     (0x3FFU << RCC_PREDIVxCFGR_PREDIVx_Pos)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_RCC_WriteReg function
  * @{
  */
#define LL_CIFCLRR_LSIRDYC      RCC_C2CIFCLRR_LSIRDYF /*!< LSI Ready Interrupt Clear */
#define LL_CIFCLRR_LSERDYC      RCC_C2CIFCLRR_LSERDYF /*!< LSE Ready Interrupt Clear */
#define LL_CIFCLRR_HSIRDYC      RCC_C2CIFCLRR_HSIRDYF /*!< HSI Ready Interrupt Clear */
#define LL_CIFCLRR_HSERDYC      RCC_C2CIFCLRR_HSERDYF /*!< HSE Ready Interrupt Clear */
#define LL_CIFCLRR_MSIRDYC      RCC_C2CIFCLRR_MSIRDYF /*!< MSI Ready Interrupt Clear */
#define LL_CIFCLRR_PLL1RDYC     RCC_C2CIFCLRR_PLL1RDYF /*!< PLL1 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL2RDYC     RCC_C2CIFCLRR_PLL2RDYF /*!< PLL2 Ready Interrupt Clear */
#if defined(RCC_C2CIFCLRR_PLL3RDYF)
#define LL_CIFCLRR_PLL3RDYC     RCC_C2CIFCLRR_PLL3RDYF /*!< PLL3 Ready Interrupt Clear */
#endif /* RCC_C2CIFCLRR_PLL3RDYF */
#define LL_CIFCLRR_PLL4RDYC     RCC_C2CIFCLRR_PLL4RDYF /*!< PLL4 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL5RDYC     RCC_C2CIFCLRR_PLL5RDYF /*!< PLL5 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL6RDYC     RCC_C2CIFCLRR_PLL6RDYF /*!< PLL6 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL7RDYC     RCC_C2CIFCLRR_PLL7RDYF /*!< PLL7 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL8RDYC     RCC_C2CIFCLRR_PLL8RDYF /*!< PLL8 Ready Interrupt Clear */
#define LL_CIFCLRR_LSECSSC      RCC_C2CIFCLRR_LSECSSF /*!< LSE Clock Security System Interrupt Clear */
#define LL_CIFCLRR_WKUPC        RCC_C2CIFCLRR_WKUPF   /*!< Wake up from CStop Interrupt Clear */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_RCC_ReadReg function
  * @{
  */
#define LL_CIFCLRR_LSIRDYF      RCC_C2CIFCLRR_LSIRDYF /*!< LSI Ready Interrupt flag */
#define LL_CIFCLRR_LSERDYF      RCC_C2CIFCLRR_LSERDYF /*!< LSE Ready Interrupt flag */
#define LL_CIFCLRR_HSIRDYF      RCC_C2CIFCLRR_HSIRDYF /*!< HSI Ready Interrupt flag */
#define LL_CIFCLRR_HSERDYF      RCC_C2CIFCLRR_HSERDYF /*!< HSE Ready Interrupt flag */
#define LL_CIFCLRR_MSIRDYF      RCC_C2CIFCLRR_MSIRDYF /*!< MSI Ready Interrupt flag */
#define LL_CIFCLRR_PLL1RDYF     RCC_C2CIFCLRR_PLL1RDYF /*!< PLL1 Ready Interrupt flag */
#define LL_CIFCLRR_PLL2RDYF     RCC_C2CIFCLRR_PLL2RDYF /*!< PLL2 Ready Interrupt flag */
#if defined(RCC_C2CIFCLRR_PLL3RDYF)
#define LL_CIFCLRR_PLL3RDYF     RCC_C2CIFCLRR_PLL3RDYF /*!< PLL3 Ready Interrupt flag */
#endif /* RCC_C2CIFCLRR_PLL3RDYF */
#define LL_CIFCLRR_PLL4RDYF     RCC_C2CIFCLRR_PLL4RDYF /*!< PLL4 Ready Interrupt flag */
#define LL_CIFCLRR_PLL5RDYF     RCC_C2CIFCLRR_PLL5RDYF /*!< PLL5 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL6RDYF     RCC_C2CIFCLRR_PLL6RDYF /*!< PLL6 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL7RDYF     RCC_C2CIFCLRR_PLL7RDYF /*!< PLL7 Ready Interrupt Clear */
#define LL_CIFCLRR_PLL8RDYF     RCC_C2CIFCLRR_PLL8RDYF /*!< PLL8 Ready Interrupt Clear */
#define LL_CIFCLRR_LSECSSF      RCC_C2CIFCLRR_LSECSSF /*!< LSE Clock Security System Interrupt flag */
#define LL_CIFCLRR_WKUPF        RCC_C2CIFCLRR_WKUPF   /*!< Wake up from CStop Interrupt flag */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_RCC_ReadReg and  LL_RCC_WriteReg functions
  * @{
  */
#define LL_RCC_CIESETR_LSIRDYIE      RCC_C2CIESETR_LSIRDYIE /*!< LSI Ready Interrupt Enable */
#define LL_RCC_CIESETR_LSERDYIE      RCC_C2CIESETR_LSERDYIE /*!< LSE Ready Interrupt Enable */
#define LL_RCC_CIESETR_HSIRDYIE      RCC_C2CIESETR_HSIRDYIE /*!< HSI Ready Interrupt Enable */
#define LL_RCC_CIESETR_HSERDYIE      RCC_C2CIESETR_HSERDYIE /*!< HSE Ready Interrupt Enable */
#define LL_RCC_CIESETR_MSIRDYIE      RCC_C2CIESETR_MSIRDYIE /*!< MSI Ready Interrupt Enable */
#define LL_RCC_CIESETR_PLL1RDYIE     RCC_C2CIESETR_PLL1DYIE /*!< PLL1 Ready Interrupt Enable */
#define LL_RCC_CIESETR_PLL2RDYIE     RCC_C2CIESETR_PLL2DYIE /*!< PLL2 Ready Interrupt Enable */
#if defined(RCC_C2CIESETR_PLL3DYIE)
#define LL_RCC_CIESETR_PLL3RDYIE     RCC_C2CIESETR_PLL3DYIE /*!< PLL3 Ready Interrupt Enable */
#endif /* RCC_C2CIESETR_PLL3DYIE */
#define LL_RCC_CIESETR_PLL4RDYIE     RCC_C2CIESETR_PLL4DYIE /*!< PLL4 Ready Interrupt Enable */
#define LL_RCC_CIESETR_PLL5RDYIE     RCC_C2CIESETR_PLL5DYIE /*!< PLL5 Ready Interrupt Enable */
#define LL_RCC_CIESETR_PLL6RDYIE     RCC_C2CIESETR_PLL6DYIE /*!< PLL6 Ready Interrupt Enable */
#define LL_RCC_CIESETR_PLL7RDYIE     RCC_C2CIESETR_PLL7DYIE /*!< PLL7 Ready Interrupt Enable */
#define LL_RCC_CIESETR_PLL8RDYIE     RCC_C2CIESETR_PLL8DYIE /*!< PLL8 Ready Interrupt Enable */
#define LL_RCC_CIESETR_LSECSSIE      RCC_C2CIESETR_LSECSSIE /*!< LSE Clock Security System Interrupt Enable */
#define LL_RCC_CIESETR_WKUPIE        RCC_C2CIESETR_WKUPIE   /*!< Wake up from CStop Interrupt Enable */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RTC_HSEDIV  HSE prescaler for RTC clock
  * @{
  */
#define LL_RCC_RTC_HSE_DIV_1                (0x0U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_2                (0x1U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_3                (0x2U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_4                (0x3U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_5                (0x4U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_6                (0x5U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_7                (0x6U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_8                (0x7U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_9                (0x8U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_10               (0x9U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_11               (0xAU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_12               (0xBU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_13               (0xCU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_14               (0xDU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_15               (0xEU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_16               (0xFU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_17               (0x10U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_18               (0x11U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_19               (0x12U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_20               (0x13U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_21               (0x14U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_22               (0x15U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_23               (0x16U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_24               (0x17U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_25               (0x18U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_26               (0x19U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_27               (0x1AU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_28               (0x1BU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_29               (0x1CU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_30               (0x1DU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_31               (0x1EU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_32               (0x1FU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_33               (0x20U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_34               (0x21U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_35               (0x22U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_36               (0x23U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_37               (0x24U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_38               (0x25U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_39               (0x26U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_40               (0x27U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_41               (0x28U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_42               (0x29U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_43               (0x2AU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_44               (0x2BU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_45               (0x2CU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_46               (0x2DU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_47               (0x2EU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_48               (0x2FU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_49               (0x30U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_50               (0x31U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_51               (0x32U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_52               (0x33U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_53               (0x34U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_54               (0x35U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_55               (0x36U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_56               (0x37U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_57               (0x38U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_58               (0x39U << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_59               (0x3AU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_60               (0x3BU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_61               (0x3CU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_62               (0x3DU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_63               (0x3EU << RCC_RTCDIVR_RTCDIV_Pos)
#define LL_RCC_RTC_HSE_DIV_64               (0x3FU << RCC_RTCDIVR_RTCDIV_Pos)
/*
  * @}
  */

