zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/** @defgroup RCC_APB1_DIV  APB1 prescaler
  * @{
  */
#define LL_RCC_APB1_DIV_1                   (0x0U << RCC_APB1DIVR_APB1DIV_Pos)  /*!< apb1clk not divided (default after reset) */
#define LL_RCC_APB1_DIV_2                   (0x1U << RCC_APB1DIVR_APB1DIV_Pos)  /*!< apb1clk divided by 2 */
#define LL_RCC_APB1_DIV_4                   (0x2U << RCC_APB1DIVR_APB1DIV_Pos)  /*!< apb1clk divided by 4 */
#define LL_RCC_APB1_DIV_8                   (0x3U << RCC_APB1DIVR_APB1DIV_Pos)  /*!< apb1clk divided by 8 */
#define LL_RCC_APB1_DIV_16                  (0x4U << RCC_APB1DIVR_APB1DIV_Pos)  /*!< apb1clk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB2_DIV  APB2 prescaler
  * @{
  */
#define LL_RCC_APB2_DIV_1                   (0x0U << RCC_APB2DIVR_APB2DIV_Pos)  /*!< apb2clk not divided (default after reset) */
#define LL_RCC_APB2_DIV_2                   (0x1U << RCC_APB2DIVR_APB2DIV_Pos)  /*!< apb2clk divided by 2 */
#define LL_RCC_APB2_DIV_4                   (0x2U << RCC_APB2DIVR_APB2DIV_Pos)  /*!< apb2clk divided by 4 */
#define LL_RCC_APB2_DIV_8                   (0x3U << RCC_APB2DIVR_APB2DIV_Pos)  /*!< apb2clk divided by 8 */
#define LL_RCC_APB2_DIV_16                  (0x4U << RCC_APB2DIVR_APB2DIV_Pos)  /*!< apb2clk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB3_DIV  APB3 prescaler
  * @{
  */
#define LL_RCC_APB3_DIV_1                   (0x0U << RCC_APB3DIVR_APB3DIV_Pos)  /*!< apb3clk not divided (default after reset) */
#define LL_RCC_APB3_DIV_2                   (0x1U << RCC_APB3DIVR_APB3DIV_Pos)  /*!< apb3clk divided by 2 */
#define LL_RCC_APB3_DIV_4                   (0x2U << RCC_APB3DIVR_APB3DIV_Pos)  /*!< apb3clk divided by 4 */
#define LL_RCC_APB3_DIV_8                   (0x3U << RCC_APB3DIVR_APB3DIV_Pos)  /*!< apb3clk divided by 8 */
#define LL_RCC_APB3_DIV_16                  (0x4U << RCC_APB3DIVR_APB3DIV_Pos)  /*!< apb3clk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB4_DIV  APB4 prescaler
  * @{
  */
#define LL_RCC_APB4_DIV_1                   (0x0U << RCC_APB4DIVR_APB4DIV_Pos)  /*!< apb4clk not divided (default after reset) */
#define LL_RCC_APB4_DIV_2                   (0x1U << RCC_APB4DIVR_APB4DIV_Pos)  /*!< apb4clk divided by 2 */
#define LL_RCC_APB4_DIV_4                   (0x2U << RCC_APB4DIVR_APB4DIV_Pos)  /*!< apb4clk divided by 4 */
#define LL_RCC_APB4_DIV_8                   (0x3U << RCC_APB4DIVR_APB4DIV_Pos)  /*!< apb4clk divided by 8 */
#define LL_RCC_APB4_DIV_16                  (0x4U << RCC_APB4DIVR_APB4DIV_Pos)  /*!< apb4clk divided by 16 */
/**
  * @}
  */
#if defined(RCC_APB5DIVR_APB5DIV)
/** @defgroup RCC_APB5_DIV  APB5 prescaler
  * @{
  */
#define LL_RCC_APB5_DIV_1                   (0x0U << RCC_APB5DIVR_APB5DIV_Pos)  /*!< apb5clk not divided (default after reset) */
#define LL_RCC_APB5_DIV_2                   (0x1U << RCC_APB5DIVR_APB5DIV_Pos)  /*!< apb5clk divided by 2 */
#define LL_RCC_APB5_DIV_4                   (0x2U << RCC_APB5DIVR_APB5DIV_Pos)  /*!< apb5clk divided by 4 */
#define LL_RCC_APB5_DIV_8                   (0x3U << RCC_APB5DIVR_APB5DIV_Pos)  /*!< apb5clk divided by 8 */
#define LL_RCC_APB5_DIV_16                  (0x4U << RCC_APB5DIVR_APB5DIV_Pos)  /*!< apb5clk divided by 16 */
/**
  * @}
  */
#endif /* RCC_APB5DIVR_APB5DIV */
/** @defgroup RCC_APBDBG_DIV  APBDBG prescaler
  * @{
  */
#define LL_RCC_APBDBG_DIV_1                 (0x0U << RCC_APBDBGDIVR_APBDBGDIV_Pos)  /*!< apbdbgclk not divided (default after reset) */
#define LL_RCC_APBDBG_DIV_2                 (0x1U << RCC_APBDBGDIVR_APBDBGDIV_Pos)  /*!< apbdbgclk divided by 2 */
#define LL_RCC_APBDBG_DIV_4                 (0x2U << RCC_APBDBGDIVR_APBDBGDIV_Pos)  /*!< apbdbgclk divided by 4 */
#define LL_RCC_APBDBG_DIV_8                 (0x3U << RCC_APBDBGDIVR_APBDBGDIV_Pos)  /*!< apbdbgclk divided by 8 */
#define LL_RCC_APBDBG_DIV_16                (0x4U << RCC_APBDBGDIVR_APBDBGDIV_Pos)  /*!< apbdbgclk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LSMCUDIV  LSMCU prescaler
  * @{
  */
#define LL_RCC_LSMCUDIV_1                   (0x0U << RCC_LSMCUDIVR_LSMCUDIV_Pos)  /*!< lsmcu divided by 1 */
#define LL_RCC_LSMCUDIV_2                   (0x1U << RCC_LSMCUDIVR_LSMCUDIV_Pos)  /*!< lsmcu divided by 2 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSEDRIVE  LSE oscillator drive capability
  * @{
  */
#define LL_RCC_LSEDRIVE_LOW                     (0x0U << RCC_BDCR_LSEDRV_Pos) /*!< Xtal mode lower driving capability */
#define LL_RCC_LSEDRIVE_MEDIUMHIGH              (0x1U << RCC_BDCR_LSEDRV_Pos) /*!< Xtal mode medium high driving capability */
#define LL_RCC_LSEDRIVE_MEDIUMLOW               (0x2U << RCC_BDCR_LSEDRV_Pos) /*!< Xtal mode medium low driving capability */
#define LL_RCC_LSEDRIVE_HIGH                    (0x3U << RCC_BDCR_LSEDRV_Pos) /*!< Xtal mode higher driving capability */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO              0x00000000U /*!< No clock enabled for the peripheral */
#define LL_RCC_PERIPH_FREQUENCY_NA              0xFFFFFFFFU /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE           (0x0U << RCC_BDCR_RTCSRC_Pos)  /*!< No clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSE            (0x1U << RCC_BDCR_RTCSRC_Pos)  /*!< LSE oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSI            (0x2U << RCC_BDCR_RTCSRC_Pos)  /*!< LSI oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV        (0x3U << RCC_BDCR_RTCSRC_Pos)  /*!< HSE oscillator clock divided by RTCDIV used as RTC clock */
/**
  * @}
  */

#if defined(DSI)
/** @defgroup RCC_LL_EC_DSI Peripheral  DSI get clock source
  * @{
  */
#define LL_RCC_DSI_CLKSOURCE          RCC_DSICFGR_DSIBLSEL
/**
  * @}
  */
#endif /*DSI*/

/** @defgroup RCC_LL_EC_PLL1SOURCE  PLL1 entry clock source
  * @{
  */
#define LL_RCC_PLL1SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL5_Pos)  /*!< HSI clock selected as PLL1 entry clock source */
#define LL_RCC_PLL1SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL5_Pos)  /*!< HSE clock selected as PLL1 entry clock source */
#define LL_RCC_PLL1SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL5_Pos)  /*!< MSI clock selected as PLL1 entry clock source */
#define LL_RCC_PLL1SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL5_Pos)  /*!< No clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL2SOURCE  PLL2 entry clock source
  * @{
  */
#define LL_RCC_PLL2SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL6_Pos)  /*!< HSI clock selected as PLL2 entry clock source */
#define LL_RCC_PLL2SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL6_Pos)  /*!< HSE clock selected as PLL2 entry clock source */
#define LL_RCC_PLL2SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL6_Pos)  /*!< MSI clock selected as PLL2 entry clock source */
#define LL_RCC_PLL2SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL6_Pos)  /*!< No clock */
/**
  * @}
  */

