zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if defined(RCC_MUXSELCFGR_MUXSEL7_Pos)
/** @defgroup RCC_LL_EC_PLL3SOURCE  PLL3 entry clock source
  * @{
  */
#define LL_RCC_PLL3SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL7_Pos)  /*!< HSI clock selected as PLL3 entry clock source */
#define LL_RCC_PLL3SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL7_Pos)  /*!< HSE clock selected as PLL3 entry clock source */
#define LL_RCC_PLL3SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL7_Pos)  /*!< MSI clock selected as PLL3 entry clock source */
#define LL_RCC_PLL3SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL7_Pos)  /*!< No clock */
/**
  * @}
  */
#endif /* RCC_MUXSELCFGR_MUXSEL7_Pos */

/** @defgroup RCC_LL_EC_PLL4SOURCE  PLL4 entry clock source
  * @{
  */
#define LL_RCC_PLL4SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< HSI clock selected as PLL4 entry clock source */
#define LL_RCC_PLL4SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< HSE clock selected as PLL4 entry clock source */
#define LL_RCC_PLL4SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< MSI clock selected as PLL4 entry clock source */
#if defined(LL_RCC_XBAR_CLKSRC_CK_IN)
#define LL_RCC_PLL4SOURCE_CKIN        (0x5U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< CKIN clock selected as PLL4 entry clock source */
#define LL_RCC_PLL4SOURCE_NONE        (0x6U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#else
#define LL_RCC_PLL4SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#endif /* LL_RCC_XBAR_CLKSRC_CK_IN */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL5SOURCE  PLL5 entry clock source
  * @{
  */
#define LL_RCC_PLL5SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL1_Pos)  /*!< HSI clock selected as PLL5 entry clock source */
#define LL_RCC_PLL5SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL1_Pos)  /*!< HSE clock selected as PLL5 entry clock source */
#define LL_RCC_PLL5SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL1_Pos)  /*!< MSI clock selected as PLL5 entry clock source */
#if defined(LL_RCC_XBAR_CLKSRC_CK_IN)
#define LL_RCC_PLL5SOURCE_CKIN        (0x5U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< CKIN clock selected as PLL4 entry clock source */
#define LL_RCC_PLL5SOURCE_NONE        (0x6U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#else
#define LL_RCC_PLL5SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#endif /* LL_RCC_XBAR_CLKSRC_CK_IN */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL6SOURCE  PLL6 entry clock source
  * @{
  */
#define LL_RCC_PLL6SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL2_Pos)  /*!< HSI clock selected as PLL6 entry clock source */
#define LL_RCC_PLL6SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL2_Pos)  /*!< HSE clock selected as PLL6 entry clock source */
#define LL_RCC_PLL6SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL2_Pos)  /*!< MSI clock selected as PLL6 entry clock source */
#if defined(LL_RCC_XBAR_CLKSRC_CK_IN)
#define LL_RCC_PLL6SOURCE_CKIN        (0x5U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< CKIN clock selected as PLL4 entry clock source */
#define LL_RCC_PLL6SOURCE_NONE        (0x6U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#else
#define LL_RCC_PLL6SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#endif /* LL_RCC_XBAR_CLKSRC_CK_IN */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL7SOURCE  PLL7 entry clock source
  * @{
  */
#define LL_RCC_PLL7SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL3_Pos)  /*!< HSI clock selected as PLL7 entry clock source */
#define LL_RCC_PLL7SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL3_Pos)  /*!< HSE clock selected as PLL7 entry clock source */
#define LL_RCC_PLL7SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL3_Pos)  /*!< MSI clock selected as PLL7 entry clock source */
#if defined(LL_RCC_XBAR_CLKSRC_CK_IN)
#define LL_RCC_PLL7SOURCE_CKIN        (0x5U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< CKIN clock selected as PLL4 entry clock source */
#define LL_RCC_PLL7SOURCE_NONE        (0x6U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#else
#define LL_RCC_PLL7SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#endif /* LL_RCC_XBAR_CLKSRC_CK_IN */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL8SOURCE  PLL8 entry clock source
  * @{
  */
#define LL_RCC_PLL8SOURCE_HSI         (0x0U << RCC_MUXSELCFGR_MUXSEL4_Pos)  /*!< HSI clock selected as PLL8 entry clock source */
#define LL_RCC_PLL8SOURCE_HSE         (0x1U << RCC_MUXSELCFGR_MUXSEL4_Pos)  /*!< HSE clock selected as PLL8 entry clock source */
#define LL_RCC_PLL8SOURCE_MSI         (0x2U << RCC_MUXSELCFGR_MUXSEL4_Pos)  /*!< MSI clock selected as PLL8 entry clock source */
#if defined(LL_RCC_XBAR_CLKSRC_CK_IN)
#define LL_RCC_PLL8SOURCE_CKIN        (0x5U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< CKIN clock selected as PLL4 entry clock source */
#define LL_RCC_PLL8SOURCE_NONE        (0x6U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#else
#define LL_RCC_PLL8SOURCE_NONE        (0x3U << RCC_MUXSELCFGR_MUXSEL0_Pos)  /*!< No clock */
#endif /* LL_RCC_XBAR_CLKSRC_CK_IN */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL2_SSCG_MODE  PLL2 Spread Spectrum Mode
  * @{
  */
#define LL_RCC_PLL2SSCG_CENTER_SPREAD          0x00000000U              /*!< Center-spread modulation selected (default after reset) */
#define LL_RCC_PLL2SSCG_DOWN_SPREAD            RCC_PLL1CFGR3_DOWNSPREAD /*!< Down-spread modulation selected */
/**
  * @}
  */

#if defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_SPI1_CLKSOURCE                 0x0U
#define  LL_RCC_SPI2_CLKSOURCE                 0x1U
#define  LL_RCC_SPI3_CLKSOURCE                 0x2U
#define  LL_RCC_SPI45_CLKSOURCE                0x3U
#define  LL_RCC_SPI6_CLKSOURCE                 0x4U
#elif defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_SPI1_CLKSOURCE                 0x0U
#define  LL_RCC_SPI23_CLKSOURCE                0x1U
#define  LL_RCC_SPI45_CLKSOURCE                0x2U
#define  LL_RCC_SPI8_CLKSOURCE                 0x3U
#else
#define  LL_RCC_SPI1_CLKSOURCE                 0x0U
#define  LL_RCC_SPI23_CLKSOURCE                0x1U
#define  LL_RCC_SPI45_CLKSOURCE                0x2U
#define  LL_RCC_SPI67_CLKSOURCE                0x3U
#define  LL_RCC_SPI8_CLKSOURCE                 0x4U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

