zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_USART1_CLKSOURCE               0x0U
#define  LL_RCC_UART24_CLKSOURCE               0x1U
#define  LL_RCC_USART35_CLKSOURCE              0x2U
#define  LL_RCC_USART6_CLKSOURCE               0x3U
#define  LL_RCC_UART7_CLKSOURCE                0x4U
#define  LL_RCC_LPUART1_CLKSOURCE              0x5U
#define  LL_RCC_UART78_CLKSOURCE               LL_RCC_UART7_CLKSOURCE    /* backward compatibility */
#elif defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_USART1_CLKSOURCE               0x0U
#define  LL_RCC_UART24_CLKSOURCE               0x1U
#define  LL_RCC_USART35_CLKSOURCE              0x2U
#define  LL_RCC_USART6_CLKSOURCE               0x3U
#define  LL_RCC_UART78_CLKSOURCE               0x4U
#define  LL_RCC_LPUART1_CLKSOURCE              0x5U
#else
#define  LL_RCC_USART1_CLKSOURCE               0x0U
#define  LL_RCC_UART24_CLKSOURCE               0x1U
#define  LL_RCC_USART35_CLKSOURCE              0x2U
#define  LL_RCC_USART6_CLKSOURCE               0x3U
#define  LL_RCC_UART78_CLKSOURCE               0x4U
#define  LL_RCC_UART9_CLKSOURCE                0x5U
#define  LL_RCC_LPUART1_CLKSOURCE              0x6U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_SAI1_MDF1_CLKSOURCE            0x0U
#else
#define  LL_RCC_SAI1_CLKSOURCE                 0x0U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
#define  LL_RCC_SAI2_CLKSOURCE                 0x1U
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_SAI34_CLKSOURCE                0x2U
#else
#define  LL_RCC_SAI3_CLKSOURCE                 0x2U
#define  LL_RCC_SAI4_CLKSOURCE                 0x3U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_I2C12_CLKSOURCE                0x0U
#define  LL_RCC_I2C3_CLKSOURCE                 0x1U
#define  LL_RCC_I3C12_CLKSOURCE                0x0U
#define  LL_RCC_I3C3_CLKSOURCE                 0x1U
#elif defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_I2C12_I3C12_CLKSOURCE          0x0U
#define  LL_RCC_I2C7_CLKSOURCE                 0x1U
#define  LL_RCC_I3C4_CLKSOURCE                 0x2U
#define  LL_RCC_I2C8_CLKSOURCE                 0x3U
#else
#define  LL_RCC_I2C12_I3C12_CLKSOURCE          0x0U
#define  LL_RCC_I2C46_CLKSOURCE                0x1U
#define  LL_RCC_I2C35_I3C3_CLKSOURCE           0x2U
#define  LL_RCC_I2C7_CLKSOURCE                 0x3U
#define  LL_RCC_I3C4_CLKSOURCE                 0x4U
#define  LL_RCC_I2C8_CLKSOURCE                 0x5U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#define  LL_RCC_SDMMC1_CLKSOURCE               0x0U
#define  LL_RCC_SDMMC2_CLKSOURCE               0x1U
#define  LL_RCC_SDMMC3_CLKSOURCE               0x2U

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_ETH1_ETHSW_CLKSOURCE           0x0U
#define  LL_RCC_ETH2_CLKSOURCE                 0x1U
#define  LL_RCC_ETH1PTP_ETH2PTP_CLKSOURCE      0x2U
#else
#define  LL_RCC_ETH1_CLKSOURCE                 0x0U
#define  LL_RCC_ETH2_CLKSOURCE                 0x1U
#define  LL_RCC_ETH1PTP_ETH2PTP_CLKSOURCE      0x2U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#define  LL_RCC_OSPI1_CLKSOURCE                0x0U
#if defined(RCC_OSPI2CFGR_OSPI2EN)
#define  LL_RCC_OSPI2_CLKSOURCE                0x1U
#endif /* RCC_OSPI2CFGR_OSPI2EN */

#define  LL_RCC_FMC_CLKSOURCE                  0x0U

#define  LL_RCC_FDCAN_CLKSOURCE                0x0U

#define  LL_RCC_SPDIFRX_CLKSOURCE              0x0U

#define  LL_RCC_USB2PHY1_CLKSOURCE             0x0U
#define  LL_RCC_USB2PHY2_CLKSOURCE             0x1U
#if defined(USB3PCIEPHY)
#define  LL_RCC_USB3PCIEPHY_CLKSOURCE          0x2U
#endif /* USB3PCIEPHY */

#define  LL_RCC_STGEN_CLKSOURCE                0x0U

#define  LL_RCC_DSIBLANE_CLKSOURCE             0x0U
#define  LL_RCC_DSIPHY_CLKSOURCE               0x1U

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_ADC12_CLKSOURCE                0x0U
#define  LL_RCC_ADC3_CLKSOURCE                 0x1U
#else
#define  LL_RCC_ADC1_CLKSOURCE                 0x0U
#define  LL_RCC_ADC2_CLKSOURCE                 0x1U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#define  LL_RCC_LPTIM12_CLKSOURCE              0x0U
#define  LL_RCC_LPTIM3_CLKSOURCE               0x1U
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#define  LL_RCC_LPTIM45_CLKSOURCE              0x2U
#else
#define  LL_RCC_LPTIM4_CLKSOURCE               0x2U
#define  LL_RCC_LPTIM5_CLKSOURCE               0x3U
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @}
  */
/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros RCC Exported Macros
  * @{
  */

/** @defgroup RCC_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RCC register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_RCC_WriteReg(__REG__, __VALUE__) WRITE_REG(RCC->__REG__, (__VALUE__))

/**
  * @brief  Read a value in RCC register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_RCC_ReadReg(__REG__) READ_REG(RCC->__REG__)
/**
  * @}
  */

/** @defgroup RCC_LL_EM_CALC_FREQ Calculate frequencies
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Functions RCC Exported Functions
  * @{
  */

/** @defgroup RCC_LL_EF_HSE HSE
  * @{
  */

/**
  * @brief  Enable the Clock Security System.
  * @note Once HSE Clock Security System is enabled it cannot be changed anymore unless
  *       a reset occurs or system enter in standby mode.
  * @rmtoll OCENSETR       HSECSSON         LL_RCC_HSE_EnableCSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_EnableCSS(void)
{
  SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSECSSON);
}

/**
  * @brief  Enable HSE external digital oscillator (HSE Digital Bypass)
  * @rmtoll OCENSETR     DIGBYP       LL_RCC_HSE_EnableDigBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_EnableDigBypass(void)
{
  WRITE_REG(RCC->OCENSETR, RCC_OCENSETR_HSEBYP);
  WRITE_REG(RCC->OCENSETR, RCC_OCENSETR_HSEDIGBYP);
}

/**
  * @brief  Disable HSE external digital oscillator (HSE Digital Bypass)
  * @rmtoll OCENCLRR     DIGBYP       LL_RCC_HSE_DisableDigBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_DisableDigBypass(void)
{
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSEBYP);
  WRITE_REG(RCC->OCENCLRR, RCC_OCENSETR_HSEDIGBYP);
}

/**
  * @brief  Enable HSE external oscillator (HSE Bypass)
  * @rmtoll OCENSETR     HSEBYP        LL_RCC_HSE_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_EnableBypass(void)
{
  WRITE_REG(RCC->OCENSETR, RCC_OCENSETR_HSEBYP);
}

/**
  * @brief  Disable HSE external oscillator (HSE Bypass)
  * @rmtoll OCENCLRR     HSEBYP        LL_RCC_HSE_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_DisableBypass(void)
{
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSEBYP);
}

/**
  * @brief  Enable HSE crystal oscillator (HSE ON)
  * @rmtoll OCENCLRR      HSEON         LL_RCC_HSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_Enable(void)
{
  WRITE_REG(RCC->OCENSETR, RCC_OCENSETR_HSEON);
}

/**
  * @brief  Disable HSE crystal oscillator (HSE ON)
  * @rmtoll OCENCLRR           HSEON         LL_RCC_HSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_Disable(void)
{
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSEON);
}

/**
  * @brief  Check if HSE oscillator is Ready
  * @rmtoll OCRDYR           HSERDY        LL_RCC_HSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsReady(void)
{
  return ((READ_BIT(RCC->OCRDYR, RCC_OCRDYR_HSERDY) == RCC_OCRDYR_HSERDY) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_HSI HSI
  * @{
  */

/**
  * @brief  Enable HSI even in stop mode
  * @note HSI oscillator is forced ON even in Stop mode
  * @rmtoll OCENSETR     HSIKERON      LL_RCC_HSI_EnableInStopMode
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_EnableInStopMode(void)
{
  WRITE_REG(RCC->OCENSETR, RCC_OCENSETR_HSIKERON);
}

/**
  * @brief  Disable HSI in stop mode
  * @rmtoll OCENCLRR     HSIKERON      LL_RCC_HSI_DisableInStopMode
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_DisableInStopMode(void)
{
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSIKERON);
}

/**
  * @brief  Enable HSI oscillator
  * @rmtoll OCENSETR     HSION         LL_RCC_HSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_Enable(void)
{
  WRITE_REG(RCC->OCENSETR, RCC_OCENSETR_HSION);
}

/**
  * @brief  Disable HSI oscillator
  * @rmtoll OCENCLRR     HSION         LL_RCC_HSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_Disable(void)
{
  WRITE_REG(RCC->OCENCLRR, RCC_OCENCLRR_HSION);
}

/**
  * @brief  Check if HSI clock is ready
  * @rmtoll OCRDYR       HSIRDY        LL_RCC_HSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_IsReady(void)
{
  return ((READ_BIT(RCC->OCRDYR, RCC_OCRDYR_HSIRDY) == RCC_OCRDYR_HSIRDY) ? 1UL : 0UL);
}

/**
  * @brief  Get HSI Calibration value
  * @note When HSITRIM is written, HSICAL is updated with the sum of
  *       HSITRIM and the factory trim value
  * @rmtoll HSICFGR        HSICAL        LL_RCC_HSI_GetCalibration
  * @retval Between Min_Data = 0x00 and Max_Data = 0xFFF
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCC->HSICFGR, RCC_HSICFGR_HSICAL) >> RCC_HSICFGR_HSICAL_Pos);
}

/**
  * @brief  Set HSI Calibration trimming
  * @note user-programmable trimming value that is added to the HSICAL
  * @note Default value is 0
  * @rmtoll HSICFGR        HSITRIM       LL_RCC_HSI_SetCalibTrimming
  * @param  Value Between Min_Data = 0x0 and Max_Data = 0x7F
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_SetCalibTrimming(uint32_t Value)
{
  MODIFY_REG(RCC->HSICFGR, RCC_HSICFGR_HSITRIM, Value << RCC_HSICFGR_HSITRIM_Pos);
}

/**
  * @brief  Get HSI Calibration trimming
  * @rmtoll HSICFGR        HSITRIM       LL_RCC_HSI_GetCalibTrimming
  * @retval Between Min_Data = 0 and Max_Data = 0x7F
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_GetCalibTrimming(void)
{
  return (uint32_t)(READ_BIT(RCC->HSICFGR, RCC_HSICFGR_HSITRIM) >> RCC_HSICFGR_HSITRIM_Pos);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_MSI MSI
  * @{
  */

/**
  * @brief  Get MSI Calibration value
  * @note When MSITRIM is written, MSICAL is updated with the sum of
  *       MSITRIM and the factory trim value
  * @rmtoll MSICFGR        MSICAL        LL_RCC_MSI_GetCalibration
  * @retval A value between 0 and 255 (0xFF)
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCC->MSICFGR, RCC_MSICFGR_MSICAL) >> RCC_MSICFGR_MSICAL_Pos);
}

/**
  * @brief  Set MSI Calibration trimming
  * @note user-programmable trimming value that is added to the MSICAL
  * @note Default value is 16 (0x10) which, when added to the MSICAL value,
  *       should trim the MSI to 4 MHz
  * @rmtoll MSICFGR        MSITRIM       LL_RCC_MSI_SetCalibTrimming
  * @param  Value can be a value between 0 and 31
  * @retval None
  */
__STATIC_INLINE void LL_RCC_MSI_SetCalibTrimming(uint32_t Value)
{
  MODIFY_REG(RCC->MSICFGR, RCC_MSICFGR_MSITRIM, Value << RCC_MSICFGR_MSITRIM_Pos);
}

/**
  * @brief  Get MSI Calibration trimming
  * @rmtoll MSICFGR        MSITRIM       LL_RCC_MSI_GetCalibTrimming
  * @retval A value between 0 and 31
  */
__STATIC_INLINE uint32_t LL_RCC_MSI_GetCalibTrimming(void)
{
  return (uint32_t)(READ_BIT(RCC->MSICFGR, RCC_MSICFGR_MSITRIM) >> RCC_MSICFGR_MSITRIM_Pos);

