zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
__STATIC_INLINE uint32_t LL_RCC_GetAPB5Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB5DIVR, RCC_APB5DIVR_APB5DIV));
}
#endif /* RCC_APB5DIVR_APB5DIV */

/**
  * @brief  Get the APBDBG prescaler
  * @rmtoll APBDBGDIVR         APBDBG           LL_RCC_GetAPBDBGPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APBDBG_DIV_1
  *         @arg @ref LL_RCC_APBDBG_DIV_2
  *         @arg @ref LL_RCC_APBDBG_DIV_4
  *         @arg @ref LL_RCC_APBDBG_DIV_8
  *         @arg @ref LL_RCC_APBDBG_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPBDBGPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APBDBGDIVR, RCC_APBDBGDIVR_APBDBGDIV));
}

/** @defgroup RCC_LL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */

/**
  * @brief  Set Cross Bar Clock Source
  * @rmtoll XBARxCFGR         XBARxSEL        LL_RCC_SetCrossbarSource
  * @param  xbar_id This parameter value can be between 0-63
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCrossbarSource(uint32_t xbar_id, uint32_t Source)
{
  WRITE_REG(RCC->XBARxCFGR[xbar_id], (Source & RCC_XBARxCFGR_XBARxSEL_Msk) | (1U << 6));
}

/**
  * @brief  Get Cross Bar Clock Source
  * @rmtoll XBARxCFGR         XBARxSEL        LL_RCC_GetCrossbarSource
  * @param  xbar_id This parameter value can be between 0-63
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_GetCrossbarSource(uint32_t xbar_id)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[xbar_id], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Get LPTIM1_2 clock source select
  * @rmtoll XBAR7CFGR      XBAR7SEL      LL_RCC_GetLPTIM1_2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM1_2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[7], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set LPTIM1_2 Clock Source
  * @rmtoll XBAR7CFGR         XBAR7SEL        LL_RCC_SetLPTIM1_2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM1_2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[7], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable LPTIM1_2 kernel clock
  * @rmtoll XBAR7CFGR         XBAR7EN         LL_RCC_EnableLPTIM1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM1_2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[7], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable LPTIM1_2 kernel clock
  * @rmtoll XBAR7CFGR         XBAR7EN         LL_RCC_DisableLPTIM1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM1_2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[7], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get USART2_4 clock source select
  * @rmtoll XBAR8CFGR      XBAR8SEL      LL_RCC_GetUSART2_4ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART2_4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[8], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART2_4 Clock Source
  * @rmtoll XBAR8CFGR         XBAR8SEL        LL_RCC_SetUSART2_4ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART2_4ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[8], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART2_4 kernel clock
  * @rmtoll XBAR8CFGR         XBAR8EN         LL_RCC_EnableUSART2_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART2_4_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[8], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART2_4 kernel clock
  * @rmtoll XBAR8CFGR         XBAR8EN         LL_RCC_DisableUSART2_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART2_4_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[8], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get UART3_5 clock source select
  * @rmtoll XBAR9CFGR      XBAR9SEL      LL_RCC_GetUSART3_5ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART3_5ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[9], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART3_5 Clock Source
  * @rmtoll XBAR9CFGR         XBAR9SEL        LL_RCC_SetUSART3_5ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART3_5ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[9], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART3_5 kernel clock
  * @rmtoll XBAR9CFGR         XBAR9EN         LL_RCC_EnableUSART3_5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART3_5_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[9], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART3_5 kernel clock
  * @rmtoll XBAR9CFGR         XBAR9EN         LL_RCC_DisableUSART3_5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART3_5_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[9], RCC_XBARxCFGR_XBARxEN);
}

