zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I2C1_2_I3C1_2 clock source select
  * @rmtoll XBAR12CFGR      XBAR12SEL      LL_RCC_GetI2C1_2_I3C1_2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C1_2_I3C1_2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[12], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I2C1_2_I3C1_2 Clock Source
  * @rmtoll XBAR12CFGR         XBAR12SEL        LL_RCC_SetI2C1_2_I3C1_2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C1_2_I3C1_2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[12], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I2C1_2_I3C1_2 kernel clock
  * @rmtoll XBAR12CFGR         XBAR12EN         LL_RCC_EnableI2C1_2_I3C1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C1_2_I3C1_2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[12], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I2C1_2_I3C1_2 kernel clock
  * @rmtoll XBAR12CFGR         XBAR12EN         LL_RCC_DisableI2C1_2_I3C1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C1_2_I3C1_2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[12], RCC_XBARxCFGR_XBARxEN);
}

#else

/**
  * @brief  Get I2C1_2 clock source select
  * @rmtoll XBAR13CFGR      XBAR13SEL      LL_RCC_GetI2C1_2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C1_2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I2C1_2 Clock Source
  * @rmtoll XBAR13CFGR         XBAR13SEL        LL_RCC_SetI2C1_2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C1_2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I2C1_2 kernel clock
  * @rmtoll XBAR13CFGR         XBAR13EN         LL_RCC_EnableI2C1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C1_2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I2C1_2 kernel clock
  * @rmtoll XBAR13CFGR         XBAR13EN         LL_RCC_DisableI2C1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C1_2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get I3C1_2 clock source select
  * @rmtoll XBAR14CFGR      XBAR14SEL      LL_RCC_GetI3C1_2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C1_2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I3C1_2 Clock Source
  * @rmtoll XBAR14CFGR         XBAR14SEL        LL_RCC_SetI3C1_2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C1_2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I3C1_2 kernel clock
  * @rmtoll XBAR14CFGR         XBAR14EN         LL_RCC_EnableI3C1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI3C1_2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I3C1_2 kernel clock
  * @rmtoll XBAR14CFGR         XBAR14EN         LL_RCC_DisableI3C1_2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI3C1_2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

