zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)

/**
  * @brief  Get I2C3_5_I3C3 clock source select
  * @rmtoll XBAR13CFGR      XBAR13SEL      LL_RCC_GetI2C3_5_I3C3ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C3_5_I3C3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I2C3_5_I3C3 Clock Source
  * @rmtoll XBAR13CFGR         XBAR13SEL        LL_RCC_SetI2C3_5_I3C3ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C3_5_I3C3ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I2C3_5_I3C3 kernel clock
  * @rmtoll XBAR13CFGR         XBAR13EN         LL_RCC_EnableI2C3_5_I3C3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C3_5_I3C3_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I2C3_5_I3C3 kernel clock
  * @rmtoll XBAR13CFGR         XBAR13EN         LL_RCC_DisableI2C3_5_I3C3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C3_5_I3C3_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[13], RCC_XBARxCFGR_XBARxEN);
}

#else

/**
  * @brief  Get I2C3 clock source select
  * @rmtoll XBAR38CFGR      XBAR38SEL      LL_RCC_GetI2C3ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[38], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I2C3 Clock Source
  * @rmtoll XBAR38CFGR         XBAR38SEL        LL_RCC_SetI2C3ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C3ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[38], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I2C3 kernel clock
  * @rmtoll XBAR38CFGR         XBAR38EN         LL_RCC_EnableI2C3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C3_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[38], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I2C3 kernel clock
  * @rmtoll XBAR38CFGR         XBAR38EN         LL_RCC_DisableI2C3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C3_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[38], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get I3C3 clock source select
  * @rmtoll XBAR36CFGR      XBAR36SEL      LL_RCC_GetI3C3ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I3C3 Clock Source
  * @rmtoll XBAR36CFGR         XBAR36SEL        LL_RCC_SetI3C3ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C3ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I3C3 kernel clock
  * @rmtoll XBAR36CFGR         XBAR36EN         LL_RCC_EnableI3C3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI3C3_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I3C3 kernel clock
  * @rmtoll XBAR36CFGR         XBAR36EN         LL_RCC_DisableI3C3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI3C3_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
#endif /* RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING */

