zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
#if !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I2C4_6 clock source select
  * @rmtoll XBAR14CFGR      XBAR14SEL      LL_RCC_GetI2C4_6ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C4_6ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I2C4_6 Clock Source
  * @rmtoll XBAR14CFGR         XBAR14SEL        LL_RCC_SetI2C4_6ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C4_6ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I2C4_6 kernel clock
  * @rmtoll XBAR14CFGR         XBAR14EN         LL_RCC_EnableI2C4_6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C4_6_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I2C4_6 kernel clock
  * @rmtoll XBAR14CFGR         XBAR14EN         LL_RCC_DisableI2C4_6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C4_6_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[14], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get I2C7 clock source select
  * @rmtoll XBAR15CFGR      XBAR15SEL      LL_RCC_GetI2C7ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C7ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[15], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I2C7 Clock Source
  * @rmtoll XBAR15CFGR         XBAR15SEL        LL_RCC_SetI2C7ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C7ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[15], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I2C7 kernel clock
  * @rmtoll XBAR15CFGR         XBAR15EN         LL_RCC_EnableI2C7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C7_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[15], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I2C7 kernel clock
  * @rmtoll XBAR15CFGR         XBAR15EN         LL_RCC_DisableI2C7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C7_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[15], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get SPI1 clock source select
  * @rmtoll XBAR16CFGR      XBAR16SEL      LL_RCC_GetSPI1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[16], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SPI1 Clock Source
  * @rmtoll XBAR16CFGR         XBAR16SEL        LL_RCC_SetSPI1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[16], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SPI1 kernel clock
  * @rmtoll XBAR16CFGR         XBAR16EN         LL_RCC_EnableSPI1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[16], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SPI1 kernel clock
  * @rmtoll XBAR16CFGR         XBAR16EN         LL_RCC_DisableSPI1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[16], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get SPI4_5 clock source select
  * @rmtoll XBAR17CFGR      XBAR17SEL      LL_RCC_GetSPI4_5ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI4_5ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[17], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SPI4_5 Clock Source
  * @rmtoll XBAR17CFGR         XBAR17SEL        LL_RCC_SetSPI4_5ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI4_5ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[17], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SPI4_5 kernel clock
  * @rmtoll XBAR17CFGR         XBAR17EN         LL_RCC_EnableSPI4_5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI4_5_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[17], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SPI4_5 kernel clock
  * @rmtoll XBAR17CFGR         XBAR17EN         LL_RCC_DisableSPI4_5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI4_5_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[17], RCC_XBARxCFGR_XBARxEN);
}

