zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SPI6_7 clock source select
  * @rmtoll XBAR18CFGR      XBAR18SEL      LL_RCC_GetSPI6_7ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI6_7ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SPI6_7 Clock Source
  * @rmtoll XBAR18CFGR         XBAR18SEL        LL_RCC_SetSPI6_7ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI6_7ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SPI6_7 kernel clock
  * @rmtoll XBAR18CFGR         XBAR18EN         LL_RCC_EnableSPI6_7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI6_7_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SPI6_7 kernel clock
  * @rmtoll XBAR18CFGR         XBAR18EN         LL_RCC_DisableSPI6_7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI6_7_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxEN);
}
#else
/**
  * @brief  Get SPI6 clock source select
  * @rmtoll XBAR37CFGR      XBAR37SEL      LL_RCC_GetSPI6ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI6ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[37], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SPI6 Clock Source
  * @rmtoll XBAR37CFGR         XBAR37SEL        LL_RCC_SetSPI6ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI6ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[37], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SPI6 kernel clock
  * @rmtoll XBAR37CFGR         XBAR37EN         LL_RCC_EnableSPI6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI6_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[37], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SPI6 kernel clock
  * @rmtoll XBAR37CFGR         XBAR37EN         LL_RCC_DisableSPI6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI6_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[37], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
#endif /* RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART1 clock source select
  * @rmtoll XBAR19CFGR      XBAR19SEL      LL_RCC_GetUSART1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART1 Clock Source
  * @rmtoll XBAR19CFGR         XBAR19SEL        LL_RCC_SetUSART1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART1 kernel clock
  * @rmtoll XBAR19CFGR         XBAR19EN         LL_RCC_EnableUSART1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART1 kernel clock
  * @rmtoll XBAR19CFGR         XBAR19EN         LL_RCC_DisableUSART1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxEN);
}
#else
/**
  * @brief  Get USART1 clock source select
  * @rmtoll XBAR18CFGR      XBAR18SEL      LL_RCC_GetUSART1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART1 Clock Source
  * @rmtoll XBAR18CFGR         XBAR18SEL        LL_RCC_SetUSART1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART1 kernel clock
  * @rmtoll XBAR18CFGR         XBAR18EN         LL_RCC_EnableUSART1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART1 kernel clock
  * @rmtoll XBAR18CFGR         XBAR18EN         LL_RCC_DisableUSART1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[18], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
/**
  * @brief  Get UART2_4 clock source select
  * @rmtoll XBAR8CFGR      XBAR8SEL      LL_RCC_GetUART24ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART2_4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[8], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Get UART3_5 clock source select
  * @rmtoll XBAR9CFGR      XBAR9SEL      LL_RCC_GetUART3_5ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART3_5ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[9], RCC_XBARxCFGR_XBARxSEL_Msk));
}

