zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART6 clock source select
  * @rmtoll XBAR20CFGR      XBAR20SEL      LL_RCC_GetUSART6ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART6ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART6 Clock Source
  * @rmtoll XBAR20CFGR         XBAR20SEL        LL_RCC_SetUSART6ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART6ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART6 kernel clock
  * @rmtoll XBAR20CFGR         XBAR20EN         LL_RCC_EnableUSART6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART6_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART6 kernel clock
  * @rmtoll XBAR20CFGR         XBAR20EN         LL_RCC_DisableUSART6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART6_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxEN);
}
#else
/**
  * @brief  Get USART6 clock source select
  * @rmtoll XBAR19CFGR      XBAR19SEL      LL_RCC_GetUSART6ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART6ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART6 Clock Source
  * @rmtoll XBAR19CFGR         XBAR19SEL        LL_RCC_SetUSART6ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART6ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART6 kernel clock
  * @rmtoll XBAR19CFGR         XBAR19EN         LL_RCC_EnableUSART6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART6_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART6 kernel clock
  * @rmtoll XBAR19CFGR         XBAR19EN         LL_RCC_DisableUSART6
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART6_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[19], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART7_8 clock source select
  * @rmtoll XBAR21CFGR      XBAR21SEL      LL_RCC_GetUSART7_8ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART7_8ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART7_8 Clock Source
  * @rmtoll XBAR21CFGR         XBAR21SEL        LL_RCC_SetUSART7_8ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART7_8ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART7_8 kernel clock
  * @rmtoll XBAR21CFGR         XBAR21EN         LL_RCC_EnableUSART7_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART7_8_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART7_8 kernel clock
  * @rmtoll XBAR21CFGR         XBAR21EN         LL_RCC_DisableUSART7_8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART7_8_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxEN);
}

#else

/**
  * @brief  Get USART7 clock source select
  * @rmtoll XBAR20CFGR      XBAR20SEL      LL_RCC_GetUSART7ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART7ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USART7 Clock Source
  * @rmtoll XBAR20CFGR         XBAR20SEL        LL_RCC_SetUSART7ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART7ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USART7 kernel clock
  * @rmtoll XBAR20CFGR         XBAR20EN         LL_RCC_EnableUSART7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART7_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USART7 kernel clock
  * @rmtoll XBAR20CFGR         XBAR20EN         LL_RCC_DisableUSART7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART7_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[20], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING) && !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get UART9 clock source select
  * @rmtoll XBAR22CFGR      XBAR22SEL      LL_RCC_GetUART9ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART9ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set UART9 Clock Source
  * @rmtoll XBAR22CFGR         XBAR22SEL        LL_RCC_SetUART9ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUART9ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable UART9 kernel clock
  * @rmtoll XBAR22CFGR         XBAR22EN         LL_RCC_EnableUART9
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUART9_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable UART9 kernel clock
  * @rmtoll XBAR22CFGR         XBAR22EN         LL_RCC_DisableUART9
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUART9_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */


