zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SAI1_MDF1 clock source select
  * @rmtoll XBAR23CFGR      XBAR23SEL      LL_RCC_GetSAI1_MDF1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI1_MDF1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI1_MDF1 Clock Source
  * @rmtoll XBAR23CFGR         XBAR23SEL        LL_RCC_SetSAI1_MDF1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI1_MDF1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI1_MDF1 kernel clock
  * @rmtoll XBAR23CFGR         XBAR23EN         LL_RCC_EnableSAI1_MDF1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI1_MDF1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI1_MDF1 kernel clock
  * @rmtoll XBAR23CFGR         XBAR23EN         LL_RCC_DisableSAI1_MDF1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI1_MDF1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxEN);
}

#else

/**
  * @brief  Get MDF1 clock source select
  * @rmtoll XBAR21CFGR      XBAR21SEL      LL_RCC_GetMDF1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetMDF1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set MDF1 Clock Source
  * @rmtoll XBAR21CFGR         XBAR21SEL        LL_RCC_SetMDF1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMDF1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable MDF1 kernel clock
  * @rmtoll XBAR21CFGR         XBAR21EN         LL_RCC_EnableMDF1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableMDF1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable MDF1 kernel clock
  * @rmtoll XBAR21CFGR         XBAR21EN         LL_RCC_DisableMDF1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableMDF1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[21], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get SAI1 clock source select
  * @rmtoll XBAR22CFGR      XBAR22SEL      LL_RCC_GetSAI1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI1 Clock Source
  * @rmtoll XBAR22CFGR         XBAR22SEL        LL_RCC_SetSAI1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI1 kernel clock
  * @rmtoll XBAR22CFGR         XBAR22EN         LL_RCC_EnableSAI1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI1 kernel clock
  * @rmtoll XBAR22CFGR         XBAR22EN         LL_RCC_DisableSAI1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[22], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

