zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SAI2 clock source select
  * @rmtoll XBAR24CFGR      XBAR24SEL      LL_RCC_GetSAI2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI2 Clock Source
  * @rmtoll XBAR24CFGR         XBAR24SEL        LL_RCC_SetSAI2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI2 kernel clock
  * @rmtoll XBAR24CFGR         XBAR24EN         LL_RCC_EnableSAI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI2 kernel clock
  * @rmtoll XBAR24CFGR         XBAR24EN         LL_RCC_DisableSAI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxEN);
}
#else
/**
  * @brief  Get SAI2 clock source select
  * @rmtoll XBAR23CFGR      XBAR23SEL      LL_RCC_GetSAI2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI2 Clock Source
  * @rmtoll XBAR23CFGR         XBAR23SEL        LL_RCC_SetSAI2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI2 kernel clock
  * @rmtoll XBAR23CFGR         XBAR23EN         LL_RCC_EnableSAI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI2 kernel clock
  * @rmtoll XBAR23CFGR         XBAR23EN         LL_RCC_DisableSAI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[23], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SAI3_4 clock source select
  * @rmtoll XBAR25CFGR      XBAR25SEL      LL_RCC_GetSAI3_4ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI3_4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI3_4 Clock Source
  * @rmtoll XBAR25CFGR         XBAR25SEL        LL_RCC_SetSAI3_4ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI3_4ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI3_4 kernel clock
  * @rmtoll XBAR25CFGR         XBAR25EN         LL_RCC_EnableSAI3_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI3_4_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI3_4 kernel clock
  * @rmtoll XBAR25CFGR         XBAR25EN         LL_RCC_DisableSAI3_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI3_4_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxEN);
}
#else
/**
  * @brief  Get SAI3 clock source select
  * @rmtoll XBAR24CFGR      XBAR24SEL      LL_RCC_GetSAI3ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI3 Clock Source
  * @rmtoll XBAR24CFGR         XBAR24SEL        LL_RCC_SetSAI3ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI3ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI3 kernel clock
  * @rmtoll XBAR24CFGR         XBAR24EN         LL_RCC_EnableSAI3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI3_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI3 kernel clock
  * @rmtoll XBAR24CFGR         XBAR24EN         LL_RCC_DisableSAI3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI3_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[24], RCC_XBARxCFGR_XBARxEN);
}
/**
  * @brief  Get SAI4 clock source select
  * @rmtoll XBAR25CFGR      XBAR25SEL      LL_RCC_GetSAI4ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SAI4 Clock Source
  * @rmtoll XBAR25CFGR         XBAR25SEL        LL_RCC_SetSAI4ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI4ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SAI4 kernel clock
  * @rmtoll XBAR25CFGR         XBAR25EN         LL_RCC_EnableSAI4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI4_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SAI4 kernel clock
  * @rmtoll XBAR25CFGR         XBAR25EN         LL_RCC_DisableSAI4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI4_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[25], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
/**
  * @brief  Get FDCAN clock source select
  * @rmtoll XBAR26CFGR      XBAR26SEL      LL_RCC_GetFDCANClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCANClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[26], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set FDCAN Clock Source
  * @rmtoll XBAR26CFGR         XBAR26SEL        LL_RCC_SetFDCANClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFDCANClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[26], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable FDCAN kernel clock
  * @rmtoll XBAR26CFGR         XBAR26EN         LL_RCC_EnableFDCAN
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableFDCAN_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[26], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable FDCAN kernel clock
  * @rmtoll XBAR26CFGR         XBAR26EN         LL_RCC_DisableFDCAN
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableFDCAN_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[26], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get DSIBLANE clock source select
  * @rmtoll XBAR27CFGR      XBAR27SEL      LL_RCC_GetDSIBLANEClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetDSIBLANEClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[27], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set DSIBLANE Clock Source
  * @rmtoll XBAR27CFGR         XBAR27SEL        LL_RCC_SetDSIBLANEClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDSIBLANEClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[27], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable DSIBLANE kernel clock
  * @rmtoll XBAR27CFGR         XBAR27EN         LL_RCC_EnableDSIBLANE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableDSIBLANE_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[27], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable DSIBLANE kernel clock
  * @rmtoll XBAR27CFGR         XBAR27EN         LL_RCC_DisableDSIBLANE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableDSIBLANE_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[27], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get DSIPHY clock source select
  * @rmtoll XBAR28CFGR      XBAR28SEL      LL_RCC_GetDSIPHYClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetDSIPHYClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[28], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set DSIPHY Clock Source
  * @rmtoll XBAR28CFGR         XBAR28SEL        LL_RCC_SetDSIPHYClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDSIPHYClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[28], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable DSIPHY kernel clock
  * @rmtoll XBAR28CFGR         XBAR28EN         LL_RCC_EnableDSIPHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableDSIPHY_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[28], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable DSIPHY kernel clock
  * @rmtoll XBAR28CFGR         XBAR28EN         LL_RCC_DisableDSIPHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableDSIPHY_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[28], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get CSI2 clock source select
  * @rmtoll XBAR29CFGR      XBAR29SEL      LL_RCC_GetCSI2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[29], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set CSI2 Clock Source
  * @rmtoll XBAR29CFGR         XBAR29SEL        LL_RCC_SetCSI2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[29], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable CSI2 kernel clock
  * @rmtoll XBAR29CFGR         XBAR29EN         LL_RCC_EnableCSI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCSI2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[29], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable CSI2 kernel clock
  * @rmtoll XBAR29CFGR         XBAR29EN         LL_RCC_DisableCSI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCSI2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[29], RCC_XBARxCFGR_XBARxEN);
}

