zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Get CSI2TXESC clock source select
  * @rmtoll XBAR30CFGR      XBAR30SEL      LL_RCC_GetCSI2TXESCClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2TXESCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[30], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set CSI2TXESC Clock Source
  * @rmtoll XBAR30CFGR         XBAR30SEL        LL_RCC_SetCSI2TXESCClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2TXESCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[30], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable CSI2TXESC kernel clock
  * @rmtoll XBAR30CFGR         XBAR30EN         LL_RCC_EnableCSI2TXESC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCSI2TXESC_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[30], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable CSI2TXESC kernel clock
  * @rmtoll XBAR30CFGR         XBAR30EN         LL_RCC_DisableCSI2TXESC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCSI2TXESC_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[30], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get CSI2PHY clock source select
  * @rmtoll XBAR31CFGR      XBAR31SEL      LL_RCC_GetCSI2PHYClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2PHYClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[31], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set CSI2PHY Clock Source
  * @rmtoll XBAR31CFGR         XBAR31SEL        LL_RCC_SetCSI2PHYClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2PHYClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[31], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable CSI2PHY kernel clock
  * @rmtoll XBAR31CFGR         XBAR31EN         LL_RCC_EnableCSI2PHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCSI2PHY_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[31], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable CSI2PHY kernel clock
  * @rmtoll XBAR31CFGR         XBAR31EN         LL_RCC_DisableCSI2PHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCSI2PHY_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[31], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get LVDSPHY clock source select
  * @rmtoll XBAR32CFGR      XBAR32SEL      LL_RCC_GetLVDSPHYClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLVDSPHYClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[32], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set LVDSPHY Clock Source
  * @rmtoll XBAR32CFGR         XBAR32SEL        LL_RCC_SetLVDSPHYClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLVDSPHYClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[32], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable LVDSPHY kernel clock
  * @rmtoll XBAR32CFGR         XBAR32EN         LL_RCC_EnableLVDSPHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLVDSPHY_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[32], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable LVDSPHY kernel clock
  * @rmtoll XBAR32CFGR         XBAR32EN         LL_RCC_DisableLVDSPHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLVDSPHY_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[32], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get STGEN clock source select
  * @rmtoll XBAR33CFGR      XBAR33SEL      LL_RCC_GetSTGENClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSTGENClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[33], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set STGEN Clock Source
  * @rmtoll XBAR33CFGR         XBAR33SEL        LL_RCC_SetSTGENClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSTGENClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[33], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable STGEN kernel clock
  * @rmtoll XBAR33CFGR         XBAR33EN         LL_RCC_EnableSTGEN
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSTGEN_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[33], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable STGEN kernel clock
  * @rmtoll XBAR33CFGR         XBAR33EN         LL_RCC_DisableSTGEN
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSTGEN_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[33], RCC_XBARxCFGR_XBARxEN);
}

