zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USB3PCIEPHY clock source select
  * @rmtoll XBAR34CFGR      XBAR34SEL      LL_RCC_GetUSB3PCIEPHYClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB3PCIEPHYClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[34], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USB3PCIEPHY Clock Source
  * @rmtoll XBAR34CFGR         XBAR34SEL        LL_RCC_SetUSB3PCIEPHYClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB3PCIEPHYClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[34], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USB3PCIEPHY kernel clock
  * @rmtoll XBAR34CFGR         XBAR34EN         LL_RCC_EnableUSB3PCIEPHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSB3PCIEPHY_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[34], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USB3PCIEPHY kernel clock
  * @rmtoll XBAR34CFGR         XBAR34EN         LL_RCC_DisableUSB3PCIEPHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSB3PCIEPHY_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[34], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get UCPD1 clock source select
  * @rmtoll XBAR35CFGR      XBAR35SEL      LL_RCC_GetUCPD1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUCPD1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[35], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set UCPD1 Clock Source
  * @rmtoll XBAR35CFGR         XBAR35SEL        LL_RCC_SetUCPD1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUCPD1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[35], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable UCPD1 kernel clock
  * @rmtoll XBAR35CFGR         XBAR35EN         LL_RCC_EnableUCPD1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUCPD1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[35], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable UCPD1 kernel clock
  * @rmtoll XBAR35CFGR         XBAR35EN         LL_RCC_DisableUCPD1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUCPD1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[35], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */


#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I3C4 clock source select
  * @rmtoll XBAR36CFGR      XBAR36SEL      LL_RCC_GetI3C4ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set I3C4 Clock Source
  * @rmtoll XBAR36CFGR         XBAR36SEL        LL_RCC_SetI3C4ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C4ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable I3C4 kernel clock
  * @rmtoll XBAR36CFGR         XBAR36EN         LL_RCC_EnableI3C4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI3C4_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable I3C4 kernel clock
  * @rmtoll XBAR36CFGR         XBAR36EN         LL_RCC_DisableI3C4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI3C4_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[36], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */


