zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)

/**
  * @brief  Get LPTIM4_5 clock source select
  * @rmtoll XBAR41CFGR      XBAR41SEL      LL_RCC_GetLPTIM4_5ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM4_5ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set LPTIM4_5 Clock Source
  * @rmtoll XBAR41CFGR         XBAR41SEL        LL_RCC_SetLPTIM4_5ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM4_5ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable LPTIM4_5 kernel clock
  * @rmtoll XBAR41CFGR         XBAR41EN         LL_RCC_EnableLPTIM4_5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM4_5_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable LPTIM4_5 kernel clock
  * @rmtoll XBAR41CFGR         XBAR41EN         LL_RCC_DisableLPTIM4_5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM4_5_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxEN);
}

#else

/**
  * @brief  Get LPTIM4 clock source select
  * @rmtoll XBAR41CFGR      XBAR41SEL      LL_RCC_GetLPTIM4ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM4ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set LPTIM4 Clock Source
  * @rmtoll XBAR41CFGR         XBAR41SEL        LL_RCC_SetLPTIM4ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM4ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable LPTIM4 kernel clock
  * @rmtoll XBAR41CFGR         XBAR41EN         LL_RCC_EnableLPTIM4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM4_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable LPTIM4 kernel clock
  * @rmtoll XBAR41CFGR         XBAR41EN         LL_RCC_DisableLPTIM4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM4_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[41], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get LPTIM5 clock source select
  * @rmtoll XBAR42CFGR      XBAR42SEL      LL_RCC_GetLPTIM5ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM5ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set LPTIM5 Clock Source
  * @rmtoll XBAR42CFGR         XBAR42SEL        LL_RCC_SetLPTIM5ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM5ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable LPTIM5 kernel clock
  * @rmtoll XBAR42CFGR         XBAR42EN         LL_RCC_EnableLPTIM5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM5_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable LPTIM5 kernel clock
  * @rmtoll XBAR42CFGR         XBAR42EN         LL_RCC_DisableLPTIM5
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM5_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING) && !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get ADF1 clock source select
  * @rmtoll XBAR42CFGR      XBAR42SEL      LL_RCC_GetADF1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetADF1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ADF1 Clock Source
  * @rmtoll XBAR42CFGR         XBAR42SEL        LL_RCC_SetADF1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADF1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ADF1 kernel clock
  * @rmtoll XBAR42CFGR         XBAR42EN         LL_RCC_EnableADF1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADF1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ADF1 kernel clock
  * @rmtoll XBAR42CFGR         XBAR42EN         LL_RCC_DisableADF1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADF1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[42], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get TSDBG clock source select
  * @rmtoll XBAR43CFGR      XBAR43SEL      LL_RCC_GetTSDBGClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetTSDBGClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[43], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set TSDBG Clock Source
  * @rmtoll XBAR43CFGR         XBAR43SEL        LL_RCC_SetTSDBGClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTSDBGClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[43], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable TSDBG kernel clock
  * @rmtoll XBAR43CFGR         XBAR43EN         LL_RCC_EnableTSDBG
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableTSDBG_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[43], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable TSDBG kernel clock
  * @rmtoll XBAR43CFGR         XBAR43EN         LL_RCC_DisableTSDBG
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableTSDBG_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[43], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get TPIU clock source select
  * @rmtoll XBAR44CFGR      XBAR44SEL      LL_RCC_GetTPIUClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetTPIUClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[44], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set TPIU Clock Source
  * @rmtoll XBAR44CFGR         XBAR44SEL        LL_RCC_SetTPIUClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTPIUClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[44], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable TPIU kernel clock
  * @rmtoll XBAR44CFGR         XBAR44EN         LL_RCC_EnableTPIU
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableTPIU_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[44], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable TPIU kernel clock
  * @rmtoll XBAR44CFGR         XBAR44EN         LL_RCC_DisableTPIU
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableTPIU_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[44], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ATB_METR clock source select
  * @rmtoll XBAR45CFGR      XBAR45SEL      LL_RCC_GetATB_METRClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetATB_METRClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[45], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ATB_METR Clock Source
  * @rmtoll XBAR45CFGR         XBAR45SEL        LL_RCC_SetATB_METRClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetATB_METRClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[45], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ATB_METR kernel clock
  * @rmtoll XBAR45CFGR         XBAR45EN         LL_RCC_EnableATB_METR
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableATB_METR_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[45], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ATB_METR kernel clock
  * @rmtoll XBAR45CFGR         XBAR45EN         LL_RCC_DisableATB_METR
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableATB_METR_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[45], RCC_XBARxCFGR_XBARxEN);
}

