zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get ADC12 clock source select
  * @rmtoll XBAR46CFGR      XBAR46SEL      LL_RCC_GetADC12ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC12ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ADC12 Clock Source
  * @rmtoll XBAR46CFGR         XBAR46SEL        LL_RCC_SetADC12ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC12ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ADC12 kernel clock
  * @rmtoll XBAR46CFGR         XBAR46EN         LL_RCC_EnableADC12
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC12_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ADC12 kernel clock
  * @rmtoll XBAR46CFGR         XBAR46EN         LL_RCC_DisableADC12
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC12_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ADC3 clock source select
  * @rmtoll XBAR47CFGR      XBAR47SEL      LL_RCC_GetADC3ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ADC3 Clock Source
  * @rmtoll XBAR47CFGR         XBAR47SEL        LL_RCC_SetADC3ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC3ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ADC3 kernel clock
  * @rmtoll XBAR47CFGR         XBAR47EN         LL_RCC_EnableADC3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC3_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ADC3 kernel clock
  * @rmtoll XBAR47CFGR         XBAR47EN         LL_RCC_DisableADC3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC3_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxEN);
}

#else

/**
  * @brief  Get ADC1 clock source select
  * @rmtoll XBAR46CFGR      XBAR46SEL      LL_RCC_GetADC1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ADC1 Clock Source
  * @rmtoll XBAR46CFGR         XBAR46SEL        LL_RCC_SetADC1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ADC1 kernel clock
  * @rmtoll XBAR46CFGR         XBAR46EN         LL_RCC_EnableADC1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ADC1 kernel clock
  * @rmtoll XBAR46CFGR         XBAR46EN         LL_RCC_DisableADC1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[46], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ADC2 clock source select
  * @rmtoll XBAR47CFGR      XBAR47SEL      LL_RCC_GetADC2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ADC2 Clock Source
  * @rmtoll XBAR47CFGR         XBAR47SEL        LL_RCC_SetADC2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ADC2 kernel clock
  * @rmtoll XBAR47CFGR         XBAR47EN         LL_RCC_EnableADC2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ADC2 kernel clock
  * @rmtoll XBAR47CFGR         XBAR47EN         LL_RCC_DisableADC2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[47], RCC_XBARxCFGR_XBARxEN);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get OSPI1 clock source select
  * @rmtoll XBAR48CFGR      XBAR48SEL      LL_RCC_GetOSPI1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetOSPI1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[48], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set OSPI1 Clock Source
  * @rmtoll XBAR48CFGR         XBAR48SEL        LL_RCC_SetOSPI1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOSPI1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[48], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable OSPI1 kernel clock
  * @rmtoll XBAR48CFGR         XBAR48EN         LL_RCC_EnableOSPI1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableOSPI1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[48], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable OSPI1 kernel clock
  * @rmtoll XBAR48CFGR         XBAR48EN         LL_RCC_DisableOSPI1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableOSPI1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[48], RCC_XBARxCFGR_XBARxEN);
}

#if defined(LL_RCC_OSPI2_CLKSOURCE)
/**
  * @brief  Get OSPI2 clock source select
  * @rmtoll XBAR49CFGR      XBAR49SEL      LL_RCC_GetOSPI2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetOSPI2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[49], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set OSPI2 Clock Source
  * @rmtoll XBAR49CFGR         XBAR49SEL        LL_RCC_SetOSPI2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOSPI2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[49], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable OSPI2 kernel clock
  * @rmtoll XBAR49CFGR         XBAR49EN         LL_RCC_EnableOSPI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableOSPI2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[49], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable OSPI2 kernel clock
  * @rmtoll XBAR49CFGR         XBAR49EN         LL_RCC_DisableOSPI2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableOSPI2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[49], RCC_XBARxCFGR_XBARxEN);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get FMC clock source select
  * @rmtoll XBAR50CFGR      XBAR50SEL      LL_RCC_GetFMCClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetFMCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[50], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set FMC Clock Source
  * @rmtoll XBAR50CFGR         XBAR50SEL        LL_RCC_SetFMCClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFMCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[50], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable FMC kernel clock
  * @rmtoll XBAR50CFGR         XBAR50EN         LL_RCC_EnableFMC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableFMC_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[50], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable FMC kernel clock
  * @rmtoll XBAR50CFGR         XBAR50EN         LL_RCC_DisableFMC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableFMC_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[50], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get SDMMC1 clock source select
  * @rmtoll XBAR51CFGR      XBAR51SEL      LL_RCC_GetSDMMC1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[51], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SDMMC1 Clock Source
  * @rmtoll XBAR51CFGR         XBAR51SEL        LL_RCC_SetSDMMC1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[51], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SDMMC1 kernel clock
  * @rmtoll XBAR51CFGR         XBAR51EN         LL_RCC_EnableSDMMC1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSDMMC1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[51], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SDMMC1 kernel clock
  * @rmtoll XBAR51CFGR         XBAR51EN         LL_RCC_DisableSDMMC1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSDMMC1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[51], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get SDMMC2 clock source select
  * @rmtoll XBAR52CFGR      XBAR52SEL      LL_RCC_GetSDMMC2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[52], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SDMMC2 Clock Source
  * @rmtoll XBAR52CFGR         XBAR52SEL        LL_RCC_SetSDMMC2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[52], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SDMMC2 kernel clock
  * @rmtoll XBAR52CFGR         XBAR52EN         LL_RCC_EnableSDMMC2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSDMMC2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[52], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SDMMC2 kernel clock
  * @rmtoll XBAR52CFGR         XBAR52EN         LL_RCC_DisableSDMMC2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSDMMC2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[52], RCC_XBARxCFGR_XBARxEN);
}

