zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Get SDMMC3 clock source select
  * @rmtoll XBAR53CFGR      XBAR53SEL      LL_RCC_GetSDMMC3ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC3ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[53], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set SDMMC3 Clock Source
  * @rmtoll XBAR53CFGR         XBAR53SEL        LL_RCC_SetSDMMC3ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC3ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[53], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable SDMMC3 kernel clock
  * @rmtoll XBAR53CFGR         XBAR53EN         LL_RCC_EnableSDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSDMMC3_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[53], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable SDMMC3 kernel clock
  * @rmtoll XBAR53CFGR         XBAR53EN         LL_RCC_DisableSDMMC3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSDMMC3_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[53], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ETH1 clock source select
  * @rmtoll XBAR54CFGR      XBAR54SEL      LL_RCC_GetETH1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[54], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ETH1 Clock Source
  * @rmtoll XBAR54CFGR         XBAR54SEL        LL_RCC_SetETH1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[54], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ETH1 kernel clock
  * @rmtoll XBAR54CFGR         XBAR54EN         LL_RCC_EnableETH1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETH1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[54], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ETH1 kernel clock
  * @rmtoll XBAR54CFGR         XBAR54EN         LL_RCC_DisableETH1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETH1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[54], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ETH2 clock source select
  * @rmtoll XBAR55CFGR      XBAR55SEL      LL_RCC_GetETH2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[55], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ETH2 Clock Source
  * @rmtoll XBAR55CFGR         XBAR55SEL        LL_RCC_SetETH2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[55], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ETH2 kernel clock
  * @rmtoll XBAR55CFGR         XBAR55EN         LL_RCC_EnableETH2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETH2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[55], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ETH2 kernel clock
  * @rmtoll XBAR55CFGR         XBAR55EN         LL_RCC_DisableETH2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETH2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[55], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ETH1_2_PTP clock source select
  * @rmtoll XBAR56CFGR      XBAR56SEL      LL_RCC_GetETH1_2_PTPClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1_2_PTPClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[56], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ETH1_2_PTP Clock Source
  * @rmtoll XBAR56CFGR         XBAR56SEL        LL_RCC_SetETH1_2_PTPClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH1_2_PTPClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[56], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ETH1_2_PTP kernel clock
  * @rmtoll XBAR56CFGR         XBAR56EN         LL_RCC_EnableETH1_2_PTP
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETH1_2_PTP_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[56], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ETH1_2_PTP kernel clock
  * @rmtoll XBAR56CFGR         XBAR56EN         LL_RCC_DisableETH1_2_PTP
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETH1_2_PTP_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[56], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get USB2PHY1 clock source select
  * @rmtoll XBAR57CFGR      XBAR57SEL      LL_RCC_GetUSB2PHY1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB2PHY1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[57], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USB2PHY1 Clock Source
  * @rmtoll XBAR57CFGR         XBAR57SEL        LL_RCC_SetUSB2PHY1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB2PHY1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[57], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USB2PHY1 kernel clock
  * @rmtoll XBAR57CFGR         XBAR57EN         LL_RCC_EnableUSB2PHY1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSB2PHY1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[57], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USB2PHY1 kernel clock
  * @rmtoll XBAR57CFGR         XBAR57EN         LL_RCC_DisableUSB2PHY1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSB2PHY1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[57], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get USB2PHY2 clock source select
  * @rmtoll XBAR58CFGR      XBAR58SEL      LL_RCC_GetUSB2PHY2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB2PHY2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[58], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set USB2PHY2 Clock Source
  * @rmtoll XBAR58CFGR         XBAR58SEL        LL_RCC_SetUSB2PHY2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB2PHY2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[58], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable USB2PHY2 kernel clock
  * @rmtoll XBAR58CFGR         XBAR58EN         LL_RCC_EnableUSB2PHY2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSB2PHY2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[58], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable USB2PHY2 kernel clock
  * @rmtoll XBAR58CFGR         XBAR58EN         LL_RCC_DisableUSB2PHY2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSB2PHY2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[58], RCC_XBARxCFGR_XBARxEN);
}


/**
  * @brief  Get ETHSWCFG clock source select
  * @rmtoll XBAR59CFGR      XBAR59SEL      LL_RCC_GetETHSWCFGClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHSWCFGClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[59], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ETHSWCFG Clock Source
  * @rmtoll XBAR59CFGR         XBAR59SEL        LL_RCC_SetETHSWCFGClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHSWCFGClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[59], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ETHSWCFG kernel clock
  * @rmtoll XBAR59CFGR         XBAR59EN         LL_RCC_EnableETHSWCFG
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETHSWCFG_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[59], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ETHSWCFG kernel clock
  * @rmtoll XBAR59CFGR         XBAR59EN         LL_RCC_DisableETHSWCFG
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETHSWCFG_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[59], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get ETHSWMSG clock source select
  * @rmtoll XBAR60CFGR      XBAR60SEL      LL_RCC_GetETHSWMSGClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHSWMSGClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[60], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set ETHSWMSG Clock Source
  * @rmtoll XBAR60CFGR         XBAR60SEL        LL_RCC_SetETHSWMSGClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHSWMSGClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[60], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable ETHSWMSG kernel clock
  * @rmtoll XBAR60CFGR         XBAR60EN         LL_RCC_EnableETHSWMSG
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETHSWMSG_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[60], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable ETHSWMSG kernel clock
  * @rmtoll XBAR60CFGR         XBAR60EN         LL_RCC_DisableETHSWMSG
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETHSWMSG_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[60], RCC_XBARxCFGR_XBARxEN);
}


/**
  * @brief  Get MCO1 clock source select
  * @rmtoll XBAR61CFGR      XBAR61SEL      LL_RCC_GetMCO1ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCO1ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[61], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set MCO1 Clock Source
  * @rmtoll XBAR61CFGR         XBAR61SEL        LL_RCC_SetMCO1ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMCO1ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[61], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable MCO1 kernel clock
  * @rmtoll XBAR61CFGR         XBAR61EN         LL_RCC_EnableMCO1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableMCO1_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[61], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable MCO1 kernel clock
  * @rmtoll XBAR61CFGR         XBAR61EN         LL_RCC_DisableMCO1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableMCO1_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[61], RCC_XBARxCFGR_XBARxEN);
}

