zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Get MCO2 clock source select
  * @rmtoll XBAR62CFGR      XBAR62SEL      LL_RCC_GetMCO2ClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCO2ClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[62], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set MCO2 Clock Source
  * @rmtoll XBAR62CFGR         XBAR62SEL        LL_RCC_SetMCO2ClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMCO2ClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[62], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable MCO2 kernel clock
  * @rmtoll XBAR62CFGR         XBAR62EN         LL_RCC_EnableMCO2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableMCO2_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[62], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable MCO2 kernel clock
  * @rmtoll XBAR62CFGR         XBAR62EN         LL_RCC_DisableMCO2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableMCO2_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[62], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Get CPU1EXT2F clock source select
  * @rmtoll XBAR63CFGR      XBAR63SEL      LL_RCC_GetCPU1EXT2FClockSource
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetCPU1EXT2FClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->XBARxCFGR[63], RCC_XBARxCFGR_XBARxSEL_Msk));
}

/**
  * @brief  Set CPU1EXT2F Clock Source
  * @rmtoll XBAR63CFGR         XBAR63SEL        LL_RCC_SetCPU1EXT2FClockSource
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL4_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL5_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL6_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL7_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_PLL8_FOUTPOSTDIV
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSE
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_HSEKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_MSIKER
  *        @arg @ref LL_RCC_XBAR_CLKSRC_SPDIF
  *        @arg @ref LL_RCC_XBAR_CLKSRC_I2S
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSI
  *        @arg @ref LL_RCC_XBAR_CLKSRC_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCPU1EXT2FClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->XBARxCFGR[63], RCC_XBARxCFGR_XBARxSEL_Msk, Source);
}

/**
  * @brief  Enable CPU1EXT2F kernel clock
  * @rmtoll XBAR63CFGR         XBAR63EN         LL_RCC_EnableCPU1EXT2F
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCPU1EXT2F_KerClk(void)
{
  SET_BIT(RCC->XBARxCFGR[63], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @brief  Disable CPU1EXT2F kernel clock
  * @rmtoll XBAR63CFGR         XBAR63EN         LL_RCC_DisableCPU1EXT2F
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCPU1EXT2F_KerClk(void)
{
  CLEAR_BIT(RCC->XBARxCFGR[63], RCC_XBARxCFGR_XBARxEN);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_Divider_Clock_Configuration Peripheral Clock Divider Configuration
  * @{
  */
/**
  * @brief  Get LPTIM1_2 channel pre divided Value
  * @rmtoll PREDIV7CFGR      PREDIV7      LL_RCC_GetLPTIM1_2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM1_2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[7], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LPTIM1_2 channel pre divided Value
  * @rmtoll PREDIV7CFGR         PREDIV7        LL_RCC_SetLPTIM1_2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM1_2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[7], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LPTIM1_2 channel pre divided Value
  * @rmtoll FINDIV7CFGR      FINDIV7      LL_RCC_GetLPTIM1_2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM1_2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[7], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LPTIM1_2 channel pre divided Value
  * @rmtoll FINDIV7CFGR         FINDIV7        LL_RCC_SetLPTIM1_2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM1_2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[7], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LPTIM1_2 final divider channel
  * @rmtoll FINDIV7CFGR         FINDIV7EN         LL_RCC_EnableLPTIM1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM1_2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[7], RCC_FINDIVxCFGR_FINDIVxEN);
}

/**
  * @brief  Disable LPTIM1_2 final divider channel
  * @rmtoll FINDIV7CFGR         FINDIV7EN         LL_RCC_DisableLPTIM1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM1_2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[7], RCC_FINDIVxCFGR_FINDIVxEN);
}

/**
  * @brief  Get USART2_4 channel pre divided Value
  * @rmtoll PREDIV8CFGR      PREDIV8      LL_RCC_GetUSART2_4_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART2_4_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[8], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART2_4 channel pre divided Value
  * @rmtoll PREDIV8CFGR         PREDIV8        LL_RCC_SetUSART2_4_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART2_4_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[8], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART2_4 channel pre divided Value
  * @rmtoll FINDIV8CFGR      FINDIV8      LL_RCC_GetUSART2_4_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART2_4_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[8], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART2_4 channel pre divided Value
  * @rmtoll FINDIV8CFGR         FINDIV8        LL_RCC_SetUSART2_4_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART2_4_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[8], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART2_4 final divider channel
  * @rmtoll FINDIV8CFGR         FINDIV8EN         LL_RCC_EnableUSART2_4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART2_4_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[8], RCC_FINDIVxCFGR_FINDIVxEN);
}

/**
  * @brief  Disable USART2_4 final divider channel
  * @rmtoll FINDIV8CFGR         FINDIV8EN         LL_RCC_DisableUSART2_4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART2_4_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[8], RCC_FINDIVxCFGR_FINDIVxEN);
}

/**
  * @brief  Get USART3_5 channel pre divided Value
  * @rmtoll PREDIV9CFGR      PREDIV9      LL_RCC_GetUSART3_5_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART3_5_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[9], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART3_5 channel pre divided Value
  * @rmtoll PREDIV9CFGR         PREDIV9        LL_RCC_SetUSART3_5_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART3_5_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[9], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART3_5 channel pre divided Value
  * @rmtoll FINDIV9CFGR      FINDIV9      LL_RCC_GetUSART3_5_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART3_5_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[9], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART3_5 channel pre divided Value
  * @rmtoll FINDIV9CFGR         FINDIV9        LL_RCC_SetUSART3_5_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART3_5_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[9], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART3_5 final divider channel
  * @rmtoll FINDIV9CFGR         FINDIV9EN         LL_RCC_EnableUSART3_5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART3_5_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[9], RCC_FINDIVxCFGR_FINDIVxEN);
}

/**
  * @brief  Disable USART3_5 final divider channel
  * @rmtoll FINDIV9CFGR         FINDIV9EN         LL_RCC_DisableUSART3_5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART3_5_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[9], RCC_FINDIVxCFGR_FINDIVxEN);
}

