zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get UART7_8 channel pre divided Value
  * @rmtoll PREDIV21CFGR      PREDIV21      LL_RCC_GetUART7_8_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART7_8_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[21], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Get UART7_8 channel fin divided Value
  * @rmtoll FINDIV21CFGR      FINDIV21      LL_RCC_GetUSART7_8_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART7_8_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

#else

/**
  * @brief  Get UART7 channel pre divided Value
  * @rmtoll PREDIV21CFGR      PREDIV21      LL_RCC_GetUART7_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART7_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[21], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Get UART7 channel fin divided Value
  * @rmtoll FINDIV21CFGR      FINDIV21      LL_RCC_GetUSART7_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART7_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING) && !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get UART9 channel pre divided Value
  * @rmtoll PREDIV22CFGR      PREDIV22      LL_RCC_GetUART9_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART9_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[22], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Get UART9 channel fin divided Value
  * @rmtoll FINDIV22CFGR      FINDIV22      LL_RCC_GetUSART9_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART9_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SPI2_3 channel pre divided Value
  * @rmtoll PREDIV10CFGR      PREDIV10      LL_RCC_GetSPI2_3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI2_3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[10], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI2_3 channel pre divided Value
  * @rmtoll PREDIV10CFGR         PREDIV10        LL_RCC_SetSPI2_3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI2_3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[10], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI2_3 channel pre divided Value
  * @rmtoll FINDIV10CFGR      FINDIV10      LL_RCC_GetSPI2_3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI2_3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI2_3 channel pre divided Value
  * @rmtoll FINDIV10CFGR         FINDIV10        LL_RCC_SetSPI2_3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI2_3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI2_3 final divider channel
  * @rmtoll FINDIV10CFGR         FINDIV10EN         LL_RCC_EnableSPI2_3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI2_3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI2_3 final divider channel
  * @rmtoll FINDIV10CFGR         FINDIV10EN         LL_RCC_DisableSPI2_3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI2_3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get SPI2 channel pre divided Value
  * @rmtoll PREDIV10CFGR      PREDIV10      LL_RCC_GetSPI2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[10], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI2 channel pre divided Value
  * @rmtoll PREDIV10CFGR         PREDIV10        LL_RCC_SetSPI2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[10], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI2 channel pre divided Value
  * @rmtoll FINDIV10CFGR      FINDIV10      LL_RCC_GetSPI2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI2 channel pre divided Value
  * @rmtoll FINDIV10CFGR         FINDIV10        LL_RCC_SetSPI2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI2 final divider channel
  * @rmtoll FINDIV10CFGR         FINDIV10EN         LL_RCC_EnableSPI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI2 final divider channel
  * @rmtoll FINDIV10CFGR         FINDIV10EN         LL_RCC_DisableSPI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[10], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SPI3 channel pre divided Value
  * @rmtoll PREDIV11CFGR      PREDIV11      LL_RCC_GetSPI3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[11], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI3 channel pre divided Value
  * @rmtoll PREDIV11CFGR         PREDIV11        LL_RCC_SetSPI3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[11], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI3 channel pre divided Value
  * @rmtoll FINDIV11CFGR      FINDIV11      LL_RCC_GetSPI3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI3 channel pre divided Value
  * @rmtoll FINDIV11CFGR         FINDIV11        LL_RCC_SetSPI3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI3 final divider channel
  * @rmtoll FINDIV11CFGR         FINDIV11EN         LL_RCC_EnableSPI3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI3 final divider channel
  * @rmtoll FINDIV11CFGR         FINDIV11EN         LL_RCC_DisableSPI3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined (RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SPIDFRX channel pre divided Value
  * @rmtoll PREDIV11CFGR      PREDIV11      LL_RCC_GetSPIDFRX_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPDIFRX_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[11], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPIDFRX channel pre divided Value
  * @rmtoll PREDIV11CFGR         PREDIV11        LL_RCC_SetSPIDFRX_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPDIFRX_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[11], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPIDFRX channel pre divided Value
  * @rmtoll FINDIV11CFGR      FINDIV11      LL_RCC_GetSPIDFRX_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPDIFRX_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPIDFRX channel pre divided Value
  * @rmtoll FINDIV11CFGR         FINDIV11        LL_RCC_SetSPIDFRX_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPIDFRX_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPIDFRX final divider channel
  * @rmtoll FINDIV11CFGR         FINDIV11EN         LL_RCC_EnableSPIDFRX_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPIDFRX_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPIDFRX final divider channel
  * @rmtoll FINDIV11CFGR         FINDIV11EN         LL_RCC_DisableSPIDFRX_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPDIFRX_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[11], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get SPIDFRX channel pre divided Value
  * @rmtoll PREDIV12CFGR      PREDIV12      LL_RCC_GetSPIDFRX_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPDIFRX_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[12], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPIDFRX channel pre divided Value
  * @rmtoll PREDIV12CFGR         PREDIV12        LL_RCC_SetSPIDFRX_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPDIFRX_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[12], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPIDFRX channel pre divided Value
  * @rmtoll FINDIV12CFGR      FINDIV12      LL_RCC_GetSPIDFRX_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPDIFRX_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPIDFRX channel pre divided Value
  * @rmtoll FINDIV12CFGR         FINDIV12        LL_RCC_SetSPIDFRX_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPIDFRX_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPIDFRX final divider channel
  * @rmtoll FINDIV12CFGR         FINDIV12EN         LL_RCC_EnableSPIDFRX_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPIDFRX_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPIDFRX final divider channel
  * @rmtoll FINDIV12CFGR         FINDIV12EN         LL_RCC_DisableSPIDFRX_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPDIFRX_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

