zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I2C1_2_I3C1_2 channel pre divided Value
  * @rmtoll PREDIV12CFGR      PREDIV12      LL_RCC_GetI2C1_2_I3C1_2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C1_2_I3C1_2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[12], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C1_2_I3C1_2 channel pre divided Value
  * @rmtoll PREDIV12CFGR         PREDIV12        LL_RCC_SetI2C1_2_I3C1_2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C1_2_I3C1_2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[12], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C1_2_I3C1_2 channel pre divided Value
  * @rmtoll FINDIV12CFGR      FINDIV12      LL_RCC_GetI2C1_2_I3C1_2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C1_2_I3C1_2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C1_2_I3C1_2 channel pre divided Value
  * @rmtoll FINDIV12CFGR         FINDIV12        LL_RCC_SetI2C1_2_I3C1_2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C1_2_I3C1_2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C1_2_I3C1_2 final divider channel
  * @rmtoll FINDIV12CFGR         FINDIV12EN         LL_RCC_EnableI2C1_2_I3C1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C1_2_I3C1_2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C1_2_I3C1_2 final divider channel
  * @rmtoll FINDIV12CFGR         FINDIV12EN         LL_RCC_DisableI2C1_2_I3C1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C1_2_I3C1_2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[12], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#else

/**
  * @brief  Get I2C1_2 channel pre divided Value
  * @rmtoll PREDIV13CFGR      PREDIV13      LL_RCC_GetI2C1_2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C1_2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[13], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C1_2 channel pre divided Value
  * @rmtoll PREDIV13CFGR         PREDIV13        LL_RCC_SetI2C1_2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C1_2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[13], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C1_2 channel pre divided Value
  * @rmtoll FINDIV13CFGR      FINDIV13      LL_RCC_GetI2C1_2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C1_2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C1_2 channel pre divided Value
  * @rmtoll FINDIV13CFGR         FINDIV13        LL_RCC_SetI2C1_2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C1_2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C1_2 final divider channel
  * @rmtoll FINDIV13CFGR         FINDIV13EN         LL_RCC_EnableI2C1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C1_2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C1_2 final divider channel
  * @rmtoll FINDIV13CFGR         FINDIV13EN         LL_RCC_DisableI2C1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C1_2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get I3C1_2 channel pre divided Value
  * @rmtoll PREDIV14CFGR      PREDIV14      LL_RCC_GetI3C1_2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C1_2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[14], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I3C1_2 channel pre divided Value
  * @rmtoll PREDIV14CFGR         PREDIV14        LL_RCC_SetI3C1_2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C1_2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[14], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I3C1_2 channel pre divided Value
  * @rmtoll FINDIV14CFGR      FINDIV14      LL_RCC_GetI3C1_2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C1_2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I3C1_2 channel pre divided Value
  * @rmtoll FINDIV14CFGR         FINDIV14        LL_RCC_SetI3C1_2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C1_2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I3C1_2 final divider channel
  * @rmtoll FINDIV14CFGR         FINDIV14EN         LL_RCC_EnableI3C1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI3C1_2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I3C1_2 final divider channel
  * @rmtoll FINDIV14CFGR         FINDIV14EN         LL_RCC_DisableI3C1_2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI3C1_2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

