zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I2C3_5_I3C3 channel pre divided Value
  * @rmtoll PREDIV13CFGR      PREDIV13      LL_RCC_GetI2C3_5_I3C3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C3_5_I3C3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[13], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C3_5_I3C3 channel pre divided Value
  * @rmtoll PREDIV13CFGR         PREDIV13        LL_RCC_SetI2C3_5_I3C3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C3_5_I3C3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[13], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C3_5_I3C3 channel pre divided Value
  * @rmtoll FINDIV13CFGR      FINDIV13      LL_RCC_GetI2C3_5_I3C3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C3_5_I3C3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C3_5_I3C3 channel pre divided Value
  * @rmtoll FINDIV13CFGR         FINDIV13        LL_RCC_SetI2C3_5_I3C3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C3_5_I3C3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C3_5_I3C3 final divider channel
  * @rmtoll FINDIV13CFGR         FINDIV13EN         LL_RCC_EnableI2C3_5_I3C3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C3_5_I3C3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C3_5_I3C3 final divider channel
  * @rmtoll FINDIV13CFGR         FINDIV13EN         LL_RCC_DisableI2C3_5_I3C3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C3_5_I3C3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[13], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#else

/**
  * @brief  Get I2C3 channel pre divided Value
  * @rmtoll PREDIV38CFGR      PREDIV38      LL_RCC_GetI2C3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[38], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C3 channel pre divided Value
  * @rmtoll PREDIV38CFGR         PREDIV38        LL_RCC_SetI2C3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[38], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C3 channel pre divided Value
  * @rmtoll FINDIV38CFGR      FINDIV38      LL_RCC_GetI2C3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C3 channel pre divided Value
  * @rmtoll FINDIV38CFGR         FINDIV38        LL_RCC_SetI2C3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C3 final divider channel
  * @rmtoll FINDIV38CFGR         FINDIV38EN         LL_RCC_EnableI2C3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C3 final divider channel
  * @rmtoll FINDIV38CFGR         FINDIV38EN         LL_RCC_DisableI2C3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get I3C3 channel pre divided Value
  * @rmtoll PREDIV36CFGR      PREDIV36      LL_RCC_GetI3C3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[36], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I3C3 channel pre divided Value
  * @rmtoll PREDIV36CFGR         PREDIV36        LL_RCC_SetI3C3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[36], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I3C3 channel pre divided Value
  * @rmtoll FINDIV36CFGR      FINDIV36      LL_RCC_GetI3C3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I3C3 channel pre divided Value
  * @rmtoll FINDIV36CFGR         FINDIV36        LL_RCC_SetI3C3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I3C3 final divider channel
  * @rmtoll FINDIV36CFGR         FINDIV36EN         LL_RCC_EnableI3C3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI3C3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I3C3 final divider channel
  * @rmtoll FINDIV36CFGR         FINDIV36EN         LL_RCC_DisableI3C3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI3C3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
#endif /* RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING */


#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING) && !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)

/**
  * @brief  Get I2C4_6 channel pre divided Value
  * @rmtoll PREDIV14CFGR      PREDIV14      LL_RCC_GetI2C4_6_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C4_6_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[14], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C4_6 channel pre divided Value
  * @rmtoll PREDIV14CFGR         PREDIV14        LL_RCC_SetI2C4_6_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C4_6_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[14], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C4_6 channel pre divided Value
  * @rmtoll FINDIV14CFGR      FINDIV14      LL_RCC_GetI2C4_6_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C4_6_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C4_6 channel pre divided Value
  * @rmtoll FINDIV14CFGR         FINDIV14        LL_RCC_SetI2C4_6_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C4_6_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C4_6 final divider channel
  * @rmtoll FINDIV14CFGR         FINDIV14EN         LL_RCC_EnableI2C4_6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C4_6_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C4_6 final divider channel
  * @rmtoll FINDIV14CFGR         FINDIV14EN         LL_RCC_DisableI2C4_6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C4_6_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[14], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get I2C7 channel pre divided Value
  * @rmtoll PREDIV15CFGR      PREDIV15      LL_RCC_GetI2C7_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C7_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[15], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C7 channel pre divided Value
  * @rmtoll PREDIV15CFGR         PREDIV15        LL_RCC_SetI2C7_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C7_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[15], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C7 channel pre divided Value
  * @rmtoll FINDIV15CFGR      FINDIV15      LL_RCC_GetI2C7_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C7_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[15], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C7 channel pre divided Value
  * @rmtoll FINDIV15CFGR         FINDIV15        LL_RCC_SetI2C7_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C7_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[15], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C7 final divider channel
  * @rmtoll FINDIV15CFGR         FINDIV15EN         LL_RCC_EnableI2C7_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C7_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[15], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C7 final divider channel
  * @rmtoll FINDIV15CFGR         FINDIV15EN         LL_RCC_DisableI2C7_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C7_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[15], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get SPI1 channel pre divided Value
  * @rmtoll PREDIV16CFGR      PREDIV16      LL_RCC_GetSPI1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[16], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI1 channel pre divided Value
  * @rmtoll PREDIV16CFGR         PREDIV16        LL_RCC_SetSPI1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[16], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI1 channel pre divided Value
  * @rmtoll FINDIV16CFGR      FINDIV16      LL_RCC_GetSPI1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[16], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI1 channel pre divided Value
  * @rmtoll FINDIV16CFGR         FINDIV16        LL_RCC_SetSPI1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[16], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI1 final divider channel
  * @rmtoll FINDIV16CFGR         FINDIV16EN         LL_RCC_EnableSPI1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[16], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI1 final divider channel
  * @rmtoll FINDIV16CFGR         FINDIV16EN         LL_RCC_DisableSPI1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[16], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SPI4_5 channel pre divided Value
  * @rmtoll PREDIV17CFGR      PREDIV17      LL_RCC_GetSPI4_5_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI4_5_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[17], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI4_5 channel pre divided Value
  * @rmtoll PREDIV17CFGR         PREDIV17        LL_RCC_SetSPI4_5_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI4_5_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[17], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI4_5 channel pre divided Value
  * @rmtoll FINDIV17CFGR      FINDIV17      LL_RCC_GetSPI4_5_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI4_5_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[17], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI4_5 channel pre divided Value
  * @rmtoll FINDIV17CFGR         FINDIV17        LL_RCC_SetSPI4_5_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI4_5_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[17], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI4_5 final divider channel
  * @rmtoll FINDIV17CFGR         FINDIV17EN         LL_RCC_EnableSPI4_5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI4_5_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[17], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI4_5 final divider channel
  * @rmtoll FINDIV17CFGR         FINDIV17EN         LL_RCC_DisableSPI4_5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI4_5_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[17], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

