zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)

/**
  * @brief  Get SPI6_7 channel pre divided Value
  * @rmtoll PREDIV18CFGR      PREDIV18      LL_RCC_GetSPI6_7_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI6_7_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[18], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI6_7 channel pre divided Value
  * @rmtoll PREDIV18CFGR         PREDIV18        LL_RCC_SetSPI6_7_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI6_7_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[18], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI6_7 channel pre divided Value
  * @rmtoll FINDIV18CFGR      FINDIV18      LL_RCC_GetSPI6_7_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI6_7_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI6_7 channel pre divided Value
  * @rmtoll FINDIV18CFGR         FINDIV18        LL_RCC_SetSPI6_7_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI6_7_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI6_7 final divider channel
  * @rmtoll FINDIV18CFGR         FINDIV18EN         LL_RCC_EnableSPI6_7_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI6_7_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI6_7 final divider channel
  * @rmtoll FINDIV18CFGR         FINDIV18EN         LL_RCC_DisableSPI6_7_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI6_7_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get SPI6 channel pre divided Value
  * @rmtoll PREDIV37CFGR      PREDIV37      LL_RCC_GetSPI6_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI6_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[37], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI6 channel pre divided Value
  * @rmtoll PREDIV37CFGR         PREDIV37        LL_RCC_SetSPI6_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI6_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[37], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI6 channel pre divided Value
  * @rmtoll FINDIV37CFGR      FINDIV37      LL_RCC_GetSPI6_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI6_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI6 channel pre divided Value
  * @rmtoll FINDIV37CFGR         FINDIV37        LL_RCC_SetSPI6_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI6_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI6 final divider channel
  * @rmtoll FINDIV37CFGR         FINDIV37EN         LL_RCC_EnableSPI6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI6_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI6 final divider channel
  * @rmtoll FINDIV37CFGR         FINDIV37EN         LL_RCC_DisableSPI6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI6_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
#endif /* RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART1 channel pre divided Value
  * @rmtoll PREDIV19CFGR      PREDIV19      LL_RCC_GetUSART1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[19], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART1 channel pre divided Value
  * @rmtoll PREDIV19CFGR         PREDIV19        LL_RCC_SetUSART1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[19], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART1 channel pre divided Value
  * @rmtoll FINDIV19CFGR      FINDIV19      LL_RCC_GetUSART1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART1 channel pre divided Value
  * @rmtoll FINDIV19CFGR         FINDIV19        LL_RCC_SetUSART1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART1 final divider channel
  * @rmtoll FINDIV19CFGR         FINDIV19EN         LL_RCC_EnableUSART1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART1 final divider channel
  * @rmtoll FINDIV19CFGR         FINDIV19EN         LL_RCC_DisableUSART1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get USART1 channel pre divided Value
  * @rmtoll PREDIV18CFGR      PREDIV18      LL_RCC_GetUSART1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[18], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART1 channel pre divided Value
  * @rmtoll PREDIV18CFGR         PREDIV18        LL_RCC_SetUSART1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[18], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART1 channel pre divided Value
  * @rmtoll FINDIV18CFGR      FINDIV18      LL_RCC_GetUSART1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART1 channel pre divided Value
  * @rmtoll FINDIV18CFGR         FINDIV18        LL_RCC_SetUSART1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART1 final divider channel
  * @rmtoll FINDIV18CFGR         FINDIV18EN         LL_RCC_EnableUSART1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART1 final divider channel
  * @rmtoll FINDIV18CFGR         FINDIV18EN         LL_RCC_DisableUSART1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[18], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get UART2_4 channel pre divided Value
  * @rmtoll PREDIV8CFGR      PREDIV8      LL_RCC_GetUART2_4_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART2_4_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[8], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Get UART2_4 channel fin divided Value
  * @rmtoll FINDIV8CFGR      FINDIV8      LL_RCC_GetUART2_2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUART2_4_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[8], RCC_FINDIVxCFGR_FINDIVx_Msk));
}
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART6 channel pre divided Value
  * @rmtoll PREDIV20CFGR      PREDIV20      LL_RCC_GetUSART6_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART6_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[20], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART6 channel pre divided Value
  * @rmtoll PREDIV20CFGR         PREDIV20        LL_RCC_SetUSART6_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART6_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[20], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART6 channel pre divided Value
  * @rmtoll FINDIV20CFGR      FINDIV20      LL_RCC_GetUSART6_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART6_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART6 channel pre divided Value
  * @rmtoll FINDIV20CFGR         FINDIV20        LL_RCC_SetUSART6_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART6_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART6 final divider channel
  * @rmtoll FINDIV20CFGR         FINDIV20EN         LL_RCC_EnableUSART6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART6_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART6 final divider channel
  * @rmtoll FINDIV20CFGR         FINDIV20EN         LL_RCC_DisableUSART6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART6_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get USART6 channel pre divided Value
  * @rmtoll PREDIV19CFGR      PREDIV19      LL_RCC_GetUSART6_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART6_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[19], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART6 channel pre divided Value
  * @rmtoll PREDIV19CFGR         PREDIV19        LL_RCC_SetUSART6_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART6_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[19], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART6 channel pre divided Value
  * @rmtoll FINDIV19CFGR      FINDIV19      LL_RCC_GetUSART6_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART6_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART6 channel pre divided Value
  * @rmtoll FINDIV19CFGR         FINDIV19        LL_RCC_SetUSART6_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART6_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART6 final divider channel
  * @rmtoll FINDIV19CFGR         FINDIV19EN         LL_RCC_EnableUSART6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART6_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART6 final divider channel
  * @rmtoll FINDIV19CFGR         FINDIV19EN         LL_RCC_DisableUSART6_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART6_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[19], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

