zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART7_8 channel pre divided Value
  * @rmtoll PREDIV21CFGR      PREDIV21      LL_RCC_GetUSART7_8_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART7_8_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[21], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART7_8 channel pre divided Value
  * @rmtoll PREDIV21CFGR         PREDIV21        LL_RCC_SetUSART7_8_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART7_8_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[21], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART7_8 channel pre divided Value
  * @rmtoll FINDIV21CFGR      FINDIV21      LL_RCC_GetUSART7_8_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART7_8_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART7_8 channel pre divided Value
  * @rmtoll FINDIV21CFGR         FINDIV21        LL_RCC_SetUSART7_8_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART7_8_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART7_8 final divider channel
  * @rmtoll FINDIV21CFGR         FINDIV21EN         LL_RCC_EnableUSART7_8_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART7_8_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART7_8 final divider channel
  * @rmtoll FINDIV21CFGR         FINDIV21EN         LL_RCC_DisableUSART7_8_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART7_8_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#else

/**
  * @brief  Get USART7 channel pre divided Value
  * @rmtoll PREDIV20CFGR      PREDIV20      LL_RCC_GetUSART7_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART7_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[20], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART7 channel pre divided Value
  * @rmtoll PREDIV20CFGR         PREDIV20        LL_RCC_SetUSART7_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART7_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[20], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART7 channel pre divided Value
  * @rmtoll FINDIV20CFGR      FINDIV20      LL_RCC_GetUSART7_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART7_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART7 channel pre divided Value
  * @rmtoll FINDIV20CFGR         FINDIV20        LL_RCC_SetUSART7_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART7_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART7 final divider channel
  * @rmtoll FINDIV20CFGR         FINDIV20EN         LL_RCC_EnableUSART7_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART7_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART7 final divider channel
  * @rmtoll FINDIV20CFGR         FINDIV20EN         LL_RCC_DisableUSART7_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART7_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[20], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING) && !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USART9 channel pre divided Value
  * @rmtoll PREDIV22CFGR      PREDIV22      LL_RCC_GetUSART9_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART9_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[22], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USART9 channel pre divided Value
  * @rmtoll PREDIV22CFGR         PREDIV22        LL_RCC_SetUSART9_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART9_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[22], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USART9 channel pre divided Value
  * @rmtoll FINDIV22CFGR      FINDIV22      LL_RCC_GetUSART9_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSART9_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USART9 channel pre divided Value
  * @rmtoll FINDIV22CFGR         FINDIV22        LL_RCC_SetUSART9_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSART9_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USART9 final divider channel
  * @rmtoll FINDIV22CFGR         FINDIV22EN         LL_RCC_EnableUSART9_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSART9_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USART9 final divider channel
  * @rmtoll FINDIV22CFGR         FINDIV22EN         LL_RCC_DisableUSART9_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSART9_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */


