zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SAI1_MDF1 channel pre divided Value
  * @rmtoll PREDIV23CFGR      PREDIV23      LL_RCC_GetSAI1_MDF1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI1_MDF1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[23], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI1_MDF1 channel pre divided Value
  * @rmtoll PREDIV23CFGR         PREDIV23        LL_RCC_SetSAI1_MDF1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI1_MDF1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[23], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI1_MDF1 channel pre divided Value
  * @rmtoll FINDIV23CFGR      FINDIV23      LL_RCC_GetSAI1_MDF1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI1_MDF1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI1_MDF1 channel pre divided Value
  * @rmtoll FINDIV23CFGR         FINDIV23        LL_RCC_SetSAI1_MDF1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI1_MDF1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI1_MDF1 final divider channel
  * @rmtoll FINDIV23CFGR         FINDIV23EN         LL_RCC_EnableSAI1_MDF1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI1_MDF1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI1_MDF1 final divider channel
  * @rmtoll FINDIV23CFGR         FINDIV23EN         LL_RCC_DisableSAI1_MDF1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI1_MDF1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#else

/**
  * @brief  Get MDF1 channel pre divided Value
  * @rmtoll PREDIV21CFGR      PREDIV21      LL_RCC_GetMDF1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetMDF1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[21], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set MDF1 channel pre divided Value
  * @rmtoll PREDIV21CFGR         PREDIV21        LL_RCC_SetMDF1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMDF1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[21], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get MDF1 channel pre divided Value
  * @rmtoll FINDIV21CFGR      FINDIV21      LL_RCC_GetMDF1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetMDF1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set MDF1 channel pre divided Value
  * @rmtoll FINDIV21CFGR         FINDIV21        LL_RCC_SetMDF1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMDF1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable MDF1 final divider channel
  * @rmtoll FINDIV21CFGR         FINDIV21EN         LL_RCC_EnableMDF1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableMDF1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable MDF1 final divider channel
  * @rmtoll FINDIV21CFGR         FINDIV21EN         LL_RCC_DisableMDF1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableMDF1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[21], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SAI1 channel pre divided Value
  * @rmtoll PREDIV22CFGR      PREDIV22      LL_RCC_GetSAI1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[22], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI1 channel pre divided Value
  * @rmtoll PREDIV22CFGR         PREDIV22        LL_RCC_SetSAI1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[22], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI1 channel pre divided Value
  * @rmtoll FINDIV22CFGR      FINDIV22      LL_RCC_GetSAI1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI1 channel pre divided Value
  * @rmtoll FINDIV22CFGR         FINDIV22        LL_RCC_SetSAI1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI1 final divider channel
  * @rmtoll FINDIV22CFGR         FINDIV22EN         LL_RCC_EnableSAI1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI1 final divider channel
  * @rmtoll FINDIV22CFGR         FINDIV22EN         LL_RCC_DisableSAI1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[22], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

