zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SAI2 channel pre divided Value
  * @rmtoll PREDIV24CFGR      PREDIV24      LL_RCC_GetSAI2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[24], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI2 channel pre divided Value
  * @rmtoll PREDIV24CFGR         PREDIV24        LL_RCC_SetSAI2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[24], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI2 channel pre divided Value
  * @rmtoll FINDIV24CFGR      FINDIV24      LL_RCC_GetSAI2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI2 channel pre divided Value
  * @rmtoll FINDIV24CFGR         FINDIV24        LL_RCC_SetSAI2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI2 final divider channel
  * @rmtoll FINDIV24CFGR         FINDIV24EN         LL_RCC_EnableSAI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI2 final divider channel
  * @rmtoll FINDIV24CFGR         FINDIV24EN         LL_RCC_DisableSAI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get SAI2 channel pre divided Value
  * @rmtoll PREDIV23CFGR      PREDIV23      LL_RCC_GetSAI2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[23], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI2 channel pre divided Value
  * @rmtoll PREDIV23CFGR         PREDIV23        LL_RCC_SetSAI2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[23], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI2 channel pre divided Value
  * @rmtoll FINDIV23CFGR      FINDIV23      LL_RCC_GetSAI2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI2 channel pre divided Value
  * @rmtoll FINDIV23CFGR         FINDIV23        LL_RCC_SetSAI2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI2 final divider channel
  * @rmtoll FINDIV23CFGR         FINDIV23EN         LL_RCC_EnableSAI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI2 final divider channel
  * @rmtoll FINDIV23CFGR         FINDIV23EN         LL_RCC_DisableSAI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[23], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SAI3_4 channel pre divided Value
  * @rmtoll PREDIV25CFGR      PREDIV25      LL_RCC_GetSAI3_4_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI3_4_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[25], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI3_4 channel pre divided Value
  * @rmtoll PREDIV25CFGR         PREDIV25        LL_RCC_SetSAI3_4_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI3_4_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[25], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI3_4 channel pre divided Value
  * @rmtoll FINDIV25CFGR      FINDIV25      LL_RCC_GetSAI3_4_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI3_4_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI3_4 channel pre divided Value
  * @rmtoll FINDIV25CFGR         FINDIV25        LL_RCC_SetSAI3_4_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI3_4_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI3_4 final divider channel
  * @rmtoll FINDIV25CFGR         FINDIV25EN         LL_RCC_EnableSAI3_4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI3_4_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI3_4 final divider channel
  * @rmtoll FINDIV25CFGR         FINDIV25EN         LL_RCC_DisableSAI3_4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI3_4_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#else
/**
  * @brief  Get SAI3 channel pre divided Value
  * @rmtoll PREDIV24CFGR      PREDIV24      LL_RCC_GetSAI3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[24], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI3 channel pre divided Value
  * @rmtoll PREDIV24CFGR         PREDIV24        LL_RCC_SetSAI3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[24], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI3 channel pre divided Value
  * @rmtoll FINDIV24CFGR      FINDIV24      LL_RCC_GetSAI3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI3 channel pre divided Value
  * @rmtoll FINDIV24CFGR         FINDIV24        LL_RCC_SetSAI3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI3 final divider channel
  * @rmtoll FINDIV24CFGR         FINDIV24EN         LL_RCC_EnableSAI3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI3 final divider channel
  * @rmtoll FINDIV24CFGR         FINDIV24EN         LL_RCC_DisableSAI3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[24], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SAI4 channel pre divided Value
  * @rmtoll PREDIV25CFGR      PREDIV25      LL_RCC_GetSAI4_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI4_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[25], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SAI4 channel pre divided Value
  * @rmtoll PREDIV25CFGR         PREDIV25        LL_RCC_SetSAI4_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI4_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[25], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SAI4 channel pre divided Value
  * @rmtoll FINDIV25CFGR      FINDIV25      LL_RCC_GetSAI4_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAI4_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SAI4 channel pre divided Value
  * @rmtoll FINDIV25CFGR         FINDIV25        LL_RCC_SetSAI4_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAI4_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SAI4 final divider channel
  * @rmtoll FINDIV25CFGR         FINDIV25EN         LL_RCC_EnableSAI4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSAI4_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SAI4 final divider channel
  * @rmtoll FINDIV25CFGR         FINDIV25EN         LL_RCC_DisableSAI4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSAI4_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[25], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

/**
  * @brief  Get FDCAN channel pre divided Value
  * @rmtoll PREDIV26CFGR      PREDIV26      LL_RCC_GetFDCAN_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCAN_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[26], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set FDCAN channel pre divided Value
  * @rmtoll PREDIV26CFGR         PREDIV26        LL_RCC_SetFDCAN_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFDCAN_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[26], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get FDCAN channel pre divided Value
  * @rmtoll FINDIV26CFGR      FINDIV26      LL_RCC_GetFDCAN_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCAN_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[26], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set FDCAN channel pre divided Value
  * @rmtoll FINDIV26CFGR         FINDIV26        LL_RCC_SetFDCAN_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFDCAN_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[26], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable FDCAN final divider channel
  * @rmtoll FINDIV26CFGR         FINDIV26EN         LL_RCC_EnableFDCAN_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableFDCAN_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[26], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable FDCAN final divider channel
  * @rmtoll FINDIV26CFGR         FINDIV26EN         LL_RCC_DisableFDCAN_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableFDCAN_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[26], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get DSIBLANE channel pre divided Value
  * @rmtoll PREDIV27CFGR      PREDIV27      LL_RCC_GetDSIBLANE_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetDSIBLANE_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[27], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set DSIBLANE channel pre divided Value
  * @rmtoll PREDIV27CFGR         PREDIV27        LL_RCC_SetDSIBLANE_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDSIBLANE_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[27], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get DSIBLANE channel pre divided Value
  * @rmtoll FINDIV27CFGR      FINDIV27      LL_RCC_GetDSIBLANE_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetDSIBLANE_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[27], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set DSIBLANE channel pre divided Value
  * @rmtoll FINDIV27CFGR         FINDIV27        LL_RCC_SetDSIBLANE_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDSIBLANE_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[27], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable DSIBLANE final divider channel
  * @rmtoll FINDIV27CFGR         FINDIV27EN         LL_RCC_EnableDSIBLANE_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableDSIBLANE_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[27], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable DSIBLANE final divider channel
  * @rmtoll FINDIV27CFGR         FINDIV27EN         LL_RCC_DisableDSIBLANE_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableDSIBLANE_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[27], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get DSIPHY channel pre divided Value
  * @rmtoll PREDIV28CFGR      PREDIV28      LL_RCC_GetDSIPHY_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetDSIPHY_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[28], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set DSIPHY channel pre divided Value
  * @rmtoll PREDIV28CFGR         PREDIV28        LL_RCC_SetDSIPHY_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDSIPHY_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[28], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get DSIPHY channel pre divided Value
  * @rmtoll FINDIV28CFGR      FINDIV28      LL_RCC_GetDSIPHY_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetDSIPHY_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[28], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set DSIPHY channel pre divided Value
  * @rmtoll FINDIV28CFGR         FINDIV28        LL_RCC_SetDSIPHY_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDSIPHY_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[28], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable DSIPHY final divider channel
  * @rmtoll FINDIV28CFGR         FINDIV28EN         LL_RCC_EnableDSIPHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableDSIPHY_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[28], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable DSIPHY final divider channel
  * @rmtoll FINDIV28CFGR         FINDIV28EN         LL_RCC_DisableDSIPHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableDSIPHY_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[28], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get CSI2 channel pre divided Value
  * @rmtoll PREDIV29CFGR      PREDIV29      LL_RCC_GetCSI2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[29], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set CSI2 channel pre divided Value
  * @rmtoll PREDIV29CFGR         PREDIV29        LL_RCC_SetCSI2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[29], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get CSI2 channel pre divided Value
  * @rmtoll FINDIV29CFGR      FINDIV29      LL_RCC_GetCSI2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[29], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set CSI2 channel pre divided Value
  * @rmtoll FINDIV29CFGR         FINDIV29        LL_RCC_SetCSI2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[29], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable CSI2 final divider channel
  * @rmtoll FINDIV29CFGR         FINDIV29EN         LL_RCC_EnableCSI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCSI2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[29], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable CSI2 final divider channel
  * @rmtoll FINDIV29CFGR         FINDIV29EN         LL_RCC_DisableCSI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCSI2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[29], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get CSI2TXESC channel pre divided Value
  * @rmtoll PREDIV30CFGR      PREDIV30      LL_RCC_GetCSI2TXESC_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2TXESC_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[30], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set CSI2TXESC channel pre divided Value
  * @rmtoll PREDIV30CFGR         PREDIV30        LL_RCC_SetCSI2TXESC_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2TXESC_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[30], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get CSI2TXESC channel pre divided Value
  * @rmtoll FINDIV30CFGR      FINDIV30      LL_RCC_GetCSI2TXESC_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2TXESC_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[30], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set CSI2TXESC channel pre divided Value
  * @rmtoll FINDIV30CFGR         FINDIV30        LL_RCC_SetCSI2TXESC_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2TXESC_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[30], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable CSI2TXESC final divider channel
  * @rmtoll FINDIV30CFGR         FINDIV30EN         LL_RCC_EnableCSI2TXESC_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCSI2TXESC_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[30], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable CSI2TXESC final divider channel
  * @rmtoll FINDIV30CFGR         FINDIV30EN         LL_RCC_DisableCSI2TXESC_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCSI2TXESC_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[30], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get CSI2PHY channel pre divided Value
  * @rmtoll PREDIV31CFGR      PREDIV31      LL_RCC_GetCSI2PHY_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2PHY_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[31], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

