zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Set CSI2PHY channel pre divided Value
  * @rmtoll PREDIV31CFGR         PREDIV31        LL_RCC_SetCSI2PHY_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2PHY_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[31], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get CSI2PHY channel pre divided Value
  * @rmtoll FINDIV31CFGR      FINDIV31      LL_RCC_GetCSI2PHY_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetCSI2PHY_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[31], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set CSI2PHY channel pre divided Value
  * @rmtoll FINDIV31CFGR         FINDIV31        LL_RCC_SetCSI2PHY_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCSI2PHY_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[31], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable CSI2PHY final divider channel
  * @rmtoll FINDIV31CFGR         FINDIV31EN         LL_RCC_EnableCSI2PHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCSI2PHY_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[31], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable CSI2PHY final divider channel
  * @rmtoll FINDIV31CFGR         FINDIV31EN         LL_RCC_DisableCSI2PHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCSI2PHY_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[31], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get LVDPHY channel pre divided Value
  * @rmtoll PREDIV32CFGR      PREDIV32      LL_RCC_GetLVDPHY_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLVDPHY_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[32], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LVDPHY channel pre divided Value
  * @rmtoll PREDIV32CFGR         PREDIV32        LL_RCC_SetLVDPHY_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLVDPHY_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[32], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LVDPHY channel pre divided Value
  * @rmtoll FINDIV32CFGR      FINDIV32      LL_RCC_GetLVDPHY_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLVDPHY_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[32], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LVDPHY channel pre divided Value
  * @rmtoll FINDIV32CFGR         FINDIV32        LL_RCC_SetLVDPHY_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLVDPHY_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[32], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LVDPHY final divider channel
  * @rmtoll FINDIV32CFGR         FINDIV32EN         LL_RCC_EnableLVDPHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLVDPHY_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[32], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable LVDPHY final divider channel
  * @rmtoll FINDIV32CFGR         FINDIV32EN         LL_RCC_DisableLVDPHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLVDPHY_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[32], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get STGEN channel pre divided Value
  * @rmtoll PREDIV33CFGR      PREDIV33      LL_RCC_GetSTGEN_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSTGEN_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[33], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set STGEN channel pre divided Value
  * @rmtoll PREDIV33CFGR         PREDIV33        LL_RCC_SetSTGEN_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSTGEN_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[33], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get STGEN channel pre divided Value
  * @rmtoll FINDIV33CFGR      FINDIV33      LL_RCC_GetSTGEN_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSTGEN_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[33], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set STGEN channel pre divided Value
  * @rmtoll FINDIV33CFGR         FINDIV33        LL_RCC_SetSTGEN_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSTGEN_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[33], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable STGEN final divider channel
  * @rmtoll FINDIV33CFGR         FINDIV33EN         LL_RCC_EnableSTGEN_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSTGEN_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[33], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable STGEN final divider channel
  * @rmtoll FINDIV33CFGR         FINDIV33EN         LL_RCC_DisableSTGEN_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSTGEN_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[33], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

