zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get USB3PCIEPHY channel pre divided Value
  * @rmtoll PREDIV34CFGR      PREDIV34      LL_RCC_GetUSB3PCIEPHY_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB3PCIEPHY_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[34], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USB3PCIEPHY channel pre divided Value
  * @rmtoll PREDIV34CFGR         PREDIV34        LL_RCC_SetUSB3PCIEPHY_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB3PCIEPHY_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[34], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USB3PCIEPHY channel pre divided Value
  * @rmtoll FINDIV34CFGR      FINDIV34      LL_RCC_GetUSB3PCIEPHY_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB3PCIEPHY_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[34], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USB3PCIEPHY channel pre divided Value
  * @rmtoll FINDIV34CFGR         FINDIV34        LL_RCC_SetUSB3PCIEPHY_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB3PCIEPHY_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[34], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USB3PCIEPHY final divider channel
  * @rmtoll FINDIV34CFGR         FINDIV34EN         LL_RCC_EnableUSB3PCIEPHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSB3PCIEPHY_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[34], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USB3PCIEPHY final divider channel
  * @rmtoll FINDIV34CFGR         FINDIV34EN         LL_RCC_DisableUSB3PCIEPHY_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSB3PCIEPHY_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[34], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
/**
  * @brief  Get UCPD1 channel pre divided Value
  * @rmtoll PREDIV35CFGR      PREDIV35      LL_RCC_GetUCPD1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUCPD1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[35], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set UCPD1 channel pre divided Value
  * @rmtoll PREDIV35CFGR         PREDIV35        LL_RCC_SetUCPD1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUCPD1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[35], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get UCPD1 channel pre divided Value
  * @rmtoll FINDIV35CFGR      FINDIV35      LL_RCC_GetUCPD1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUCPD1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[35], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set UCPD1 channel pre divided Value
  * @rmtoll FINDIV35CFGR         FINDIV35        LL_RCC_SetUCPD1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUCPD1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[35], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable UCPD1 final divider channel
  * @rmtoll FINDIV35CFGR         FINDIV35EN         LL_RCC_EnableUCPD1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUCPD1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[35], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable UCPD1 final divider channel
  * @rmtoll FINDIV35CFGR         FINDIV35EN         LL_RCC_DisableUCPD1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUCPD1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[35], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I3C4 channel pre divided Value
  * @rmtoll PREDIV36CFGR      PREDIV36      LL_RCC_GetI3C4_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C4_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[36], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I3C4 channel pre divided Value
  * @rmtoll PREDIV36CFGR         PREDIV36        LL_RCC_SetI3C4_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C4_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[36], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I3C4 channel pre divided Value
  * @rmtoll FINDIV36CFGR      FINDIV36      LL_RCC_GetI3C4_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3C4_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I3C4 channel pre divided Value
  * @rmtoll FINDIV36CFGR         FINDIV36        LL_RCC_SetI3C4_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI3C4_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I3C4 final divider channel
  * @rmtoll FINDIV36CFGR         FINDIV36EN         LL_RCC_EnableI3C4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI3C4_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I3C4 final divider channel
  * @rmtoll FINDIV36CFGR         FINDIV36EN         LL_RCC_DisableI3C4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI3C4_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[36], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

