zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get SPI8 channel pre divided Value
  * @rmtoll PREDIV37CFGR      PREDIV37      LL_RCC_GetSPI8_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI8_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[37], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SPI8 channel pre divided Value
  * @rmtoll PREDIV37CFGR         PREDIV37        LL_RCC_SetSPI8_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI8_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[37], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SPI8 channel pre divided Value
  * @rmtoll FINDIV37CFGR      FINDIV37      LL_RCC_GetSPI8_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI8_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SPI8 channel pre divided Value
  * @rmtoll FINDIV37CFGR         FINDIV37        LL_RCC_SetSPI8_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI8_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SPI8 final divider channel
  * @rmtoll FINDIV37CFGR         FINDIV37EN         LL_RCC_EnableSPI8_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSPI8_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SPI8 final divider channel
  * @rmtoll FINDIV37CFGR         FINDIV37EN         LL_RCC_DisableSPI8_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSPI8_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[37], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get I2C8 channel pre divided Value
  * @rmtoll PREDIV38CFGR      PREDIV38      LL_RCC_GetI2C8_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C8_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[38], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set I2C8 channel pre divided Value
  * @rmtoll PREDIV38CFGR         PREDIV38        LL_RCC_SetI2C8_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C8_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[38], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get I2C8 channel pre divided Value
  * @rmtoll FINDIV38CFGR      FINDIV38      LL_RCC_GetI2C8_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2C8_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set I2C8 channel pre divided Value
  * @rmtoll FINDIV38CFGR         FINDIV38        LL_RCC_SetI2C8_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2C8_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable I2C8 final divider channel
  * @rmtoll FINDIV38CFGR         FINDIV38EN         LL_RCC_EnableI2C8_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableI2C8_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable I2C8 final divider channel
  * @rmtoll FINDIV38CFGR         FINDIV38EN         LL_RCC_DisableI2C8_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableI2C8_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[38], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */


/**
  * @brief  Get LPUART1 channel pre divided Value
  * @rmtoll PREDIV39CFGR      PREDIV39      LL_RCC_GetLPUART1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUART1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[39], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LPUART1 channel pre divided Value
  * @rmtoll PREDIV39CFGR         PREDIV39        LL_RCC_SetLPUART1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPUART1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[39], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LPUART1 channel pre divided Value
  * @rmtoll FINDIV39CFGR      FINDIV39      LL_RCC_GetLPUART1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUART1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[39], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LPUART1 channel pre divided Value
  * @rmtoll FINDIV39CFGR         FINDIV39        LL_RCC_SetLPUART1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPUART1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[39], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LPUART1 final divider channel
  * @rmtoll FINDIV39CFGR         FINDIV39EN         LL_RCC_EnableLPUART1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPUART1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[39], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable LPUART1 final divider channel
  * @rmtoll FINDIV39CFGR         FINDIV39EN         LL_RCC_DisableLPUART1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPUART1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[39], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get LPTIM3 channel pre divided Value
  * @rmtoll PREDIV40CFGR      PREDIV40      LL_RCC_GetLPTIM3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[40], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LPTIM3 channel pre divided Value
  * @rmtoll PREDIV40CFGR         PREDIV40        LL_RCC_SetLPTIM3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[40], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LPTIM3 channel pre divided Value
  * @rmtoll FINDIV40CFGR      FINDIV40      LL_RCC_GetLPTIM3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[40], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LPTIM3 channel pre divided Value
  * @rmtoll FINDIV40CFGR         FINDIV40        LL_RCC_SetLPTIM3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[40], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LPTIM3 final divider channel
  * @rmtoll FINDIV40CFGR         FINDIV40EN         LL_RCC_EnableLPTIM3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[40], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable LPTIM3 final divider channel
  * @rmtoll FINDIV40CFGR         FINDIV40EN         LL_RCC_DisableLPTIM3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[40], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

