zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)

/**
  * @brief  Get LPTIM4_5 channel pre divided Value
  * @rmtoll PREDIV40CFGR      PREDIV40      LL_RCC_GetLPTIM4_5_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM4_5_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[41], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LPTIM4_5 channel pre divided Value
  * @rmtoll PREDIV40CFGR         PREDIV40        LL_RCC_SetLPTIM4_5_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM4_5_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[41], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LPTIM4_5 channel pre divided Value
  * @rmtoll FINDIV40CFGR      FINDIV40      LL_RCC_GetLPTIM4_5_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM4_5_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LPTIM4_5 channel pre divided Value
  * @rmtoll FINDIV40CFGR         FINDIV40        LL_RCC_SetLPTIM4_5_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM4_5_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LPTIM4_5 final divider channel
  * @rmtoll FINDIV40CFGR         FINDIV40EN         LL_RCC_EnableLPTIM4_5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM4_5_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable LPTIM4_5 final divider channel
  * @rmtoll FINDIV40CFGR         FINDIV40EN         LL_RCC_DisableLPTIM4_5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM4_5_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#else

/**
  * @brief  Get LPTIM4 channel pre divided Value
  * @rmtoll PREDIV41CFGR      PREDIV41      LL_RCC_GetLPTIM4_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM4_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[41], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LPTIM4 channel pre divided Value
  * @rmtoll PREDIV41CFGR         PREDIV41        LL_RCC_SetLPTIM4_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM4_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[41], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LPTIM4 channel pre divided Value
  * @rmtoll FINDIV41CFGR      FINDIV41      LL_RCC_GetLPTIM4_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM4_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LPTIM4 channel pre divided Value
  * @rmtoll FINDIV41CFGR         FINDIV41        LL_RCC_SetLPTIM4_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM4_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LPTIM4 final divider channel
  * @rmtoll FINDIV41CFGR         FINDIV41EN         LL_RCC_EnableLPTIM4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM4_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable LPTIM4 final divider channel
  * @rmtoll FINDIV41CFGR         FINDIV41EN         LL_RCC_DisableLPTIM4_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM4_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[41], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get LPTIM5 channel pre divided Value
  * @rmtoll PREDIV42CFGR      PREDIV42      LL_RCC_GetLPTIM5_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM5_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[42], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set LPTIM5 channel pre divided Value
  * @rmtoll PREDIV42CFGR         PREDIV42        LL_RCC_SetLPTIM5_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM5_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[42], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get LPTIM5 channel pre divided Value
  * @rmtoll FINDIV42CFGR      FINDIV42      LL_RCC_GetLPTIM5_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIM5_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set LPTIM5 channel pre divided Value
  * @rmtoll FINDIV42CFGR         FINDIV42        LL_RCC_SetLPTIM5_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIM5_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable LPTIM5 final divider channel
  * @rmtoll FINDIV42CFGR         FINDIV42EN         LL_RCC_EnableLPTIM5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLPTIM5_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable LPTIM5 final divider channel
  * @rmtoll FINDIV42CFGR         FINDIV42EN         LL_RCC_DisableLPTIM5_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLPTIM5_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */

#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING) && !defined(RCC_DERIVATIVE2_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get ADF1 channel pre divided Value
  * @rmtoll PREDIV42CFGR      PREDIV42      LL_RCC_GetADF1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetADF1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[42], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ADF1 channel pre divided Value
  * @rmtoll PREDIV42CFGR         PREDIV42        LL_RCC_SetADF1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADF1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[42], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ADF1 channel pre divided Value
  * @rmtoll FINDIV42CFGR      FINDIV42      LL_RCC_GetADF1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetADF1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ADF1 channel pre divided Value
  * @rmtoll FINDIV42CFGR         FINDIV42        LL_RCC_SetADF1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADF1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ADF1 final divider channel
  * @rmtoll FINDIV42CFGR         FINDIV42EN         LL_RCC_EnableADF1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADF1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ADF1 final divider channel
  * @rmtoll FINDIV42CFGR         FINDIV42EN         LL_RCC_DisableADF1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADF1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[42], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */


/**
  * @brief  Get TSDBG channel pre divided Value
  * @rmtoll PREDIV43CFGR      PREDIV43      LL_RCC_GetTSDBG_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetTSDBG_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[43], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set TSDBG channel pre divided Value
  * @rmtoll PREDIV43CFGR         PREDIV43        LL_RCC_SetTSDBG_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTSDBG_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[43], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get TSDBG channel pre divided Value
  * @rmtoll FINDIV43CFGR      FINDIV43      LL_RCC_GetTSDBG_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetTSDBG_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[43], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set TSDBG channel pre divided Value
  * @rmtoll FINDIV43CFGR         FINDIV43        LL_RCC_SetTSDBG_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTSDBG_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[43], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable TSDBG final divider channel
  * @rmtoll FINDIV43CFGR         FINDIV43EN         LL_RCC_EnableTSDBG_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableTSDBG_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[43], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable TSDBG final divider channel
  * @rmtoll FINDIV43CFGR         FINDIV43EN         LL_RCC_DisableTSDBG_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableTSDBG_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[43], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get TPIU channel pre divided Value
  * @rmtoll PREDIV44CFGR      PREDIV44      LL_RCC_GetTPIU_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetTPIU_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[44], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set TPIU channel pre divided Value
  * @rmtoll PREDIV44CFGR         PREDIV44        LL_RCC_SetTPIU_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTPIU_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[44], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get TPIU channel pre divided Value
  * @rmtoll FINDIV44CFGR      FINDIV44      LL_RCC_GetTPIU_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetTPIU_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[44], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set TPIU channel pre divided Value
  * @rmtoll FINDIV44CFGR         FINDIV44        LL_RCC_SetTPIU_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTPIU_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[44], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable TPIU final divider channel
  * @rmtoll FINDIV44CFGR         FINDIV44EN         LL_RCC_EnableTPIU_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableTPIU_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[44], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable TPIU final divider channel
  * @rmtoll FINDIV44CFGR         FINDIV44EN         LL_RCC_DisableTPIU_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableTPIU_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[44], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ATB_METR channel pre divided Value
  * @rmtoll PREDIV45CFGR      PREDIV45      LL_RCC_GetATB_METR_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetATB_METR_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[45], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ATB_METR channel pre divided Value
  * @rmtoll PREDIV45CFGR         PREDIV45        LL_RCC_SetATB_METR_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetATB_METR_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[45], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ATB_METR channel pre divided Value
  * @rmtoll FINDIV45CFGR      FINDIV45      LL_RCC_GetATB_METR_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetATB_METR_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[45], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ATB_METR channel pre divided Value
  * @rmtoll FINDIV45CFGR         FINDIV45        LL_RCC_SetATB_METR_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetATB_METR_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[45], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ATB_METR final divider channel
  * @rmtoll FINDIV45CFGR         FINDIV45EN         LL_RCC_EnableATB_METR_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableATB_METR_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[45], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ATB_METR final divider channel
  * @rmtoll FINDIV45CFGR         FINDIV45EN         LL_RCC_DisableATB_METR_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableATB_METR_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[45], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

