zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)

/**
  * @brief  Get ADC12 channel pre divided Value
  * @rmtoll PREDIV46CFGR      PREDIV46      LL_RCC_GetADC12_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC12_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[46], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ADC12 channel pre divided Value
  * @rmtoll PREDIV46CFGR         PREDIV46        LL_RCC_SetADC12_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC12_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[46], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ADC12 channel pre divided Value
  * @rmtoll FINDIV46CFGR      FINDIV46      LL_RCC_GetADC12_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC12_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ADC12 channel pre divided Value
  * @rmtoll FINDIV46CFGR         FINDIV46        LL_RCC_SetADC12_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC12_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ADC12 final divider channel
  * @rmtoll FINDIV46CFGR         FINDIV46EN         LL_RCC_EnableADC12_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC12_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ADC12 final divider channel
  * @rmtoll FINDIV46CFGR         FINDIV46EN         LL_RCC_DisableADC12_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC12_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ADC3 channel pre divided Value
  * @rmtoll PREDIV47CFGR      PREDIV47      LL_RCC_GetADC3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[47], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ADC3 channel pre divided Value
  * @rmtoll PREDIV47CFGR         PREDIV47        LL_RCC_SetADC3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[47], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ADC3 channel pre divided Value
  * @rmtoll FINDIV47CFGR      FINDIV47      LL_RCC_GetADC3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ADC3 channel pre divided Value
  * @rmtoll FINDIV47CFGR         FINDIV47        LL_RCC_SetADC3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ADC3 final divider channel
  * @rmtoll FINDIV47CFGR         FINDIV47EN         LL_RCC_EnableADC3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ADC3 final divider channel
  * @rmtoll FINDIV47CFGR         FINDIV47EN         LL_RCC_DisableADC3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#else

/**
  * @brief  Get ADC1 channel pre divided Value
  * @rmtoll PREDIV46CFGR      PREDIV46      LL_RCC_GetADC1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[46], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ADC1 channel pre divided Value
  * @rmtoll PREDIV46CFGR         PREDIV46        LL_RCC_SetADC1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[46], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ADC1 channel pre divided Value
  * @rmtoll FINDIV46CFGR      FINDIV46      LL_RCC_GetADC1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ADC1 channel pre divided Value
  * @rmtoll FINDIV46CFGR         FINDIV46        LL_RCC_SetADC1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ADC1 final divider channel
  * @rmtoll FINDIV46CFGR         FINDIV46EN         LL_RCC_EnableADC1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ADC1 final divider channel
  * @rmtoll FINDIV46CFGR         FINDIV46EN         LL_RCC_DisableADC1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[46], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ADC2 channel pre divided Value
  * @rmtoll PREDIV47CFGR      PREDIV47      LL_RCC_GetADC2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[47], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ADC2 channel pre divided Value
  * @rmtoll PREDIV47CFGR         PREDIV47        LL_RCC_SetADC2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[47], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ADC2 channel pre divided Value
  * @rmtoll FINDIV47CFGR      FINDIV47      LL_RCC_GetADC2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetADC2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ADC2 channel pre divided Value
  * @rmtoll FINDIV47CFGR         FINDIV47        LL_RCC_SetADC2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADC2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ADC2 final divider channel
  * @rmtoll FINDIV47CFGR         FINDIV47EN         LL_RCC_EnableADC2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableADC2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ADC2 final divider channel
  * @rmtoll FINDIV47CFGR         FINDIV47EN         LL_RCC_DisableADC2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableADC2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[47], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
/**
  * @brief  Get OSPI1 channel pre divided Value
  * @rmtoll PREDIV48CFGR      PREDIV48      LL_RCC_GetOSPI1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetOSPI1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[48], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set OSPI1 channel pre divided Value
  * @rmtoll PREDIV48CFGR         PREDIV48        LL_RCC_SetOSPI1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOSPI1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[48], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get OSPI1 channel pre divided Value
  * @rmtoll FINDIV48CFGR      FINDIV48      LL_RCC_GetOSPI1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetOSPI1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[48], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set OSPI1 channel pre divided Value
  * @rmtoll FINDIV48CFGR         FINDIV48        LL_RCC_SetOSPI1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOSPI1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[48], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable OSPI1 final divider channel
  * @rmtoll FINDIV48CFGR         FINDIV48EN         LL_RCC_EnableOSPI1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableOSPI1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[48], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable OSPI1 final divider channel
  * @rmtoll FINDIV48CFGR         FINDIV48EN         LL_RCC_DisableOSPI1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableOSPI1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[48], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

