zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if !defined(RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING)
/**
  * @brief  Get OSPI2 channel pre divided Value
  * @rmtoll PREDIV49CFGR      PREDIV49      LL_RCC_GetOSPI2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetOSPI2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[49], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set OSPI2 channel pre divided Value
  * @rmtoll PREDIV49CFGR         PREDIV49        LL_RCC_SetOSPI2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOSPI2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[49], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get OSPI2 channel pre divided Value
  * @rmtoll FINDIV49CFGR      FINDIV49      LL_RCC_GetOSPI2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetOSPI2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[49], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set OSPI2 channel pre divided Value
  * @rmtoll FINDIV49CFGR         FINDIV49        LL_RCC_SetOSPI2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetOSPI2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[49], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable OSPI2 final divider channel
  * @rmtoll FINDIV49CFGR         FINDIV49EN         LL_RCC_EnableOSPI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableOSPI2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[49], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable OSPI2 final divider channel
  * @rmtoll FINDIV49CFGR         FINDIV49EN         LL_RCC_DisableOSPI2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableOSPI2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[49], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}
#endif /* RCC_DERIVATIVE1_FLEXGEN_CHANNEL_MAPPING */
/**
  * @brief  Get FMCCLOCK channel pre divided Value
  * @rmtoll PREDIV50CFGR      PREDIV50      LL_RCC_GetFMCCLOCK_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetFMC_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[50], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set FMCCLOCK channel pre divided Value
  * @rmtoll PREDIV50CFGR         PREDIV50        LL_RCC_SetFMCCLOCK_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFMC_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[50], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get FMCCLOCK channel pre divided Value
  * @rmtoll FINDIV50CFGR      FINDIV50      LL_RCC_GetFMCCLOCK_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetFMC_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[50], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set FMCCLOCK channel pre divided Value
  * @rmtoll FINDIV50CFGR         FINDIV50        LL_RCC_SetFMCCLOCK_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFMC_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[50], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable FMCCLOCK final divider channel
  * @rmtoll FINDIV50CFGR         FINDIV50EN         LL_RCC_EnableFMCCLOCK_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableFMC_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[50], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable FMCCLOCK final divider channel
  * @rmtoll FINDIV50CFGR         FINDIV50EN         LL_RCC_DisableFMCCLOCK_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableFMC_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[50], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SDMMC1 channel pre divided Value
  * @rmtoll PREDIV51CFGR      PREDIV51      LL_RCC_GetSDMMC1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[51], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SDMMC1 channel pre divided Value
  * @rmtoll PREDIV51CFGR         PREDIV51        LL_RCC_SetSDMMC1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[51], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SDMMC1 channel pre divided Value
  * @rmtoll FINDIV51CFGR      FINDIV51      LL_RCC_GetSDMMC1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[51], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SDMMC1 channel pre divided Value
  * @rmtoll FINDIV51CFGR         FINDIV51        LL_RCC_SetSDMMC1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[51], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SDMMC1 final divider channel
  * @rmtoll FINDIV51CFGR         FINDIV51EN         LL_RCC_EnableSDMMC1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSDMMC1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[51], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SDMMC1 final divider channel
  * @rmtoll FINDIV51CFGR         FINDIV51EN         LL_RCC_DisableSDMMC1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSDMMC1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[51], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SDMMC2 channel pre divided Value
  * @rmtoll PREDIV52CFGR      PREDIV52      LL_RCC_GetSDMMC2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[52], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SDMMC2 channel pre divided Value
  * @rmtoll PREDIV52CFGR         PREDIV52        LL_RCC_SetSDMMC2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[52], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SDMMC2 channel pre divided Value
  * @rmtoll FINDIV52CFGR      FINDIV52      LL_RCC_GetSDMMC2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[52], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SDMMC2 channel pre divided Value
  * @rmtoll FINDIV52CFGR         FINDIV52        LL_RCC_SetSDMMC2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[52], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SDMMC2 final divider channel
  * @rmtoll FINDIV52CFGR         FINDIV52EN         LL_RCC_EnableSDMMC2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSDMMC2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[52], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SDMMC2 final divider channel
  * @rmtoll FINDIV52CFGR         FINDIV52EN         LL_RCC_DisableSDMMC2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSDMMC2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[52], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get SDMMC3 channel pre divided Value
  * @rmtoll PREDIV53CFGR      PREDIV53      LL_RCC_GetSDMMC3_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC3_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[53], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set SDMMC3 channel pre divided Value
  * @rmtoll PREDIV53CFGR         PREDIV53        LL_RCC_SetSDMMC3_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC3_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[53], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get SDMMC3 channel pre divided Value
  * @rmtoll FINDIV53CFGR      FINDIV53      LL_RCC_GetSDMMC3_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMC3_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[53], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set SDMMC3 channel pre divided Value
  * @rmtoll FINDIV53CFGR         FINDIV53        LL_RCC_SetSDMMC3_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMC3_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[53], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable SDMMC3 final divider channel
  * @rmtoll FINDIV53CFGR         FINDIV53EN         LL_RCC_EnableSDMMC3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableSDMMC3_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[53], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable SDMMC3 final divider channel
  * @rmtoll FINDIV53CFGR         FINDIV53EN         LL_RCC_DisableSDMMC3_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableSDMMC3_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[53], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ETH1 channel pre divided Value
  * @rmtoll PREDIV54CFGR      PREDIV54      LL_RCC_GetETH1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[54], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ETH1 channel pre divided Value
  * @rmtoll PREDIV54CFGR         PREDIV54        LL_RCC_SetETH1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[54], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ETH1 channel pre divided Value
  * @rmtoll FINDIV54CFGR      FINDIV54      LL_RCC_GetETH1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[54], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ETH1 channel pre divided Value
  * @rmtoll FINDIV54CFGR         FINDIV54        LL_RCC_SetETH1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[54], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ETH1 final divider channel
  * @rmtoll FINDIV54CFGR         FINDIV54EN         LL_RCC_EnableETH1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETH1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[54], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ETH1 final divider channel
  * @rmtoll FINDIV54CFGR         FINDIV54EN         LL_RCC_DisableETH1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETH1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[54], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ETH2 channel pre divided Value
  * @rmtoll PREDIV55CFGR      PREDIV55      LL_RCC_GetETH2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[55], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ETH2 channel pre divided Value
  * @rmtoll PREDIV55CFGR         PREDIV55        LL_RCC_SetETH2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[55], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ETH2 channel pre divided Value
  * @rmtoll FINDIV55CFGR      FINDIV55      LL_RCC_GetETH2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[55], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ETH2 channel pre divided Value
  * @rmtoll FINDIV55CFGR         FINDIV55        LL_RCC_SetETH2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[55], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ETH2 final divider channel
  * @rmtoll FINDIV55CFGR         FINDIV55EN         LL_RCC_EnableETH2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETH2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[55], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ETH2 final divider channel
  * @rmtoll FINDIV55CFGR         FINDIV55EN         LL_RCC_DisableETH2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETH2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[55], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ETH1_2_PTP channel pre divided Value
  * @rmtoll PREDIV56CFGR      PREDIV56      LL_RCC_GetETH1_2_PTP_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1_2_PTP_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[56], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ETH1_2_PTP channel pre divided Value
  * @rmtoll PREDIV56CFGR         PREDIV56        LL_RCC_SetETH1_2_PTP_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH1_2_PTP_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[56], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ETH1_2_PTP channel pre divided Value
  * @rmtoll FINDIV56CFGR      FINDIV56      LL_RCC_GetETH1_2_PTP_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetETH1_2_PTP_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[56], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ETH1_2_PTP channel pre divided Value
  * @rmtoll FINDIV56CFGR         FINDIV56        LL_RCC_SetETH1_2_PTP_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETH1_2_PTP_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[56], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ETH1_2_PTP final divider channel
  * @rmtoll FINDIV56CFGR         FINDIV56EN         LL_RCC_EnableETH1_2_PTP_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETH1_2_PTP_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[56], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ETH1_2_PTP final divider channel
  * @rmtoll FINDIV56CFGR         FINDIV56EN         LL_RCC_DisableETH1_2_PTP_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETH1_2_PTP_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[56], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get USB2PHY1 channel pre divided Value
  * @rmtoll PREDIV57CFGR      PREDIV57      LL_RCC_GetUSB2PHY1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB2PHY1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[57], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USB2PHY1 channel pre divided Value
  * @rmtoll PREDIV57CFGR         PREDIV57        LL_RCC_SetUSB2PHY1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB2PHY1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[57], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USB2PHY1 channel pre divided Value
  * @rmtoll FINDIV57CFGR      FINDIV57      LL_RCC_GetUSB2PHY1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB2PHY1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[57], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USB2PHY1 channel pre divided Value
  * @rmtoll FINDIV57CFGR         FINDIV57        LL_RCC_SetUSB2PHY1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB2PHY1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[57], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USB2PHY1 final divider channel
  * @rmtoll FINDIV57CFGR         FINDIV57EN         LL_RCC_EnableUSB2PHY1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSB2PHY1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[57], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USB2PHY1 final divider channel
  * @rmtoll FINDIV57CFGR         FINDIV57EN         LL_RCC_DisableUSB2PHY1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSB2PHY1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[57], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get USB2PHY2 channel pre divided Value
  * @rmtoll PREDIV58CFGR      PREDIV58      LL_RCC_GetUSB2PHY2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB2PHY2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[58], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set USB2PHY2 channel pre divided Value
  * @rmtoll PREDIV58CFGR         PREDIV58        LL_RCC_SetUSB2PHY2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB2PHY2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[58], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get USB2PHY2 channel pre divided Value
  * @rmtoll FINDIV58CFGR      FINDIV58      LL_RCC_GetUSB2PHY2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSB2PHY2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[58], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set USB2PHY2 channel pre divided Value
  * @rmtoll FINDIV58CFGR         FINDIV58        LL_RCC_SetUSB2PHY2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSB2PHY2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[58], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable USB2PHY2 final divider channel
  * @rmtoll FINDIV58CFGR         FINDIV58EN         LL_RCC_EnableUSB2PHY2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableUSB2PHY2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[58], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable USB2PHY2 final divider channel
  * @rmtoll FINDIV58CFGR         FINDIV58EN         LL_RCC_DisableUSB2PHY2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableUSB2PHY2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[58], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get ETHSWCFG channel pre divided Value
  * @rmtoll PREDIV59CFGR      PREDIV59      LL_RCC_GetETHSWCFG_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHSWCFG_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[59], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

