zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Set ETHSWCFG channel pre divided Value
  * @rmtoll PREDIV59CFGR         PREDIV59        LL_RCC_SetETHSWCFG_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHSWCFG_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[59], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ETHSWCFG channel pre divided Value
  * @rmtoll FINDIV59CFGR      FINDIV59      LL_RCC_GetETHSWCFG_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHSWCFG_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[59], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ETHSWCFG channel pre divided Value
  * @rmtoll FINDIV59CFGR         FINDIV59        LL_RCC_SetETHSWCFG_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHSWCFG_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[59], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ETHSWCFG final divider channel
  * @rmtoll FINDIV59CFGR         FINDIV59EN         LL_RCC_EnableETHSWCFG_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETHSWCFG_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[59], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ETHSWCFG final divider channel
  * @rmtoll FINDIV59CFGR         FINDIV59EN         LL_RCC_DisableETHSWCFG_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETHSWCFG_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[59], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}


/**
  * @brief  Get ETHSWMSG channel pre divided Value
  * @rmtoll PREDIV60CFGR      PREDIV60      LL_RCC_GetETHSWMSG_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHSWMSG_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[60], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set ETHSWMSG channel pre divided Value
  * @rmtoll PREDIV60CFGR         PREDIV60        LL_RCC_SetETHSWMSG_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHSWMSG_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[60], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get ETHSWMSG channel pre divided Value
  * @rmtoll FINDIV60CFGR      FINDIV60      LL_RCC_GetETHSWMSG_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHSWMSG_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[60], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set ETHSWMSG channel pre divided Value
  * @rmtoll FINDIV60CFGR         FINDIV60        LL_RCC_SetETHSWMSG_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHSWMSG_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[60], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable ETHSWMSG final divider channel
  * @rmtoll FINDIV60CFGR         FINDIV60EN         LL_RCC_EnableETHSWMSG_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableETHSWMSG_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[60], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable ETHSWMSG final divider channel
  * @rmtoll FINDIV60CFGR         FINDIV60EN         LL_RCC_DisableETHSWMSG_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableETHSWMSG_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[60], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get MCO1 channel pre divided Value
  * @rmtoll PREDIV61CFGR      PREDIV61      LL_RCC_GetMCO1_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCO1_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[61], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set MCO1 channel pre divided Value
  * @rmtoll PREDIV61CFGR         PREDIV61        LL_RCC_SetMCO1_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMCO1_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[61], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get MCO1 channel pre divided Value
  * @rmtoll FINDIV61CFGR      FINDIV61      LL_RCC_GetMCO1_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCO1_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[61], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set MCO1 channel pre divided Value
  * @rmtoll FINDIV61CFGR         FINDIV61        LL_RCC_SetMCO1_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMCO1_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[61], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable MCO1 final divider channel
  * @rmtoll FINDIV61CFGR         FINDIV61EN         LL_RCC_EnableMCO1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableMCO1_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[61], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable MCO1 final divider channel
  * @rmtoll FINDIV61CFGR         FINDIV61EN         LL_RCC_DisableMCO1_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableMCO1_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[61], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get MCO2 channel pre divided Value
  * @rmtoll PREDIV62CFGR      PREDIV62      LL_RCC_GetMCO2_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCO2_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[62], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set MCO2 channel pre divided Value
  * @rmtoll PREDIV62CFGR         PREDIV62        LL_RCC_SetMCO2_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMCO2_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[62], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get MCO2 channel pre divided Value
  * @rmtoll FINDIV62CFGR      FINDIV62      LL_RCC_GetMCO2_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetMCO2_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[62], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set MCO2 channel pre divided Value
  * @rmtoll FINDIV62CFGR         FINDIV62        LL_RCC_SetMCO2_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMCO2_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[62], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable MCO2 final divider channel
  * @rmtoll FINDIV62CFGR         FINDIV62EN         LL_RCC_EnableMCO2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableMCO2_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[62], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable MCO2 final divider channel
  * @rmtoll FINDIV62CFGR         FINDIV62EN         LL_RCC_DisableMCO2_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableMCO2_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[62], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Get CPU1EXT2F channel pre divided Value
  * @rmtoll PREDIV63CFGR      PREDIV63      LL_RCC_GetCPU1EXT2F_PREDIV
  * @retval Returned value can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  */
__STATIC_INLINE uint32_t LL_RCC_GetCPU1EXT2F_PREDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PREDIVxCFGR[63], RCC_PREDIVxCFGR_PREDIVx_Msk));
}

/**
  * @brief  Set CPU1EXT2F channel pre divided Value
  * @rmtoll PREDIV63CFGR         PREDIV63        LL_RCC_SetCPU1EXT2F_PREDIV
  * @param  Source This parameter can be one of the following values:
  *        @arg @ref LL_RCC_PREDIV_DIV1
  *        @arg @ref LL_RCC_PREDIV_DIV2
  *        @arg @ref LL_RCC_PREDIV_DIV4
  *        @arg @ref LL_RCC_PREDIV_DIV1024
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCPU1EXT2F_PREDIV(uint32_t Source)
{
  MODIFY_REG(RCC->PREDIVxCFGR[63], RCC_PREDIVxCFGR_PREDIVx_Msk, Source);
}

/* FINDIV part */

/**
  * @brief  Get CPU1EXT2F channel pre divided Value
  * @rmtoll FINDIV63CFGR      FINDIV63      LL_RCC_GetCPU1EXT2F_FINDIV
  * @retval A value between 0 and 63, div1 up to div64 step
  */
__STATIC_INLINE uint32_t LL_RCC_GetCPU1EXT2F_FINDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->FINDIVxCFGR[63], RCC_FINDIVxCFGR_FINDIVx_Msk));
}

/**
  * @brief  Set CPU1EXT2F channel pre divided Value
  * @rmtoll FINDIV63CFGR         FINDIV63        LL_RCC_SetCPU1EXT2F_FINDIV
  * @param  Value parameter can be a value between 0 and 63 to divide from 1 up to 64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCPU1EXT2F_FINDIV(uint32_t Value)
{
  MODIFY_REG(RCC->FINDIVxCFGR[63], RCC_FINDIVxCFGR_FINDIVx_Msk, Value);
}

/**
  * @brief  Enable CPU1EXT2F final divider channel
  * @rmtoll FINDIV63CFGR         FINDIV63EN         LL_RCC_EnableCPU1EXT2F_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableCPU1EXT2F_FINDIV(void)
{
  SET_BIT(RCC->FINDIVxCFGR[63], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @brief  Disable CPU1EXT2F final divider channel
  * @rmtoll FINDIV63CFGR         FINDIV63EN         LL_RCC_DisableCPU1EXT2F_FINDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableCPU1EXT2F_FINDIV(void)
{
  CLEAR_BIT(RCC->FINDIVxCFGR[63], RCC_FINDIVxCFGR_FINDIVxEN_Msk);
}

/**
  * @}
  */

