zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Set the oscillator used as PLL1 clock source.
  * @note   PLLSRC can be written only when all PLL1 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL5        LL_RCC_PLL1_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL1SOURCE_HSI
  *         @arg @ref LL_RCC_PLL1SOURCE_HSE
  *         @arg @ref LL_RCC_PLL1SOURCE_MSI
  *         @arg @ref LL_RCC_PLL1SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL5, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL1 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL5        LL_RCC_PLL1_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL1SOURCE_HSI
  *         @arg @ref LL_RCC_PLL1SOURCE_HSE
  *         @arg @ref LL_RCC_PLL1SOURCE_MSI
  *         @arg @ref LL_RCC_PLL1SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL5));
}

/**
  * @brief  Set the oscillator used as PLL2 clock source.
  * @note   PLLSRC can be written only when all PLL2 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL6        LL_RCC_PLL2_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL2SOURCE_HSI
  *         @arg @ref LL_RCC_PLL2SOURCE_HSE
  *         @arg @ref LL_RCC_PLL2SOURCE_MSI
  *         @arg @ref LL_RCC_PLL2SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL6, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL2 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL6        LL_RCC_PLL2_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL2SOURCE_HSI
  *         @arg @ref LL_RCC_PLL2SOURCE_HSE
  *         @arg @ref LL_RCC_PLL2SOURCE_MSI
  *         @arg @ref LL_RCC_PLL2SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL6));
}

/**
  * @brief  Enable PLL2
  * @rmtoll PLL2CFGR1           PLLEN         LL_RCC_PLL2_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_Enable(void)
{
  SET_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL2
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL2 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL2CFGR1           PLLEN         LL_RCC_PLL2_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_PLLEN);
}

/**
  * @brief  assert PLL2 Spread Spectrum Modulator reset
  * @rmtoll PLL2CFGR1           SSMODRST         LL_RCC_PLL2_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_SSMODRST);
}

/**
  * @brief  release PLL2 Spread Spectrum Modulator reset
  * @rmtoll PLL2CFGR1           SSMODRST         LL_RCC_PLL2_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL2 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL2CFGR1           SSMODRST        LL_RCC_PLL2_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_SSMODRST) == RCC_PLL2CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL2 Ready
  * @rmtoll PLL2CFGR1           PLL2RDY        LL_RCC_PLL2_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_IsReady(void)
{
  return ((READ_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_PLLRDY) == RCC_PLL2CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR1      CKREFST          LL_RCC_PLL2_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL2_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL2CFGR1, RCC_PLL2CFGR1_CKREFST, CKREFST << RCC_PLL2CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL2 reference clock is running
  * @rmtoll PLL2CFGR1           CKREFST        LL_RCC_PLL2_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_CKREFST) == RCC_PLL2CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR2      FBDIV          LL_RCC_PLL2_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL2_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_FBDIV, FBDIV << RCC_PLL2CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR2      FBDIV          LL_RCC_PLL2_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL2CFGR2, RCC_PLL2CFGR2_FBDIV) >>  RCC_PLL2CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL2  reference input clock divide frequency ratio
  * @rmtoll PLL2CFGR2      FREFDIV          LL_RCC_PLL2_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL2_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_FREFDIV, FREFDIV << RCC_PLL2CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL2  reference input clock divide frequency ratio
  * @rmtoll PLL2CFGR2      FREFDIV          LL_RCC_PLL2_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL2CFGR2, RCC_PLL2CFGR2_FREFDIV) >>  RCC_PLL2CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR3      FRACIN          LL_RCC_PLL2_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL2_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL2CFGR3, RCC_PLL2CFGR3_FRACIN, FRACIN << RCC_PLL2CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR3      FRACIN          LL_RCC_PLL2_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_FRACIN) >>  RCC_PLL2CFGR3_FRACIN_Pos);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL2
  * @rmtoll PLL2CFGR3           SSCGDIS         LL_RCC_PLL2_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_SSCGDIS);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL2
  * @rmtoll PLL2CFGR3           SSCGDIS         LL_RCC_PLL2_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_CSG_Disable(void)
{
  SET_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL2Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL2CFGR3           SSCGDIS        LL_RCC_PLL2_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_SSCGDIS) == RCC_PLL2CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL2
  * @rmtoll PLL2CFGR3           DACEN         LL_RCC_PLL2DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL2
  * @rmtoll PLL2CFGR3           DACEN         LL_RCC_PLL2DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2DAC_Disable(void)
{
  SET_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DACEN);
}

/**
  * @brief  Check if PLL2 DAC is Enabled
  * @rmtoll PLL2CFGR3           DACEN        LL_RCC_PLL2_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DACEN) == RCC_PLL2CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL2
  * @rmtoll PLL2CFGR3           DOWNSPREAD         LL_RCC_PLL2DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL2
  * @rmtoll PLL2CFGR3           DOWNSPREAD         LL_RCC_PLL2DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL2 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL2CFGR4           BYPASS        LL_RCC_PLL2_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_BYPASS) == RCC_PLL2CFGR4_BYPASS) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL2
  * @rmtoll PLL2CFGR4           BYPASS         LL_RCC_PLL2_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL2
  * @rmtoll PLL2CFGR4           BYPASS         LL_RCC_PLL2_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL2  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL2CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL2_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_FOUTPOSTDIVEN) == RCC_PLL2CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL2
  * @rmtoll PLL2CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL2_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL2
  * @rmtoll PLL2CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL2_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL2 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL2CFGR4           DSMEN        LL_RCC_PLL2_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_PLL2_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_DSMEN) == RCC_PLL2CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL2
  * @rmtoll PLL2CFGR4           DSMEN         LL_RCC_PLL2_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL2
  * @rmtoll PLL2CFGR4           DSMEN         LL_RCC_PLL2_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CFGR4, RCC_PLL2CFGR4_DSMEN);
}

/** @brief  Configure the PLL2 Clock Spreading Generator
  * @rmtoll PLL2CSGR    DIVVAL, SPREAD  LL_RCC_PLL2_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL2
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL2
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL2CFGR5, (RCC_PLL2CFGR5_DIVVAL | RCC_PLL2CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL2CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL2 VCO frequency divide level 1
  * @rmtoll PLL2CFGR6      POSTDIV1          LL_RCC_PLL2_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL2_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL2CFGR6, RCC_PLL2CFGR6_POSTDIV1, POSTDIV << RCC_PLL2CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR6      POSTDIV1          LL_RCC_PLL2_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL2CFGR6, RCC_PLL2CFGR6_POSTDIV1) >>  RCC_PLL2CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL2  reference input clock divide frequency ratio
  * @rmtoll PLL2CFGR7      POSTDIV2          LL_RCC_PLL2_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL2_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL2CFGR7, RCC_PLL2CFGR7_POSTDIV2, POSTDIV << RCC_PLL2CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL2 VCO multiplication factor
  * @rmtoll PLL2CFGR7      POSTDIV2          LL_RCC_PLL2_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL2CFGR7, RCC_PLL2CFGR7_POSTDIV2) >>  RCC_PLL2CFGR7_POSTDIV2_Pos);
}

#if defined(RCC_PLL3CFGR1_PLLEN)
/**
  * @brief  Set the oscillator used as PLL3 clock source.
  * @note   PLLSRC can be written only when all PLL3 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL7        LL_RCC_PLL3_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL3SOURCE_HSI
  *         @arg @ref LL_RCC_PLL3SOURCE_HSE
  *         @arg @ref LL_RCC_PLL3SOURCE_MSI
  *         @arg @ref LL_RCC_PLL3SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL7, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL3 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL7        LL_RCC_PLL3_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL3SOURCE_HSI
  *         @arg @ref LL_RCC_PLL3SOURCE_HSE
  *         @arg @ref LL_RCC_PLL3SOURCE_MSI
  *         @arg @ref LL_RCC_PLL3SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL7));
}

/**
  * @brief  Enable PLL3
  * @rmtoll PLL3CFGR1           PLLEN         LL_RCC_PLL3_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_Enable(void)
{
  SET_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL3
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL1 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL3CFGR1           PLLEN         LL_RCC_PLL3_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLLEN);
}

/**
  * @brief  assert PLL3 Spread Spectrum Modulator reset
  * @rmtoll PLL3CFGR1           SSMODRST         LL_RCC_PLL3_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_SSMODRST);
}

/**
  * @brief  release PLL3 Spread Spectrum Modulator reset
  * @rmtoll PLL3CFGR1           SSMODRST         LL_RCC_PLL3_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL3 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL3CFGR1           SSMODRST        LL_RCC_PLL3_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_SSMODRST) == RCC_PLL3CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL3 Ready
  * @rmtoll PLL3CFGR1           PLL3RDY        LL_RCC_PLL3_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsReady(void)
{
  return ((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLLRDY) == RCC_PLL3CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR1      CKREFST          LL_RCC_PLL3_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL3_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_CKREFST, CKREFST << RCC_PLL3CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL3 reference clock is running
  * @rmtoll PLL3CFGR1           CKREFST        LL_RCC_PLL3_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_CKREFST) == RCC_PLL3CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR2      FBDIV          LL_RCC_PLL3_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL3_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_FBDIV, FBDIV << RCC_PLL3CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR2      FBDIV          LL_RCC_PLL3_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_FBDIV) >>  RCC_PLL3CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL3  reference input clock divide frequency ratio
  * @rmtoll PLL3CFGR2      FREFDIV          LL_RCC_PLL3_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL3_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_FREFDIV, FREFDIV << RCC_PLL3CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL3  reference input clock divide frequency ratio
  * @rmtoll PLL3CFGR2      FREFDIV          LL_RCC_PLL3_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_FREFDIV) >>  RCC_PLL3CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR3      FRACIN          LL_RCC_PLL3_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL3_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL3CFGR3, RCC_PLL3CFGR3_FRACIN, FRACIN << RCC_PLL3CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR3      FRACIN          LL_RCC_PLL3_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_FRACIN) >>  RCC_PLL3CFGR3_FRACIN_Pos);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL3
  * @rmtoll PLL3CFGR3           SSCGDIS         LL_RCC_PLL3_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_SSCGDIS);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL3
  * @rmtoll PLL3CFGR3           SSCGDIS         LL_RCC_PLL3_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_CSG_Disable(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL3Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL3CFGR3           SSCGDIS        LL_RCC_PLL3_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_SSCGDIS) == RCC_PLL3CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL3
  * @rmtoll PLL3CFGR3           DACEN         LL_RCC_PLL3DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL3
  * @rmtoll PLL3CFGR3           DACEN         LL_RCC_PLL3DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3DAC_Disable(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DACEN);
}

/**
  * @brief  Check if PLL3 DAC is Enabled
  * @rmtoll PLL3CFGR3           DACEN        LL_RCC_PLL3_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DACEN) == RCC_PLL3CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL3
  * @rmtoll PLL3CFGR3           DOWNSPREAD         LL_RCC_PLL3DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL3
  * @rmtoll PLL3CFGR3           DOWNSPREAD         LL_RCC_PLL3DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL3 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL3CFGR4           BYPASS        LL_RCC_PLL3_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_BYPASS) == RCC_PLL3CFGR4_BYPASS) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL3
  * @rmtoll PLL3CFGR4           BYPASS         LL_RCC_PLL3_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL3
  * @rmtoll PLL3CFGR4           BYPASS         LL_RCC_PLL3_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL3  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL3CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL3_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_FOUTPOSTDIVEN) == RCC_PLL3CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL3
  * @rmtoll PLL3CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL3_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_FOUTPOSTDIVEN);
}

