zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL3
  * @rmtoll PLL3CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL3_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL3 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL3CFGR4           DSMEN        LL_RCC_PLL3_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_DSMEN) == RCC_PLL3CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL3
  * @rmtoll PLL3CFGR4           DSMEN         LL_RCC_PLL3_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL3
  * @rmtoll PLL3CFGR4           DSMEN         LL_RCC_PLL3_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR4, RCC_PLL3CFGR4_DSMEN);
}

/** @brief  Configure the PLL3 Clock Spreading Generator
  * @rmtoll PLL3CSGR    DIVVAL, SPREAD  LL_RCC_PLL3_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL3
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL3
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL3CFGR5, (RCC_PLL3CFGR5_DIVVAL | RCC_PLL3CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL3CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL3 VCO frequency divide level 1
  * @rmtoll PLL3CFGR6      POSTDIV1          LL_RCC_PLL3_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL3_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL3CFGR6, RCC_PLL3CFGR6_POSTDIV1, POSTDIV << RCC_PLL3CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR6      POSTDIV1          LL_RCC_PLL3_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR6, RCC_PLL3CFGR6_POSTDIV1) >>  RCC_PLL3CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL3  reference input clock divide frequency ratio
  * @rmtoll PLL3CFGR7      POSTDIV2          LL_RCC_PLL3_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL3_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL3CFGR7, RCC_PLL3CFGR7_POSTDIV2, POSTDIV << RCC_PLL3CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL3 VCO multiplication factor
  * @rmtoll PLL3CFGR7      POSTDIV2          LL_RCC_PLL3_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR7, RCC_PLL3CFGR7_POSTDIV2) >>  RCC_PLL3CFGR7_POSTDIV2_Pos);
}
#endif /* RCC_PLL3CFGR1_PLLEN */

/**
  * @brief  Set the oscillator used as PLL4 clock source.
  * @note   PLLSRC can be written only when all PLL4 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL0        LL_RCC_PLL4_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL4SOURCE_HSI
  *         @arg @ref LL_RCC_PLL4SOURCE_HSE
  *         @arg @ref LL_RCC_PLL4SOURCE_MSI
  *         @arg @ref LL_RCC_PLL4SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL0, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL4 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL0        LL_RCC_PLL4_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL4SOURCE_HSI
  *         @arg @ref LL_RCC_PLL4SOURCE_HSE
  *         @arg @ref LL_RCC_PLL4SOURCE_MSI
  *         @arg @ref LL_RCC_PLL4SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL0));
}

/**
  * @brief  Enable PLL4
  * @rmtoll PLL4CFGR1           PLLEN         LL_RCC_PLL4_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_Enable(void)
{
  SET_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL4
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL4 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL4CFGR1           PLLEN         LL_RCC_PLL4_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLLEN);
}

/**
  * @brief  assert PLL4 Spread Spectrum Modulator reset
  * @rmtoll PLL4CFGR1           SSMODRST         LL_RCC_PLL4_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_SSMODRST);
}

/**
  * @brief  release PLL4 Spread Spectrum Modulator reset
  * @rmtoll PLL4CFGR1           SSMODRST         LL_RCC_PLL4_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL4 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL4CFGR1           SSMODRST        LL_RCC_PLL4_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_SSMODRST) == RCC_PLL4CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL4 Ready
  * @rmtoll PLL4CFGR1           PLL4RDY        LL_RCC_PLL4_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsReady(void)
{
  return ((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLLRDY) == RCC_PLL4CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR1      CKREFST          LL_RCC_PLL4_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL4_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_CKREFST, CKREFST << RCC_PLL4CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL4 reference clock is running
  * @rmtoll PLL4CFGR1           CKREFST        LL_RCC_PLL4_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_CKREFST) == RCC_PLL4CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR2      FBDIV          LL_RCC_PLL4_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL4_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_FBDIV, FBDIV << RCC_PLL4CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR2      FBDIV          LL_RCC_PLL4_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_FBDIV) >>  RCC_PLL4CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL4  reference input clock divide frequency ratio
  * @rmtoll PLL4CFGR2      FREFDIV          LL_RCC_PLL4_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL4_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_FREFDIV, FREFDIV << RCC_PLL4CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL4  reference input clock divide frequency ratio
  * @rmtoll PLL4CFGR2      FREFDIV          LL_RCC_PLL4_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_FREFDIV) >>  RCC_PLL4CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR3      FRACIN          LL_RCC_PLL4_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL4_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL4CFGR3, RCC_PLL4CFGR3_FRACIN, FRACIN << RCC_PLL4CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR3      FRACIN          LL_RCC_PLL4_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_FRACIN) >>  RCC_PLL4CFGR3_FRACIN_Pos);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL4
  * @rmtoll PLL4CFGR3           SSCGDIS         LL_RCC_PLL4_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_SSCGDIS);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL4
  * @rmtoll PLL4CFGR3           SSCGDIS         LL_RCC_PLL4_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_CSG_Disable(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL4Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL4CFGR3           SSCGDIS        LL_RCC_PLL4_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_SSCGDIS) == RCC_PLL4CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL4
  * @rmtoll PLL4CFGR3           DACEN         LL_RCC_PLL4DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL4
  * @rmtoll PLL4CFGR3           DACEN         LL_RCC_PLL4DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4DAC_Disable(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DACEN);
}

/**
  * @brief  Check if PLL4 DAC is Enabled
  * @rmtoll PLL4CFGR3           DACEN        LL_RCC_PLL4_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DACEN) == RCC_PLL4CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL4
  * @rmtoll PLL4CFGR3           DOWNSPREAD         LL_RCC_PLL4DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL4
  * @rmtoll PLL4CFGR3           DOWNSPREAD         LL_RCC_PLL4DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL4 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL4CFGR4           BYPASS        LL_RCC_PLL4_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_BYPASS) == RCC_PLL4CFGR4_BYPASS) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL4
  * @rmtoll PLL4CFGR4           BYPASS         LL_RCC_PLL4_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL4
  * @rmtoll PLL4CFGR4           BYPASS         LL_RCC_PLL4_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL4  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL4CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL4_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_FOUTPOSTDIVEN) == RCC_PLL4CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL4
  * @rmtoll PLL4CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL4_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL4
  * @rmtoll PLL4CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL4_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL4 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL4CFGR4           DSMEN        LL_RCC_PLL4_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_DSMEN) == RCC_PLL4CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL4
  * @rmtoll PLL4CFGR4           DSMEN         LL_RCC_PLL4_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL4
  * @rmtoll PLL4CFGR4           DSMEN        LL_RCC_PLL4_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR4, RCC_PLL4CFGR4_DSMEN);
}

