zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/** @brief  Configure the PLL4 Clock Spreading Generator
  * @rmtoll PLL4CSGR    DIVVAL, SPREAD  LL_RCC_PLL4_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL4
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL4
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL4CFGR5, (RCC_PLL4CFGR5_DIVVAL | RCC_PLL4CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL4CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL4 VCO frequency divide level 1
  * @rmtoll PLL4CFGR6      POSTDIV1          LL_RCC_PLL4_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL4_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL4CFGR6, RCC_PLL4CFGR6_POSTDIV1, POSTDIV << RCC_PLL4CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR6      POSTDIV1          LL_RCC_PLL4_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR6, RCC_PLL4CFGR6_POSTDIV1) >>  RCC_PLL4CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL4  reference input clock divide frequency ratio
  * @rmtoll PLL4CFGR7      POSTDIV2          LL_RCC_PLL4_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL4_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL4CFGR7, RCC_PLL4CFGR7_POSTDIV2, POSTDIV << RCC_PLL4CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL4 VCO multiplication factor
  * @rmtoll PLL4CFGR7      POSTDIV2          LL_RCC_PLL4_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR7, RCC_PLL4CFGR7_POSTDIV2) >>  RCC_PLL4CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Set the oscillator used as PLL5 clock source.
  * @note   PLLSRC can be written only when all PLL5 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL1        LL_RCC_PLL5_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL5SOURCE_HSI
  *         @arg @ref LL_RCC_PLL5SOURCE_HSE
  *         @arg @ref LL_RCC_PLL5SOURCE_MSI
  *         @arg @ref LL_RCC_PLL5SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL1, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL5 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL1        LL_RCC_PLL5_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL5SOURCE_HSI
  *         @arg @ref LL_RCC_PLL5SOURCE_HSE
  *         @arg @ref LL_RCC_PLL5SOURCE_MSI
  *         @arg @ref LL_RCC_PLL5SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL1));
}

/**
  * @brief  Enable PLL5
  * @rmtoll PLL5CFGR1           PLLEN         LL_RCC_PLL5_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_Enable(void)
{
  SET_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL5
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL5 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL5CFGR1           PLLEN         LL_RCC_PLL5_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_Disable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_PLLEN);
}

/**
  * @brief  assert PLL5 Spread Spectrum Modulator reset
  * @rmtoll PLL5CFGR1           SSMODRST         LL_RCC_PLL5_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_SSMODRST);
}

/**
  * @brief  release PLL5 Spread Spectrum Modulator reset
  * @rmtoll PLL5CFGR1           SSMODRST         LL_RCC_PLL5_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL5 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL5CFGR1           SSMODRST        LL_RCC_PLL5_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_SSMODRST) == RCC_PLL5CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL5 Ready
  * @rmtoll PLL5CFGR1           PLL5RDY        LL_RCC_PLL5_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_IsReady(void)
{
  return ((READ_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_PLLRDY) == RCC_PLL5CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR1      CKREFST          LL_RCC_PLL5_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL5_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL5CFGR1, RCC_PLL5CFGR1_CKREFST, CKREFST << RCC_PLL5CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL5 reference clock is running
  * @rmtoll PLL5CFGR1           CKREFST        LL_RCC_PLL5_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL5CFGR1, RCC_PLL5CFGR1_CKREFST) == RCC_PLL5CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR2      FBDIV          LL_RCC_PLL5_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL5_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL5CFGR2, RCC_PLL5CFGR2_FBDIV, FBDIV << RCC_PLL5CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR2      FBDIV          LL_RCC_PLL5_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL5CFGR2, RCC_PLL5CFGR2_FBDIV) >>  RCC_PLL5CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL5  reference input clock divide frequency ratio
  * @rmtoll PLL5CFGR2      FREFDIV          LL_RCC_PLL5_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL5_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL5CFGR2, RCC_PLL5CFGR2_FREFDIV, FREFDIV << RCC_PLL5CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL5  reference input clock divide frequency ratio
  * @rmtoll PLL5CFGR2      FREFDIV          LL_RCC_PLL5_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL5CFGR2, RCC_PLL5CFGR2_FREFDIV) >>  RCC_PLL5CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR3      FRACIN          LL_RCC_PLL5_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL5_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL5CFGR3, RCC_PLL5CFGR3_FRACIN, FRACIN << RCC_PLL5CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR3      FRACIN          LL_RCC_PLL5_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_FRACIN) >>  RCC_PLL5CFGR3_FRACIN_Pos);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL5
  * @rmtoll PLL5CFGR3           SSCGDIS         LL_RCC_PLL5_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_SSCGDIS);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL5
  * @rmtoll PLL5CFGR3           SSCGDIS         LL_RCC_PLL5_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_CSG_Disable(void)
{
  SET_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL5Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL5CFGR3           SSCGDIS        LL_RCC_PLL5_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_SSCGDIS) == RCC_PLL5CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL5
  * @rmtoll PLL5CFGR3           DACEN         LL_RCC_PLL5DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL5
  * @rmtoll PLL5CFGR3           DACEN         LL_RCC_PLL5DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5DAC_Disable(void)
{
  SET_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DACEN);
}

/**
  * @brief  Check if PLL5 DAC is Enabled
  * @rmtoll PLL5CFGR3           DACEN        LL_RCC_PLL5_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DACEN) == RCC_PLL5CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL5
  * @rmtoll PLL5CFGR3           DOWNSPREAD         LL_RCC_PLL5DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL5
  * @rmtoll PLL5CFGR3           DOWNSPREAD         LL_RCC_PLL5DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL5 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL5CFGR4           BYPASS        LL_RCC_PLL5_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_BYPASS) == RCC_PLL5CFGR4_BYPASS) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL5
  * @rmtoll PLL5CFGR4           BYPASS         LL_RCC_PLL5_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL5
  * @rmtoll PLL5CFGR4           BYPASS         LL_RCC_PLL5_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL5  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL5CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL5_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_FOUTPOSTDIVEN) == RCC_PLL5CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL5
  * @rmtoll PLL5CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL5_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL5
  * @rmtoll PLL5CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL5_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL5 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL5CFGR4           DSMEN        LL_RCC_PLL5_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_DSMEN) == RCC_PLL5CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL5
  * @rmtoll PLL5CFGR4           DSMEN         LL_RCC_PLL5_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL5
  * @rmtoll PLL5CFGR4           DSMEN         LL_RCC_PLL5_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL5CFGR4, RCC_PLL5CFGR4_DSMEN);
}

/** @brief  Configure the PLL5 Clock Spreading Generator
  * @rmtoll PLL5CSGR    DIVVAL, SPREAD  LL_RCC_PLL5_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL5
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL5
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL5_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL5CFGR5, (RCC_PLL5CFGR5_DIVVAL | RCC_PLL5CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL5CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL5 VCO frequency divide level 1
  * @rmtoll PLL5CFGR6      POSTDIV1          LL_RCC_PLL5_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL5_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL5CFGR6, RCC_PLL5CFGR6_POSTDIV1, POSTDIV << RCC_PLL5CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR6      POSTDIV1          LL_RCC_PLL5_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL5CFGR6, RCC_PLL5CFGR6_POSTDIV1) >>  RCC_PLL5CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL5  reference input clock divide frequency ratio
  * @rmtoll PLL5CFGR7      POSTDIV2          LL_RCC_PLL5_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL5_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL5CFGR7, RCC_PLL5CFGR7_POSTDIV2, POSTDIV << RCC_PLL5CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL5 VCO multiplication factor
  * @rmtoll PLL5CFGR7      POSTDIV2          LL_RCC_PLL5_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL5_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL5CFGR7, RCC_PLL5CFGR7_POSTDIV2) >>  RCC_PLL5CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Set the oscillator used as PLL6 clock source.
  * @note   PLLSRC can be written only when all PLL6 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL2        LL_RCC_PLL6_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL6SOURCE_HSI
  *         @arg @ref LL_RCC_PLL6SOURCE_HSE
  *         @arg @ref LL_RCC_PLL6SOURCE_MSI
  *         @arg @ref LL_RCC_PLL6SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL2, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL6 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL2        LL_RCC_PLL6_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL6SOURCE_HSI
  *         @arg @ref LL_RCC_PLL6SOURCE_HSE
  *         @arg @ref LL_RCC_PLL6SOURCE_MSI
  *         @arg @ref LL_RCC_PLL6SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL2));
}

/**
  * @brief  Enable PLL6
  * @rmtoll PLL6CFGR1           PLLEN         LL_RCC_PLL6_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_Enable(void)
{
  SET_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL6
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL6 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL6CFGR1           PLLEN         LL_RCC_PLL6_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_Disable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_PLLEN);
}

/**
  * @brief  assert PLL6 Spread Spectrum Modulator reset
  * @rmtoll PLL6CFGR1           SSMODRST         LL_RCC_PLL6_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_SSMODRST);
}

/**
  * @brief  release PLL6 Spread Spectrum Modulator reset
  * @rmtoll PLL6CFGR1           SSMODRST         LL_RCC_PLL6_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL6 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL6CFGR1           SSMODRST        LL_RCC_PLL6_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_SSMODRST) == RCC_PLL6CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL6 Ready
  * @rmtoll PLL6CFGR1           PLL6RDY        LL_RCC_PLL6_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_IsReady(void)
{
  return ((READ_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_PLLRDY) == RCC_PLL6CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR1      CKREFST          LL_RCC_PLL6_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL6_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL6CFGR1, RCC_PLL6CFGR1_CKREFST, CKREFST << RCC_PLL6CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL6 reference clock is running
  * @rmtoll PLL6CFGR1           CKREFST        LL_RCC_PLL6_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL6CFGR1, RCC_PLL6CFGR1_CKREFST) == RCC_PLL6CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR2      FBDIV          LL_RCC_PLL6_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL6_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL6CFGR2, RCC_PLL6CFGR2_FBDIV, FBDIV << RCC_PLL6CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR2      FBDIV          LL_RCC_PLL6_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL6CFGR2, RCC_PLL6CFGR2_FBDIV) >>  RCC_PLL6CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL6  reference input clock divide frequency ratio
  * @rmtoll PLL6CFGR2      FREFDIV          LL_RCC_PLL6_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL6_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL6CFGR2, RCC_PLL6CFGR2_FREFDIV, FREFDIV << RCC_PLL6CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL6  reference input clock divide frequency ratio
  * @rmtoll PLL6CFGR2      FREFDIV          LL_RCC_PLL6_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL6CFGR2, RCC_PLL6CFGR2_FREFDIV) >>  RCC_PLL6CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR3      FRACIN          LL_RCC_PLL6_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL6_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL6CFGR3, RCC_PLL6CFGR3_FRACIN, FRACIN << RCC_PLL6CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR3      FRACIN          LL_RCC_PLL6_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_FRACIN) >>  RCC_PLL6CFGR3_FRACIN_Pos);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL6
  * @rmtoll PLL6CFGR3           SSCGDIS         LL_RCC_PLL6_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_SSCGDIS);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL6
  * @rmtoll PLL6CFGR3           SSCGDIS         LL_RCC_PLL6_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_CSG_Disable(void)
{
  SET_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL6Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL6CFGR3           SSCGDIS        LL_RCC_PLL6_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_SSCGDIS) == RCC_PLL6CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL6
  * @rmtoll PLL6CFGR3           DACEN         LL_RCC_PLL6DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL6
  * @rmtoll PLL6CFGR3           DACEN         LL_RCC_PLL6DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6DAC_Disable(void)
{
  SET_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DACEN);
}

/**
  * @brief  Check if PLL6 DAC is Enabled
  * @rmtoll PLL6CFGR3           DACEN        LL_RCC_PLL6_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DACEN) == RCC_PLL6CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL6
  * @rmtoll PLL6CFGR3           DOWNSPREAD         LL_RCC_PLL6DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL6
  * @rmtoll PLL6CFGR3           DOWNSPREAD         LL_RCC_PLL6DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL6 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL6CFGR4           BYPASS        LL_RCC_PLL6_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_BYPASS) == RCC_PLL6CFGR4_BYPASS) ? 1UL : 0UL);
}

