zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL6
  * @rmtoll PLL6CFGR4           BYPASS         LL_RCC_PLL6_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL6
  * @rmtoll PLL6CFGR4           BYPASS         LL_RCC_PLL6_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL6  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL6CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL6_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_FOUTPOSTDIVEN) == RCC_PLL6CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL6
  * @rmtoll PLL6CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL6_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL6
  * @rmtoll PLL6CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL6_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL6 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL6CFGR4           DSMEN        LL_RCC_PLL6_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_DSMEN) == RCC_PLL6CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL6
  * @rmtoll PLL6CFGR4           DSMEN         LL_RCC_PLL6_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL6
  * @rmtoll PLL6CFGR4           DSMEN         LL_RCC_PLL6_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL6CFGR4, RCC_PLL6CFGR4_DSMEN);
}

/** @brief  Configure the PLL6 Clock Spreading Generator
  * @rmtoll PLL6CSGR    DIVVAL, SPREAD  LL_RCC_PLL6_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL6
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL6
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL6_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL6CFGR5, (RCC_PLL6CFGR5_DIVVAL | RCC_PLL6CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL6CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL6 VCO frequency divide level 1
  * @rmtoll PLL6CFGR6      POSTDIV1          LL_RCC_PLL6_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL6_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL6CFGR6, RCC_PLL6CFGR6_POSTDIV1, POSTDIV << RCC_PLL6CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR6      POSTDIV1          LL_RCC_PLL6_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL6CFGR6, RCC_PLL6CFGR6_POSTDIV1) >>  RCC_PLL6CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL6  reference input clock divide frequency ratio
  * @rmtoll PLL6CFGR7      POSTDIV2          LL_RCC_PLL6_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL6_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL6CFGR7, RCC_PLL6CFGR7_POSTDIV2, POSTDIV << RCC_PLL6CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL6 VCO multiplication factor
  * @rmtoll PLL6CFGR7      POSTDIV2          LL_RCC_PLL6_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL6_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL6CFGR7, RCC_PLL6CFGR7_POSTDIV2) >>  RCC_PLL6CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Set the oscillator used as PLL7 clock source.
  * @note   PLLSRC can be written only when all PLL7 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL3        LL_RCC_PLL7_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL7SOURCE_HSI
  *         @arg @ref LL_RCC_PLL7SOURCE_HSE
  *         @arg @ref LL_RCC_PLL7SOURCE_MSI
  *         @arg @ref LL_RCC_PLL7SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL3, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL7 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL3        LL_RCC_PLL7_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL7SOURCE_HSI
  *         @arg @ref LL_RCC_PLL7SOURCE_HSE
  *         @arg @ref LL_RCC_PLL7SOURCE_MSI
  *         @arg @ref LL_RCC_PLL7SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL3));
}

/**
  * @brief  Enable PLL7
  * @rmtoll PLL7CFGR1           PLLEN         LL_RCC_PLL7_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_Enable(void)
{
  SET_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL7
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL7 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL7CFGR1           PLLEN         LL_RCC_PLL7_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_Disable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_PLLEN);
}

/**
  * @brief  assert PLL7 Spread Spectrum Modulator reset
  * @rmtoll PLL7CFGR1           SSMODRST         LL_RCC_PLL7_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_SSMODRST);
}

/**
  * @brief  release PLL7 Spread Spectrum Modulator reset
  * @rmtoll PLL7CFGR1           SSMODRST         LL_RCC_PLL7_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL7 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL7CFGR1           SSMODRST        LL_RCC_PLL7_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_SSMODRST) == RCC_PLL7CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL7 Ready
  * @rmtoll PLL7CFGR1           PLL7RDY        LL_RCC_PLL7_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_IsReady(void)
{
  return ((READ_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_PLLRDY) == RCC_PLL7CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR1      CKREFST          LL_RCC_PLL7_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL7_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL7CFGR1, RCC_PLL7CFGR1_CKREFST, CKREFST << RCC_PLL7CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL7 reference clock is running
  * @rmtoll PLL7CFGR1           CKREFST        LL_RCC_PLL7_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL7CFGR1, RCC_PLL7CFGR1_CKREFST) == RCC_PLL7CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR2      FBDIV          LL_RCC_PLL7_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL7_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL7CFGR2, RCC_PLL7CFGR2_FBDIV, FBDIV << RCC_PLL7CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR2      FBDIV          LL_RCC_PLL7_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL7CFGR2, RCC_PLL7CFGR2_FBDIV) >>  RCC_PLL7CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL7  reference input clock divide frequency ratio
  * @rmtoll PLL7CFGR2      FREFDIV          LL_RCC_PLL7_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL7_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL7CFGR2, RCC_PLL7CFGR2_FREFDIV, FREFDIV << RCC_PLL7CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL7  reference input clock divide frequency ratio
  * @rmtoll PLL7CFGR2      FREFDIV          LL_RCC_PLL7_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL7CFGR2, RCC_PLL7CFGR2_FREFDIV) >>  RCC_PLL7CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR3      FRACIN          LL_RCC_PLL7_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL7_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL7CFGR3, RCC_PLL7CFGR3_FRACIN, FRACIN << RCC_PLL7CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR3      FRACIN          LL_RCC_PLL7_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_FRACIN) >>  RCC_PLL7CFGR3_FRACIN_Pos);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL7
  * @rmtoll PLL7CFGR3           SSCGDIS         LL_RCC_PLL7_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_SSCGDIS);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL7
  * @rmtoll PLL7CFGR3           SSCGDIS         LL_RCC_PLL7_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_CSG_Disable(void)
{
  SET_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL7Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL7CFGR3           SSCGDIS        LL_RCC_PLL7_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_SSCGDIS) == RCC_PLL7CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL7
  * @rmtoll PLL7CFGR3           DACEN         LL_RCC_PLL7DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL7
  * @rmtoll PLL7CFGR3           DACEN         LL_RCC_PLL7DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7DAC_Disable(void)
{
  SET_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DACEN);
}

/**
  * @brief  Check if PLL7 DAC is Enabled
  * @rmtoll PLL7CFGR3           DACEN        LL_RCC_PLL7_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DACEN) == RCC_PLL7CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL7
  * @rmtoll PLL7CFGR3           DOWNSPREAD         LL_RCC_PLL7DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL7
  * @rmtoll PLL7CFGR3           DOWNSPREAD         LL_RCC_PLL7DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL7 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL7CFGR4           BYPASS        LL_RCC_PLL7_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_BYPASS) == RCC_PLL7CFGR4_BYPASS) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL7
  * @rmtoll PLL7CFGR4           BYPASS         LL_RCC_PLL7_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL7
  * @rmtoll PLL7CFGR4           BYPASS         LL_RCC_PLL7_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL7  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL7CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL7_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_FOUTPOSTDIVEN) == RCC_PLL7CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL7
  * @rmtoll PLL7CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL7_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL7
  * @rmtoll PLL7CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL7_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL7 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL7CFGR4           DSMEN        LL_RCC_PLL7_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_DSMEN) == RCC_PLL7CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL7
  * @rmtoll PLL7CFGR4           DSMEN         LL_RCC_PLL7_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL7
  * @rmtoll PLL7CFGR4           DSMEN         LL_RCC_PLL7_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL7CFGR4, RCC_PLL7CFGR4_DSMEN);
}

/** @brief  Configure the PLL7 Clock Spreading Generator
  * @rmtoll PLL7CSGR    DIVVAL, SPREAD  LL_RCC_PLL7_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL7
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL7
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL7_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL7CFGR5, (RCC_PLL7CFGR5_DIVVAL | RCC_PLL7CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL7CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL7 VCO frequency divide level 1
  * @rmtoll PLL7CFGR6      POSTDIV1          LL_RCC_PLL7_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL7_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL7CFGR6, RCC_PLL7CFGR6_POSTDIV1, POSTDIV << RCC_PLL7CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR6      POSTDIV1          LL_RCC_PLL7_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL7CFGR6, RCC_PLL7CFGR6_POSTDIV1) >>  RCC_PLL7CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL7  reference input clock divide frequency ratio
  * @rmtoll PLL7CFGR7      POSTDIV2          LL_RCC_PLL7_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL7_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL7CFGR7, RCC_PLL7CFGR7_POSTDIV2, POSTDIV << RCC_PLL7CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL7 VCO multiplication factor
  * @rmtoll PLL7CFGR7      POSTDIV2          LL_RCC_PLL7_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL7_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL7CFGR7, RCC_PLL7CFGR7_POSTDIV2) >>  RCC_PLL7CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Set the oscillator used as PLL8 clock source.
  * @note   PLLSRC can be written only when all PLL8 is disabled.
  * @rmtoll MUXSELCFGR      MUXSEL4        LL_RCC_PLL8_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL8SOURCE_HSI
  *         @arg @ref LL_RCC_PLL8SOURCE_HSE
  *         @arg @ref LL_RCC_PLL8SOURCE_MSI
  *         @arg @ref LL_RCC_PLL8SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL4, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL8 clock source.
  * @rmtoll MUXSELCFGR      MUXSEL4        LL_RCC_PLL8_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL8SOURCE_HSI
  *         @arg @ref LL_RCC_PLL8SOURCE_HSE
  *         @arg @ref LL_RCC_PLL8SOURCE_MSI
  *         @arg @ref LL_RCC_PLL8SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MUXSELCFGR, RCC_MUXSELCFGR_MUXSEL4));
}

/**
  * @brief  Enable PLL8
  * @rmtoll PLL8CFGR1           PLLEN         LL_RCC_PLL8_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_Enable(void)
{
  SET_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_PLLEN);
}

/**
  * @brief  Disable PLL8
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL8 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL8CFGR1           PLLEN         LL_RCC_PLL8_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_Disable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_PLLEN);
}

/**
  * @brief  assert PLL8 Spread Spectrum Modulator reset
  * @rmtoll PLL8CFGR1           SSMODRST         LL_RCC_PLL8_SSMODRST_Assert
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_SSMODRST_Assert(void)
{
  SET_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_SSMODRST);
}

/**
  * @brief  release PLL8 Spread Spectrum Modulator reset
  * @rmtoll PLL8CFGR1           SSMODRST         LL_RCC_PLL8_SSMODRST_Release
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_SSMODRST_Release(void)
{
  CLEAR_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_SSMODRST);
}

/**
  * @brief  Check if PLL8 Spread Spectrum Modulator reset is asserted
  * @rmtoll PLL8CFGR1           SSMODRST        LL_RCC_PLL8_SSMODRST_IsAssert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_SSMODRST_IsAssert(void)
{
  return ((READ_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_SSMODRST) == RCC_PLL8CFGR1_SSMODRST) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL8 Ready
  * @rmtoll PLL8CFGR1           PLL8RDY        LL_RCC_PLL8_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_IsReady(void)
{
  return ((READ_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_PLLRDY) == RCC_PLL8CFGR1_PLLRDY) ? 1UL : 0UL);
}

/**
  * @brief  Set Fractional part of the PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR1      CKREFST          LL_RCC_PLL8_SetCKREFST
  * @param  CKREFST parameter can be a value between 0 and 1 (0x1)
  * 0: Reading 0 means that the PLL{x} reference clock is not running, writing 0 resets the
  * reference clock running detector.
  * 1: Reading 1 means that the PLL{x} reference clock is running, writing 1 resets the
  * reference clock running detector.
  */
__STATIC_INLINE void LL_RCC_PLL8_SetCKREFST(uint32_t CKREFST)
{
  MODIFY_REG(RCC->PLL8CFGR1, RCC_PLL8CFGR1_CKREFST, CKREFST << RCC_PLL8CFGR1_CKREFST_Pos);
}

/**
  * @brief  Check if PLL8 reference clock is running
  * @rmtoll PLL8CFGR1           CKREFST        LL_RCC_PLL8_CKREFST_IsRunning
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_CKREFST_IsRunning(void)
{
  return ((READ_BIT(RCC->PLL8CFGR1, RCC_PLL8CFGR1_CKREFST) == RCC_PLL8CFGR1_CKREFST) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR2      FBDIV          LL_RCC_PLL8_SetFBDIV
  * @param  FBDIV parameter can be a value between 0 and 4095 (0xFFF)
  */
__STATIC_INLINE void LL_RCC_PLL8_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(RCC->PLL8CFGR2, RCC_PLL8CFGR2_FBDIV, FBDIV << RCC_PLL8CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR2      FBDIV          LL_RCC_PLL8_GetFBDIV
  * @retval A value between 0 and 4095 (0x0FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_GetFBDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL8CFGR2, RCC_PLL8CFGR2_FBDIV) >>  RCC_PLL8CFGR2_FBDIV_Pos);
}

/**
  * @brief  Get PLL8  reference input clock divide frequency ratio
  * @rmtoll PLL8CFGR2      FREFDIV          LL_RCC_PLL8_SetFREFDIV
  * @param  FREFDIV parameter can be a value between 0 and 63 (0x3F)
  */
__STATIC_INLINE void LL_RCC_PLL8_SetFREFDIV(uint32_t FREFDIV)
{
  MODIFY_REG(RCC->PLL8CFGR2, RCC_PLL8CFGR2_FREFDIV, FREFDIV << RCC_PLL8CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Get PLL8  reference input clock divide frequency ratio
  * @rmtoll PLL8CFGR2      FREFDIV          LL_RCC_PLL8_GetFREFDIV
  * @retval A value between 0 and 63 (0x3F)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_GetFREFDIV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL8CFGR2, RCC_PLL8CFGR2_FREFDIV) >>  RCC_PLL8CFGR2_FREFDIV_Pos);
}

/**
  * @brief  Set Fractional part of the PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR3      FRACIN          LL_RCC_PLL8_SetFRACIN
  * @param  FRACIN parameter can be a value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL8_SetFRACIN(uint32_t FRACIN)
{
  MODIFY_REG(RCC->PLL8CFGR3, RCC_PLL8CFGR3_FRACIN, FRACIN << RCC_PLL8CFGR3_FRACIN_Pos);
}

/**
  * @brief  Get Fractional part of the PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR3      FRACIN          LL_RCC_PLL8_GetFRACIN
  * @retval A value between 0 and 8388607 (0x7FFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_GetFRACIN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_FRACIN) >>  RCC_PLL8CFGR3_FRACIN_Pos);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL8
  * @rmtoll PLL8CFGR3           SSCGDIS         LL_RCC_PLL8_CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_CSG_Enable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_SSCGDIS);
}

