zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Disable the Spread Spectrum Modulator of PLL8
  * @rmtoll PLL8CFGR3           SSCGDIS         LL_RCC_PLL8_CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_CSG_Disable(void)
{
  SET_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_SSCGDIS);
}

/**
  * @brief  Check if PLL8Spread Spectrum Modulator  is Enabled
  * @rmtoll PLL8CFGR3           SSCGDIS        LL_RCC_PLL8_CSG_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_CSG_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_SSCGDIS) == RCC_PLL8CFGR3_SSCGDIS) ? 0UL : 1UL);
}

/**
  * @brief  Enable the Spread Spectrum Modulator of PLL8
  * @rmtoll PLL8CFGR3           DACEN         LL_RCC_PLL8DAC_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8DAC_Enable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DACEN);
}

/**
  * @brief  Disable the Spread Spectrum Modulator of PLL8
  * @rmtoll PLL8CFGR3           DACEN         LL_RCC_PLL8DAC_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8DAC_Disable(void)
{
  SET_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DACEN);
}

/**
  * @brief  Check if PLL8 DAC is Enabled
  * @rmtoll PLL8CFGR3           DACEN        LL_RCC_PLL8_DAC_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_DAC_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DACEN) == RCC_PLL8CFGR3_DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Down-spread modulation of PLL8
  * @rmtoll PLL8CFGR3           DOWNSPREAD         LL_RCC_PLL8DOWNSPREAD_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8DOWNSPREAD_Enable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DOWNSPREAD);
}

/**
  * @brief  Enable Center-spread modulation of PLL8
  * @rmtoll PLL8CFGR3           DOWNSPREAD         LL_RCC_PLL8DOWNSPREAD_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8DOWNSPREAD_Disable(void)
{
  SET_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DOWNSPREAD);
}

/**
  * @brief  Check if PLL8 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL8CFGR4           BYPASS        LL_RCC_PLL8_FOUTPOSTDIV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_FOUTPOSTDIV_FREF_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_BYPASS) == RCC_PLL8CFGR4_BYPASS) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL8
  * @rmtoll PLL8CFGR4           BYPASS         LL_RCC_PLL8_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_FOUTPOSTDIV_FREF_Enable(void)
{
  SET_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_BYPASS);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL8
  * @rmtoll PLL8CFGR4           BYPASS         LL_RCC_PLL8_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_FOUTPOSTDIV_FREF_Disable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_BYPASS);
}

/**
  * @brief  Check if PLL8  POSTDIV1 and POSTDIV2 dividers are active
  * @rmtoll PLL8CFGR4           FOUTPOSTDIVEN        LL_RCC_PLL8_FOUTPOSTDIVEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_FOUTPOSTDIVEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_FOUTPOSTDIVEN) == RCC_PLL8CFGR4_FOUTPOSTDIVEN) ? 1UL : 0UL);
}

/**
  * @brief   activate POSTDIV1 and POSTDIV2 on PLL8
  * @rmtoll PLL8CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL8_FOUTPOSTDIV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_FOUTPOSTDIV_Enable(void)
{
  SET_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  disactivate POSTDIV1 and POSTDIV2 on PLL8
  * @rmtoll PLL8CFGR4           FOUTPOSTDIVEN         LL_RCC_PLL8_FOUTPOSTDIV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_FOUTPOSTDIV_Disable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_FOUTPOSTDIVEN);
}

/**
  * @brief  Check if PLL8 FOUTPOSTDIV is driven by FREF
  * @rmtoll PLL8CFGR4           DSMEN        LL_RCC_PLL8_DSMEN_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_DSMEN_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_DSMEN) == RCC_PLL8CFGR4_DSMEN) ? 1UL : 0UL);
}

/**
  * @brief  FOUTPOSTDIV is driven by FREF on PLL8
  * @rmtoll PLL8CFGR4           DSMEN         LL_RCC_PLL8_DSMEN_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_DSMEN_Enable(void)
{
  SET_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_DSMEN);
}

/**
  * @brief  FOUTPOSTDIV is driven by POSTDIV2 on PLL8
  * @rmtoll PLL8CFGR4           DSMEN         LL_RCC_PLL8_DSMEN_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_DSMEN_Disable(void)
{
  CLEAR_BIT(RCC->PLL8CFGR4, RCC_PLL8CFGR4_DSMEN);
}

/** @brief  Configure the PLL8 Clock Spreading Generator
  * @rmtoll PLL8CSGR    DIVVAL, SPREAD  LL_RCC_PLL8_ConfigCSG
  *
  * @param  ModFreq:  Modulation frequency adjustment for PLL8
  *         This parameter must have a value between 0 and 15
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL8
  *         This parameter must have a value between 0 and 31
  * @note   ModFreq x IncStep shall not exceed (2^4)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL8_ConfigCSG(uint32_t ModFreq, uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL8CFGR5, (RCC_PLL8CFGR5_DIVVAL | RCC_PLL8CFGR5_SPREAD), \
             (ModFreq | (IncStep << RCC_PLL8CFGR5_SPREAD_Pos)));
}

/**
  * @brief  Get  PLL8 VCO frequency divide level 1
  * @rmtoll PLL8CFGR6      POSTDIV1          LL_RCC_PLL8_ConfigFREQDIV_L1
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL8_ConfigFREQDIV_L1(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL8CFGR6, RCC_PLL8CFGR6_POSTDIV1, POSTDIV << RCC_PLL8CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get Fractional part of the PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR6      POSTDIV1          LL_RCC_PLL8_GetFREQDIV_L1
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_GetFREQDIV_L1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL8CFGR6, RCC_PLL8CFGR6_POSTDIV1) >>  RCC_PLL8CFGR6_POSTDIV1_Pos);
}

/**
  * @brief  Get PLL8  reference input clock divide frequency ratio
  * @rmtoll PLL8CFGR7      POSTDIV2          LL_RCC_PLL8_ConfigFREQDIV_L2
  * @param  POSTDIV parameter can be a value between 0 and 15 (0xF)
  */
__STATIC_INLINE void LL_RCC_PLL8_ConfigFREQDIV_L2(uint32_t POSTDIV)
{
  MODIFY_REG(RCC->PLL8CFGR7, RCC_PLL8CFGR7_POSTDIV2, POSTDIV << RCC_PLL8CFGR7_POSTDIV2_Pos);
}

/**
  * @brief  Get Fractional part of the PLL8 VCO multiplication factor
  * @rmtoll PLL8CFGR7      POSTDIV2          LL_RCC_PLL8_GetFREQDIV_L2
  * @retval A value between 0 and 15 (0xF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL8_GetFREQDIV_L2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL8CFGR7, RCC_PLL8CFGR7_POSTDIV2) >>  RCC_PLL8CFGR7_POSTDIV2_Pos);
}


