zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#if defined(CORE_CA35)
__STATIC_INLINE void LL_CA35SS_SetCA35SSClockSourceExt(void)
{
  /* Set A35 source clock to external ck_cpu1_ext2f */
  CA35SSC->CHGCLKREQ_WS1 = CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ;
}

__STATIC_INLINE void LL_CA35SS_SetCA35SSClockSourcePLL1(void)
{
  /* Set A35 source clock to internal PLL */
  CA35SSC->CHGCLKREQ_WC1 = CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ;
}

/**
  * @brief  Enable PLL1
  * @rmtoll
  * @retval None
  */
__STATIC_INLINE void LL_CA35SS_PLL1_Enable(void)
{
  CA35SSC->PLL_ENABLE_WS1 = CA35SSC_PLL_ENABLE_WS1_PLL_EN;
}

/**
  * @brief  Disable PLL1
  * @rmtoll
  * @retval None
  */
__STATIC_INLINE void LL_CA35SS_PLL1_Disable(void)
{
  CA35SSC->PLL_ENABLE_WC1 = CA35SSC_PLL_ENABLE_WC1_PLL_EN;
}

/**
  * @brief  Reset PLL1 output path
  * @rmtoll
  * @retval None
  */
__STATIC_INLINE void LL_CA35SS_PLL1_Reset_output(void)
{
  CA35SSC->PLL_ENABLE_WC1 = CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL;
}

/**
  * @brief  Set PLL1 output path
  * @rmtoll
  * @retval None
  */
__STATIC_INLINE void LL_CA35SS_PLL1_Set_output(void)
{
  CA35SSC->PLL_ENABLE_WS1 = CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL;
}

/**
  * @brief  Check if PLL1 Ready
  * @rmtoll
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_CA35SS_PLL1_IsReady(void)
{
  return ((CA35SSC->PLL_ENABLE_RW & CA35SSC_PLL_ENABLE_RW_LOCKP) != CA35SSC_PLL_ENABLE_RW_LOCKP);
}

/**
  * @brief  Set PLL1 VCO multiplication factor
  * @rmtoll
  * @param
  */
__STATIC_INLINE void LL_CA35SS_PLL1_SetFBDIV(uint32_t FBDIV)
{
  MODIFY_REG(CA35SSC->PLL_FREQ1_RW, CA35SSC_PLL_FREQ1_RW_FBDIV, FBDIV << CA35SSC_PLL_FREQ1_RW_FBDIV_Pos);
}

/**
  * @brief  Set PLL1 reference input clock divide frequency ratio
  * @rmtoll
  * @param
  */
__STATIC_INLINE void LL_CA35SS_PLL1_SetFREFDIV(uint32_t REFDIV)
{
  MODIFY_REG(CA35SSC->PLL_FREQ1_RW, CA35SSC_PLL_FREQ1_RW_REFDIV, REFDIV << CA35SSC_PLL_FREQ1_RW_REFDIV_Pos);
}

/**
  * @brief  Set PLL1 post divider 1
  * @rmtoll
  * @param
  */
__STATIC_INLINE void LL_CA35SS_PLL1_SetPostDiv1(uint32_t POSTDIV1)
{
  MODIFY_REG(CA35SSC->PLL_FREQ2_RW, CA35SSC_PLL_FREQ2_RW_POSTDIV1, POSTDIV1 << CA35SSC_PLL_FREQ2_RW_POSTDIV1_Pos);
}

/**
  * @brief  Set PLL1 post divider 2
  * @rmtoll
  * @param
  */
__STATIC_INLINE void LL_CA35SS_PLL1_SetPostDiv2(uint32_t POSTDIV2)
{
  MODIFY_REG(CA35SSC->PLL_FREQ2_RW, CA35SSC_PLL_FREQ2_RW_POSTDIV2, POSTDIV2 << CA35SSC_PLL_FREQ2_RW_POSTDIV2_Pos);
}
#endif /* CORE_CA35 */

/**
  * @}
  */

/** @defgroup RCC_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Clear LSI ready interrupt flag
  * @rmtoll C2CIFCLRR      LSIRDYF      LL_RCC_ClearFlag_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSIRDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_LSIRDYF);
}

/**
  * @brief  Clear LSE ready interrupt flag
  * @rmtoll C2CIFCLRR      LSERDYF       LL_RCC_ClearFlag_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSERDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_LSERDYF);
}

/**
  * @brief  Clear HSI ready interrupt flag
  * @rmtoll C2CIFCLRR      HSIRDYF       LL_RCC_ClearFlag_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSIRDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_HSIRDYF);
}

/**
  * @brief  Clear HSE ready interrupt flag
  * @rmtoll CICR         HSERDYF       LL_RCC_ClearFlag_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSERDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_HSERDYF);
}

/**
  * @brief  Clear MSI ready interrupt flag
  * @rmtoll C2CIFCLRR      MSIRDYF       LL_RCC_ClearFlag_MSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_MSIRDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_MSIRDYF);
}

/**
  * @brief  Clear PLL1 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL1DYF       LL_RCC_ClearFlag_PLL1RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL1RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL1RDYF);
}

/**
  * @brief  Clear PLL2 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL2DYF       LL_RCC_ClearFlag_PLL2RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL2RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL2RDYF);
}

#if defined(RCC_C2CIFCLRR_PLL3RDYF)
/**
  * @brief  Clear PLL3 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL3DYF       LL_RCC_ClearFlag_PLL3RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL3RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL3RDYF);
}
#endif /* RCC_C2CIFCLRR_PLL3RDYF */

/**
  * @brief  Clear PLL4 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL4DYF       LL_RCC_ClearFlag_PLL4RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL4RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL4RDYF);
}

/**
  * @brief  Clear PLL4 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL5DYF       LL_RCC_ClearFlag_PLL5RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL5RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL5RDYF);
}

/**
  * @brief  Clear PLL6 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL6DYF       LL_RCC_ClearFlag_PLL6RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL6RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL6RDYF);
}

/**
  * @brief  Clear PLL7 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL7DYF       LL_RCC_ClearFlag_PLL7RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL7RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL7RDYF);
}

/**
  * @brief  Clear PLL8 ready interrupt flag
  * @rmtoll C2CIFCLRR      PLL8DYF       LL_RCC_ClearFlag_PLL8RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_PLL8RDY(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL8RDYF);
}

/**
  * @brief  Clear LSE Clock security system interrupt flag
  * @rmtoll C2CIFCLRR      LSECSSF       LL_RCC_ClearFlag_LSECSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSECSS(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_LSECSSF);
}

/**
  * @brief  Clear WKUP Wake up from CStop interrupt flag
  * @rmtoll C2CIFCLRR      WKUPF       LL_RCC_ClearFlag_WKUP
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_WKUP(void)
{
  WRITE_REG(RCC->C2CIFCLRR, RCC_C2CIFCLRR_WKUPF);
}

/**
  * @brief  Check if LSI ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      LSIRDYF       LL_RCC_IsActiveFlag_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSIRDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_LSIRDYF) == (RCC_C2CIFCLRR_LSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      LSERDYF       LL_RCC_IsActiveFlag_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSERDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_LSERDYF) == (RCC_C2CIFCLRR_LSERDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSI ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      HSIRDYF       LL_RCC_IsActiveFlag_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSIRDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_HSIRDYF) == (RCC_C2CIFCLRR_HSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSE ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      HSERDYF       LL_RCC_IsActiveFlag_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSERDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_HSERDYF) == (RCC_C2CIFCLRR_HSERDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if MSI ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      MSIRDYF       LL_RCC_IsActiveFlag_MSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_MSIRDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_MSIRDYF) == (RCC_C2CIFCLRR_MSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL1 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL1DYF       LL_RCC_IsActiveFlag_PLL1RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL1RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL1RDYF) == (RCC_C2CIFCLRR_PLL1RDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL2 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL2DYF       LL_RCC_IsActiveFlag_PLL2RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL2RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL2RDYF) == (RCC_C2CIFCLRR_PLL2RDYF)) ? 1UL : 0UL);
}

#if defined(RCC_C2CIFCLRR_PLL3RDYF)
/**
  * @brief  Check if PLL3 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL3DYF       LL_RCC_IsActiveFlag_PLL3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL3RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL3RDYF) == (RCC_C2CIFCLRR_PLL3RDYF)) ? 1UL : 0UL);
}
#endif /* RCC_C2CIFCLRR_PLL3RDYF */

/**
  * @brief  Check if PLL4 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL4DYF       LL_RCC_IsActiveFlag_PLL4RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL4RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL4RDYF) == (RCC_C2CIFCLRR_PLL4RDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL5 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL5DYF       LL_RCC_IsActiveFlag_PLL5RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL5RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL5RDYF) == (RCC_C2CIFCLRR_PLL5RDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL6 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL6DYF       LL_RCC_IsActiveFlag_PLL6RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL6RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL6RDYF) == (RCC_C2CIFCLRR_PLL6RDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL7 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL7DYF       LL_RCC_IsActiveFlag_PLL7RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL7RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL7RDYF) == (RCC_C2CIFCLRR_PLL7RDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL8 ready interrupt occurred or not
  * @rmtoll C2CIFCLRR      PLL8DYF       LL_RCC_IsActiveFlag_PLL8RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PLL8RDY(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_PLL8RDYF) == (RCC_C2CIFCLRR_PLL8RDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE Clock security system interrupt occurred or not
  * @rmtoll C2CIFCLRR      LSECSSF       LL_RCC_IsActiveFlag_LSECSS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSECSS(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_LSECSSF) == (RCC_C2CIFCLRR_LSECSSF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if Wake up from CStop interrupt occurred or not
  * @rmtoll C2CIFCLRR      WKUPF       LL_RCC_IsActiveFlag_WKUP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WKUP(void)
{
  return ((READ_BIT(RCC->C2CIFCLRR, RCC_C2CIFCLRR_WKUPF) == (RCC_C2CIFCLRR_WKUPF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Window Watchdog 1 reset is set or not.
  * @rmtoll HWRSTSCLRR          IWDG3SYSRSTF      LL_RCC_IsActiveFlag_IWDG3SYSRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_IWDG3SYSRST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_IWDG3SYSRSTF) == (RCC_HWRSTSCLRR_IWDG3SYSRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Independent Watchdog 2 reset is set or not.
  * @rmtoll HWRSTSCLRR   IWDG2SYSRSTF      LL_RCC_IsActiveFlag_IWDG2RST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_IWDG2RST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_IWDG2SYSRSTF) == (RCC_HWRSTSCLRR_IWDG2SYSRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Independent Watchdog 1 reset is set or not.
  * @rmtoll HWRSTSCLRR   WDG1SYSRSTF      LL_RCC_IsActiveFlag_IWDG1RST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_IWDG1RST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_IWDG1SYSRSTF) == (RCC_HWRSTSCLRR_IWDG1SYSRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag MCU System reset is set or not.
  * @rmtoll HWRSTSCLRR   SYSC2RSTF      LL_RCC_IsActiveFlag_MCSYSRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_SYSC2RST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_SYSC2RSTF) == (RCC_HWRSTSCLRR_SYSC2RSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag MPU System reset is set or not.
  * @rmtoll HWRSTSCLRR   SYSC1RSTF      LL_RCC_IsActiveFlag_MPSYSRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_SYSC1RST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_SYSC1RSTF) == (RCC_HWRSTSCLRR_SYSC1RSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag MCU reset is set or not.
  * @rmtoll HWRSTSCLRR   VCPURSTF      LL_RCC_IsActiveFlag_MCURST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_MCURST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_C1HWRSTSCLRR_VCPURSTF) == (RCC_C1HWRSTSCLRR_VCPURSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag VDDCORE reset is set or not.
  * @rmtoll HWRSTSCLRR   VCORERSTF      LL_RCC_IsActiveFlag_VCORERST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_VCORERST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_VCORERSTF) == (RCC_HWRSTSCLRR_VCORERSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag HSE CSS reset is set or not.
  * @rmtoll HWRSTSCLRR   HCSSRSTF      LL_RCC_IsActiveFlag_HCSSRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HCSSRST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_HCSSRSTF) == (RCC_HWRSTSCLRR_HCSSRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag NRST (PAD) reset is set or not.
  * @rmtoll HWRSTSCLRR   PADRSTF      LL_RCC_IsActiveFlag_PADRSTF
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PADRST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_PADRSTF) == (RCC_HWRSTSCLRR_PADRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag BOR reset is set or not.
  * @rmtoll HWRSTSCLRR   BORRSTF      LL_RCC_IsActiveFlag_BORRSTF
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_BORRST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_BORRSTF) == (RCC_HWRSTSCLRR_BORRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag POR/PDR reset is set or not.
  * @rmtoll HWRSTSCLRR   PORRSTF      LL_RCC_IsActiveFlag_PORRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PORRST(void)
{
  return ((READ_BIT(RCC->HWRSTSCLRR, RCC_HWRSTSCLRR_PORRSTF) == (RCC_HWRSTSCLRR_PORRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Set HWRSTSCLRR bits to clear the reset flags.
  * @rmtoll HWRSTSCLRR      LL_RCC_HWRSTSCLRR_ALL       LL_RCC_ClearResetFlags
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearResetFlags(void)
{
  WRITE_REG(RCC->HWRSTSCLRR, LL_RCC_HWRSTSCLRR_ALL);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable LSI ready interrupt
  * @rmtoll C2CIESETR      LSIRDYIE      LL_RCC_EnableIT_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSIRDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSIRDYIE);
}

/**
  * @brief  Enable LSE ready interrupt
  * @rmtoll C2CIESETR      LSERDYIE      LL_RCC_EnableIT_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSERDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSERDYIE);
}

/**
  * @brief  Enable HSI ready interrupt
  * @rmtoll C2CIESETR      HSIRDYIE      LL_RCC_EnableIT_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSIRDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_HSIRDYIE);
}

/**
  * @brief  Enable HSE ready interrupt
  * @rmtoll C2CIESETR      HSERDYIE      LL_RCC_EnableIT_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSERDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_HSERDYIE);
}

/**
  * @brief  Enable MSI ready interrupt
  * @rmtoll C2CIESETR      MSIRDYIE      LL_RCC_EnableIT_MSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_MSIRDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_MSIRDYIE);
}

/**
  * @brief  Enable PLL1 ready interrupt
  * @rmtoll C2CIESETR      PLLR1DYIE      LL_RCC_EnableIT_PLL1RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL1RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL1RDYIE);
}

/**
  * @brief  Enable PLL2 ready interrupt
  * @rmtoll C2CIESETR      PLLR2DYIE      LL_RCC_EnableIT_PLL2RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL2RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL2RDYIE);
}

#if defined(RCC_C2CIESETR_PLL3RDYIE)
/**
  * @brief  Enable PLL3 ready interrupt
  * @rmtoll C2CIESETR      PLLR3DYIE      LL_RCC_EnableIT_PLL3RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL3RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL3RDYIE);
}
#endif /* RCC_C2CIESETR_PLL3RDYIE */

/**
  * @brief  Enable PLL4 ready interrupt
  * @rmtoll C2CIESETR      PLLR3DYIE      LL_RCC_EnableIT_PLL4RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL4RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL4RDYIE);
}

/**
  * @brief  Enable PLL5 ready interrupt
  * @rmtoll C2CIESETR      PLLR5DYIE      LL_RCC_EnableIT_PLL5RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL5RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL5RDYIE);
}

/**
  * @brief  Enable PLL6 ready interrupt
  * @rmtoll C2CIESETR      PLLR6DYIE      LL_RCC_EnableIT_PLL6RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL6RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL6RDYIE);
}

/**
  * @brief  Enable PLL7 ready interrupt
  * @rmtoll C2CIESETR      PLLR7DYIE      LL_RCC_EnableIT_PLL7RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL7RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL7RDYIE);
}

/**
  * @brief  Enable PLL8 ready interrupt
  * @rmtoll C2CIESETR      PLLR8DYIE      LL_RCC_EnableIT_PLL8RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_PLL8RDY(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL8RDYIE);
}

/**
  * @brief  Enable LSE clock security system interrupt
  * @rmtoll C2CIESETR      LSECSSIE      LL_RCC_EnableIT_LSECSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSECSS(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSECSSIE);
}

/**
  * @brief  Enable Wake up from CStop interrupt
  * @rmtoll C2CIESETR      WKUPIE      LL_RCC_EnableIT_WKUP
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_WKUP(void)
{
  SET_BIT(RCC->C2CIESETR, RCC_C2CIESETR_WKUPIE);
}

/**
  * @brief  Disable LSI ready interrupt
  * @rmtoll C2CIESETR      LSIRDYIE      LL_RCC_DisableIT_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSIRDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSIRDYIE);
}

/**
  * @brief  Disable LSE ready interrupt
  * @rmtoll C2CIESETR      LSERDYIE      LL_RCC_DisableIT_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSERDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSERDYIE);
}

/**
  * @brief  Disable HSI ready interrupt
  * @rmtoll C2CIESETR      HSIRDYIE      LL_RCC_DisableIT_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSIRDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_HSIRDYIE);
}

/**
  * @brief  Disable HSE ready interrupt
  * @rmtoll C2CIESETR      HSERDYIE      LL_RCC_DisableIT_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSERDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_HSERDYIE);
}

/**
  * @brief  Disable MSI ready interrupt
  * @rmtoll C2CIESETR      MSIRDYIE      LL_RCC_DisableIT_MSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_MSIRDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_MSIRDYIE);
}

/**
  * @brief  Disable PLL1 ready interrupt
  * @rmtoll C2CIESETR      PLLR1DYIE      LL_RCC_DisableIT_PLL1RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL1RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL1RDYIE);
}

/**
  * @brief  Disable PLL2 ready interrupt
  * @rmtoll C2CIESETR      PLLR2DYIE      LL_RCC_DisableIT_PLL2RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL2RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL2RDYIE);
}

#if defined(RCC_C2CIESETR_PLL3RDYIE)
/**
  * @brief  Disable PLL3 ready interrupt
  * @rmtoll C2CIESETR      PLLR3DYIE      LL_RCC_DisableIT_PLL3RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL3RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL3RDYIE);
}
#endif /* RCC_C2CIESETR_PLL3RDYIE */

/**
  * @brief  Disable PLL4 ready interrupt
  * @rmtoll C2CIESETR      PLLR4DYIE      LL_RCC_DisableIT_PLL4RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL4RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL4RDYIE);
}

/**
  * @brief  Disable PLL5 ready interrupt
  * @rmtoll C2CIESETR      PLLR5DYIE      LL_RCC_DisableIT_PLL5RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL5RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL5RDYIE);
}

/**
  * @brief  Disable PLL6 ready interrupt
  * @rmtoll C2CIESETR      PLLR6DYIE      LL_RCC_DisableIT_PLL6RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL6RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL6RDYIE);
}

/**
  * @brief  Disable PLL7 ready interrupt
  * @rmtoll C2CIESETR      PLLR7DYIE      LL_RCC_DisableIT_PLL7RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL7RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL7RDYIE);
}

/**
  * @brief  Disable PLL8 ready interrupt
  * @rmtoll C2CIESETR      PLLR8DYIE      LL_RCC_DisableIT_PLL8RDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_PLL8RDY(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL8RDYIE);
}

/**
  * @brief  Disable LSE clock security system interrupt
  * @rmtoll C2CIESETR      LSECSSIE      LL_RCC_DisableIT_LSECSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSECSS(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSECSSIE);
}

/**
  * @brief  Disable Wake up from CStop interrupt
  * @rmtoll C2CIESETR      WKUPIE      LL_RCC_DisableIT_WKUP
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_WKUP(void)
{
  CLEAR_BIT(RCC->C2CIESETR, RCC_C2CIESETR_WKUPIE);
}

/**
  * @brief  Checks if LSI ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      LSIRDYIE      LL_RCC_IsEnabledIT_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSIRDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSIRDYIE) == (RCC_C2CIESETR_LSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if LSE ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      LSERDYIE      LL_RCC_IsEnabledIT_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSERDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSERDYIE) == (RCC_C2CIESETR_LSERDYIE)) ? 1UL : 0UL);
}

