zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/**
  * @brief  Checks if HSI ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      HSIRDYIE      LL_RCC_IsEnabledIT_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSIRDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_HSIRDYIE) == (RCC_C2CIESETR_HSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if HSE ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      HSERDYIE      LL_RCC_IsEnabledIT_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSERDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_HSERDYIE) == (RCC_C2CIESETR_HSERDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if MSI ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      MSIRDYIE      LL_RCC_IsEnabledIT_MSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_MSIRDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_MSIRDYIE) == (RCC_C2CIESETR_MSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if PLL1 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL1DYIE      LL_RCC_IsEnabledIT_PLL1RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL1RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL1RDYIE) == (RCC_C2CIESETR_PLL1RDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if PLL2 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL2DYIE      LL_RCC_IsEnabledIT_PLL2RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL2RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL2RDYIE) == (RCC_C2CIESETR_PLL2RDYIE)) ? 1UL : 0UL);
}

#if defined(RCC_C2CIESETR_PLL3RDYIE)
/**
  * @brief  Checks if PLL3 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL3DYIE      LL_RCC_IsEnabledIT_PLL3RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL3RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL3RDYIE) == (RCC_C2CIESETR_PLL3RDYIE)) ? 1UL : 0UL);
}
#endif /* RCC_C2CIESETR_PLL3RDYIE */

/**
  * @brief  Checks if PLL4 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL4DYIE      LL_RCC_IsEnabledIT_PLL4RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL4RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL4RDYIE) == (RCC_C2CIESETR_PLL4RDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if PLL5 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL5DYIE      LL_RCC_IsEnabledIT_PLL5RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL5RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL5RDYIE) == (RCC_C2CIESETR_PLL5RDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if PLL6 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL6DYIE      LL_RCC_IsEnabledIT_PLL6RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL6RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL6RDYIE) == (RCC_C2CIESETR_PLL6RDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if PLL7 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL7DYIE      LL_RCC_IsEnabledIT_PLL7RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL7RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL7RDYIE) == (RCC_C2CIESETR_PLL7RDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if PLL8 ready interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      PLL8DYIE      LL_RCC_IsEnabledIT_PLL8RDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_PLL8RDY(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_PLL8RDYIE) == (RCC_C2CIESETR_PLL8RDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if LSECSS interrupt source is enabled or disabled.
  * @rmtoll C2CIESETR      LSECSSIE      LL_RCC_IsEnabledIT_LSECSS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSECSS(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_LSECSSIE) == (RCC_C2CIESETR_LSECSSIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if Wake up from CStop source is enabled or disabled.
  * @rmtoll C2CIESETR      WKUPIE      LL_RCC_IsEnabledIT_LSECSS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_WKUP(void)
{
  return ((READ_BIT(RCC->C2CIESETR, RCC_C2CIESETR_WKUPIE) == (RCC_C2CIESETR_WKUPIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EF_Init De-initialization function
  * @{
  */
ErrorStatus LL_RCC_DeInit(void);
/**
  * @}
  */

/** @defgroup RCC_LL_EF_Get_Freq Get system and peripherals clocks frequency functions
  * @{
  */
void        LL_RCC_GetPLL2ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
#if defined(RCC_PLL3CFGR1_PLLEN)
void        LL_RCC_GetPLL3ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
#endif /* RCC_PLL3CFGR1_PLLEN */
void        LL_RCC_GetPLL4ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
void        LL_RCC_GetPLL5ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
void        LL_RCC_GetPLL6ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
void        LL_RCC_GetPLL7ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
void        LL_RCC_GetPLL8ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks);
void        LL_RCC_GetSystemClocksFreq(LL_RCC_ClocksTypeDef *RCC_Clocks);

uint32_t    LL_RCC_GetI2CClockFreq(uint32_t I2CxSource);
uint32_t    LL_RCC_GetSAIClockFreq(uint32_t SAIxSource);
uint32_t    LL_RCC_GetSPIClockFreq(uint32_t SPIxSource);
uint32_t    LL_RCC_GetUARTClockFreq(uint32_t UARTxSource);
uint32_t    LL_RCC_GetSDMMCClockFreq(uint32_t SDMMCxSource);
uint32_t    LL_RCC_GetETHClockFreq(uint32_t ETHxSource);
uint32_t    LL_RCC_GetOSPIClockFreq(uint32_t OSPIxSource);
uint32_t    LL_RCC_GetFMCClockFreq(uint32_t FMCxSource);
#if defined(FDCAN1)
uint32_t    LL_RCC_GetFDCANClockFreq(uint32_t FDCANxSource);
#endif /*FDCAN1*/
uint32_t    LL_RCC_GetSPDIFRXClockFreq(uint32_t SPDIFRXxSource);
uint32_t    LL_RCC_GetCECClockFreq(uint32_t CECxSource);
uint32_t    LL_RCC_GetUSBPHYClockFreq(uint32_t USBPHYxSource);
uint32_t    LL_RCC_GetUSBOClockFreq(uint32_t USBOxSource);
uint32_t    LL_RCC_GetRNGClockFreq(uint32_t RNGxSource);
uint32_t    LL_RCC_GetCKPERClockFreq(uint32_t CKPERxSource);
uint32_t    LL_RCC_GetSTGENClockFreq(uint32_t STGENxSource);
#if defined(DSI)
uint32_t    LL_RCC_GetDSIClockFreq(uint32_t DSIxSource);
#endif /*DSI*/
uint32_t    LL_RCC_GetADCClockFreq(uint32_t ADCxSource);
uint32_t    LL_RCC_GetLPTIMClockFreq(uint32_t LPTIMxSource);
uint32_t    LL_RCC_GetDFSDMClockFreq(uint32_t DFSDMxSource);
uint32_t    LL_RCC_GetLTDCClockFreq(void);
uint32_t    LL_RCC_GetRTCClockFreq(void);
uint32_t    LL_RCC_GetTIMGClockFreq(uint32_t TIMGxPrescaler);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */
/* End of RCC_LL_Exported_Functions */

#endif /* RCC */

/***** MP2 RIF SPECIFIC : TO BE MERGED TO DIFFERENT "defgroup" HERE ABOVE *****/
/** @defgroup RCC_RIF_LL RCC_RIF
  * @{
  */

