zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_RIF_Exported_Constants RCC LL RIF Exported Constants
  * @{
  */

/** @defgroup RCC_LL_EC_RIF_LOCALRES RCC LL RIF Local Resource Index
  * @{
  */
#define RCC_LOCALRES_0       0UL /*!< RIF Local Resource Index   0 */
#define RCC_LOCALRES_1       1UL /*!< RIF Local Resource Index   1 */
#define RCC_LOCALRES_2       2UL /*!< RIF Local Resource Index   2 */
#define RCC_LOCALRES_3       3UL /*!< RIF Local Resource Index   3 */
#define RCC_LOCALRES_4       4UL /*!< RIF Local Resource Index   4 */
#define RCC_LOCALRES_5       5UL /*!< RIF Local Resource Index   5 */
#define RCC_LOCALRES_6       6UL /*!< RIF Local Resource Index   6 */
#define RCC_LOCALRES_7       7UL /*!< RIF Local Resource Index   7 */
#define RCC_LOCALRES_8       8UL /*!< RIF Local Resource Index   8 */
#define RCC_LOCALRES_9       9UL /*!< RIF Local Resource Index   9 */
#define RCC_LOCALRES_10     10UL /*!< RIF Local Resource Index  10 */
#define RCC_LOCALRES_11     11UL /*!< RIF Local Resource Index  11 */
#define RCC_LOCALRES_12     12UL /*!< RIF Local Resource Index  12 */
#define RCC_LOCALRES_13     13UL /*!< RIF Local Resource Index  13 */
#define RCC_LOCALRES_14     14UL /*!< RIF Local Resource Index  14 */
#define RCC_LOCALRES_15     15UL /*!< RIF Local Resource Index  15 */
#define RCC_LOCALRES_16     16UL /*!< RIF Local Resource Index  16 */
#define RCC_LOCALRES_17     17UL /*!< RIF Local Resource Index  17 */
#define RCC_LOCALRES_18     18UL /*!< RIF Local Resource Index  18 */
#define RCC_LOCALRES_19     19UL /*!< RIF Local Resource Index  19 */
#define RCC_LOCALRES_20     20UL /*!< RIF Local Resource Index  20 */
#define RCC_LOCALRES_21     21UL /*!< RIF Local Resource Index  21 */
#define RCC_LOCALRES_22     22UL /*!< RIF Local Resource Index  22 */
#define RCC_LOCALRES_23     23UL /*!< RIF Local Resource Index  23 */
#define RCC_LOCALRES_24     24UL /*!< RIF Local Resource Index  24 */
#define RCC_LOCALRES_25     25UL /*!< RIF Local Resource Index  25 */
#define RCC_LOCALRES_26     26UL /*!< RIF Local Resource Index  26 */
#define RCC_LOCALRES_27     27UL /*!< RIF Local Resource Index  27 */
#define RCC_LOCALRES_28     28UL /*!< RIF Local Resource Index  28 */
#define RCC_LOCALRES_29     29UL /*!< RIF Local Resource Index  29 */
#define RCC_LOCALRES_30     30UL /*!< RIF Local Resource Index  30 */
#define RCC_LOCALRES_31     31UL /*!< RIF Local Resource Index  31 */
#define RCC_LOCALRES_32     32UL /*!< RIF Local Resource Index  32 */
#define RCC_LOCALRES_33     33UL /*!< RIF Local Resource Index  33 */
#define RCC_LOCALRES_34     34UL /*!< RIF Local Resource Index  34 */
#define RCC_LOCALRES_35     35UL /*!< RIF Local Resource Index  35 */
#define RCC_LOCALRES_36     36UL /*!< RIF Local Resource Index  36 */
#define RCC_LOCALRES_37     37UL /*!< RIF Local Resource Index  37 */
#define RCC_LOCALRES_38     38UL /*!< RIF Local Resource Index  38 */
#define RCC_LOCALRES_39     39UL /*!< RIF Local Resource Index  39 */
#define RCC_LOCALRES_40     40UL /*!< RIF Local Resource Index  40 */
#define RCC_LOCALRES_41     41UL /*!< RIF Local Resource Index  41 */
#define RCC_LOCALRES_42     42UL /*!< RIF Local Resource Index  42 */
#define RCC_LOCALRES_43     43UL /*!< RIF Local Resource Index  43 */
#define RCC_LOCALRES_44     44UL /*!< RIF Local Resource Index  44 */
#define RCC_LOCALRES_45     45UL /*!< RIF Local Resource Index  45 */
#define RCC_LOCALRES_46     46UL /*!< RIF Local Resource Index  46 */
#define RCC_LOCALRES_47     47UL /*!< RIF Local Resource Index  47 */
#define RCC_LOCALRES_48     48UL /*!< RIF Local Resource Index  48 */
#define RCC_LOCALRES_49     49UL /*!< RIF Local Resource Index  49 */
#define RCC_LOCALRES_50     50UL /*!< RIF Local Resource Index  50 */
#define RCC_LOCALRES_51     51UL /*!< RIF Local Resource Index  51 */
#define RCC_LOCALRES_52     52UL /*!< RIF Local Resource Index  52 */
#define RCC_LOCALRES_53     53UL /*!< RIF Local Resource Index  53 */
#define RCC_LOCALRES_54     54UL /*!< RIF Local Resource Index  54 */
#define RCC_LOCALRES_55     55UL /*!< RIF Local Resource Index  55 */
#define RCC_LOCALRES_56     56UL /*!< RIF Local Resource Index  56 */
#define RCC_LOCALRES_57     57UL /*!< RIF Local Resource Index  57 */
#define RCC_LOCALRES_58     58UL /*!< RIF Local Resource Index  58 */
#define RCC_LOCALRES_59     59UL /*!< RIF Local Resource Index  59 */
#define RCC_LOCALRES_60     60UL /*!< RIF Local Resource Index  60 */
#define RCC_LOCALRES_61     61UL /*!< RIF Local Resource Index  61 */
#define RCC_LOCALRES_62     62UL /*!< RIF Local Resource Index  62 */
#define RCC_LOCALRES_63     63UL /*!< RIF Local Resource Index  63 */
#define RCC_LOCALRES_64     64UL /*!< RIF Local Resource Index  64 */
#define RCC_LOCALRES_65     65UL /*!< RIF Local Resource Index  65 */
#define RCC_LOCALRES_66     66UL /*!< RIF Local Resource Index  66 */
#define RCC_LOCALRES_67     67UL /*!< RIF Local Resource Index  67 */
#define RCC_LOCALRES_68     68UL /*!< RIF Local Resource Index  68 */
#define RCC_LOCALRES_69     69UL /*!< RIF Local Resource Index  69 */
#define RCC_LOCALRES_70     70UL /*!< RIF Local Resource Index  70 */
#define RCC_LOCALRES_71     71UL /*!< RIF Local Resource Index  71 */
#define RCC_LOCALRES_72     72UL /*!< RIF Local Resource Index  72 */
#define RCC_LOCALRES_73     73UL /*!< RIF Local Resource Index  73 */
#define RCC_LOCALRES_74     74UL /*!< RIF Local Resource Index  74 */
#define RCC_LOCALRES_75     75UL /*!< RIF Local Resource Index  75 */
#define RCC_LOCALRES_76     76UL /*!< RIF Local Resource Index  76 */
#define RCC_LOCALRES_77     77UL /*!< RIF Local Resource Index  77 */
#define RCC_LOCALRES_78     78UL /*!< RIF Local Resource Index  78 */
#define RCC_LOCALRES_79     79UL /*!< RIF Local Resource Index  79 */
#define RCC_LOCALRES_80     80UL /*!< RIF Local Resource Index  80 */
#define RCC_LOCALRES_81     81UL /*!< RIF Local Resource Index  81 */
#define RCC_LOCALRES_82     82UL /*!< RIF Local Resource Index  82 */
#define RCC_LOCALRES_83     83UL /*!< RIF Local Resource Index  83 */
#define RCC_LOCALRES_84     84UL /*!< RIF Local Resource Index  84 */
#define RCC_LOCALRES_85     85UL /*!< RIF Local Resource Index  85 */
#define RCC_LOCALRES_86     86UL /*!< RIF Local Resource Index  86 */
#define RCC_LOCALRES_87     87UL /*!< RIF Local Resource Index  87 */
#define RCC_LOCALRES_88     88UL /*!< RIF Local Resource Index  88 */
#define RCC_LOCALRES_89     89UL /*!< RIF Local Resource Index  89 */
#define RCC_LOCALRES_90     90UL /*!< RIF Local Resource Index  90 */
#define RCC_LOCALRES_91     91UL /*!< RIF Local Resource Index  91 */
#define RCC_LOCALRES_92     92UL /*!< RIF Local Resource Index  92 */
#define RCC_LOCALRES_93     93UL /*!< RIF Local Resource Index  93 */
#define RCC_LOCALRES_94     94UL /*!< RIF Local Resource Index  94 */
#define RCC_LOCALRES_95     95UL /*!< RIF Local Resource Index  95 */
#define RCC_LOCALRES_96     96UL /*!< RIF Local Resource Index  96 */
#define RCC_LOCALRES_97     97UL /*!< RIF Local Resource Index  97 */
#define RCC_LOCALRES_98     98UL /*!< RIF Local Resource Index  98 */
#define RCC_LOCALRES_99     99UL /*!< RIF Local Resource Index  99 */
#define RCC_LOCALRES_100   100UL /*!< RIF Local Resource Index 100 */
#define RCC_LOCALRES_101   101UL /*!< RIF Local Resource Index 101 */
#define RCC_LOCALRES_102   102UL /*!< RIF Local Resource Index 102 */
#define RCC_LOCALRES_103   103UL /*!< RIF Local Resource Index 103 */
#define RCC_LOCALRES_104   104UL /*!< RIF Local Resource Index 104 */
#define RCC_LOCALRES_105   105UL /*!< RIF Local Resource Index 105 */
#define RCC_LOCALRES_106   106UL /*!< RIF Local Resource Index 106 */
#define RCC_LOCALRES_107   107UL /*!< RIF Local Resource Index 107 */
#define RCC_LOCALRES_108   108UL /*!< RIF Local Resource Index 108 */
#define RCC_LOCALRES_109   109UL /*!< RIF Local Resource Index 109 */
#define RCC_LOCALRES_110   110UL /*!< RIF Local Resource Index 110 */
#define RCC_LOCALRES_111   111UL /*!< RIF Local Resource Index 111 */
#define RCC_LOCALRES_112   112UL /*!< RIF Local Resource Index 112 */
#define RCC_LOCALRES_113   113UL /*!< RIF Local Resource Index 113 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RIF_LOCALRES_CID RCC LL RIF Compartment Identification Filtering of Local Resource Access
  * @{
  */
#define RCC_LOCALRES_CID_TYPE_NONE     0x00000000U /*!< RIF Local Resource Access : No CID filtering */
#define RCC_LOCALRES_CID_TYPE_STATIC   0x00000001U /*!< RIF Local Resource Access : Static CID filtering */
#define RCC_LOCALRES_CID_TYPE_DYNAMIC  0x00000003U /*!< RIF Local Resource Access : Dynamic CID filtering */

