zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
#define RCC_LOCALRES_CID_STATIC_0      0x00000001U /*!< RIF Local Resource Access : CID0 static filtering */
#define RCC_LOCALRES_CID_STATIC_1      0x00000011U /*!< RIF Local Resource Access : CID1 static filtering */
#define RCC_LOCALRES_CID_STATIC_2      0x00000021U /*!< RIF Local Resource Access : CID2 static filtering */
#define RCC_LOCALRES_CID_STATIC_3      0x00000031U /*!< RIF Local Resource Access : CID3 static filtering */
#define RCC_LOCALRES_CID_STATIC_4      0x00000041U /*!< RIF Local Resource Access : CID4 static filtering */
#define RCC_LOCALRES_CID_STATIC_5      0x00000051U /*!< RIF Local Resource Access : CID5 static filtering */
#define RCC_LOCALRES_CID_STATIC_6      0x00000061U /*!< RIF Local Resource Access : CID6 static filtering */
#define RCC_LOCALRES_CID_STATIC_7      0x00000071U /*!< RIF Local Resource Access : CID7 static filtering */
#define RCC_LOCALRES_CID_STATIC_MSK    RCC_LOCALRES_CID_STATIC_7

#define RCC_LOCALRES_CID_DYNAMIC_NONE  0x00000003U /*!< RIF Local Resource Access : No CID dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_ALL   0x00FF0003U /*!< RIF Local Resource Access : All CID dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_MSK   RCC_LOCALRES_CID_DYNAMIC_ALL
/* Use following values to compose CID whitelist */
#define RCC_LOCALRES_CID_DYNAMIC_0     0x00010003U /*!< RIF Local Resource Access : CID0 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_1     0x00020003U /*!< RIF Local Resource Access : CID1 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_2     0x00040003U /*!< RIF Local Resource Access : CID2 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_3     0x00080003U /*!< RIF Local Resource Access : CID3 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_4     0x00100003U /*!< RIF Local Resource Access : CID4 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_5     0x00200003U /*!< RIF Local Resource Access : CID5 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_6     0x00400003U /*!< RIF Local Resource Access : CID6 dynamic filtering */
#define RCC_LOCALRES_CID_DYNAMIC_7     0x00800003U /*!< RIF Local Resource Access : CID7 dynamic filtering */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RIF_LOCALRES_SEMAPHORE RCC LL RIF Semaphore Handling of Local Resource Access
  * @{
  */
#define RCC_LOCALRES_TAKEN_SEMCID0     0x00000001U /*!< RIF Local Resource Access : Semaphore taken by CID0 */
#define RCC_LOCALRES_TAKEN_SEMCID1     0x00000011U /*!< RIF Local Resource Access : Semaphore taken by CID1 */
#define RCC_LOCALRES_TAKEN_SEMCID2     0x00000021U /*!< RIF Local Resource Access : Semaphore taken by CID2 */
#define RCC_LOCALRES_TAKEN_SEMCID3     0x00000031U /*!< RIF Local Resource Access : Semaphore taken by CID3 */
#define RCC_LOCALRES_TAKEN_SEMCID4     0x00000041U /*!< RIF Local Resource Access : Semaphore taken by CID4 */
#define RCC_LOCALRES_TAKEN_SEMCID5     0x00000051U /*!< RIF Local Resource Access : Semaphore taken by CID5 */
#define RCC_LOCALRES_TAKEN_SEMCID6     0x00000061U /*!< RIF Local Resource Access : Semaphore taken by CID6 */
#define RCC_LOCALRES_TAKEN_SEMCID7     0x00000071U /*!< RIF Local Resource Access : Semaphore taken by CID7 */

#define RCC_LOCALRES_RELEASED_SEMCID0  0x00000000U /*!< RIF Local Resource Access : Semaphore released by CID0 */
#define RCC_LOCALRES_RELEASED_SEMCID1  0x00000010U /*!< RIF Local Resource Access : Semaphore released by CID1 */
#define RCC_LOCALRES_RELEASED_SEMCID2  0x00000020U /*!< RIF Local Resource Access : Semaphore released by CID2 */
#define RCC_LOCALRES_RELEASED_SEMCID3  0x00000030U /*!< RIF Local Resource Access : Semaphore released by CID3 */
#define RCC_LOCALRES_RELEASED_SEMCID4  0x00000040U /*!< RIF Local Resource Access : Semaphore released by CID4 */
#define RCC_LOCALRES_RELEASED_SEMCID5  0x00000050U /*!< RIF Local Resource Access : Semaphore released by CID5 */
#define RCC_LOCALRES_RELEASED_SEMCID6  0x00000060U /*!< RIF Local Resource Access : Semaphore released by CID6 */
#define RCC_LOCALRES_RELEASED_SEMCID7  0x00000070U /*!< RIF Local Resource Access : Semaphore released by CID7 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_LL_RIF_Exported_Functions RCC LL RIF Exported Functions
  * @{
  */

/** @defgroup RCC_LL_EF_RIF RCC LL RIF
  * @brief RCC LL RIF module driver
  * @{
  */

/* Manage RCC_SECCFGR0 - RCC_SECCFGR3 registers */
#if defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Enable Security Filtering of RCC Local Resource Access
  * @rmtoll RCC_SECCFGRi       SECx    LL_RCC_EnableLocalResSecure
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   SECx bit is in register indexed i = LocalResIndex/32 at bit position j = LocalResIndex%32.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLocalResSecure(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Set bit j in register RCC_SECCFGR[i] */
  SET_BIT(RCC->SECCFGR[LocalResIndex >> 5], 1 << (LocalResIndex & 0x1F));
}

/**
  * @brief  Disable Security Filtering of RCC Local Resource Access
  * @rmtoll RCC_SECCFGRi       SECx    LL_RCC_DisableLocalResSecure
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   SECx bit is in register indexed i = LocalResIndex/32, at bit position j = LocalResIndex%32.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLocalResSecure(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Clear bit j in register RCC_SECCFGR[i] */
  CLEAR_BIT(RCC->SECCFGR[LocalResIndex >> 5], 1 << (LocalResIndex & 0x1F));
}
#endif /* CORTEX_IN_SECURE_STATE */

/**
  * @brief  Check whether Security Filtering of RCC Local Resource Access is enabled or not.
  * @rmtoll RCC_SECCFGRi       SECx    LL_RCC_IsEnabledLocalResSecure
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   SECx bit is in register indexed i = LocalResIndex/32, at bit position j = LocalResIndex%32.
  * @retval SECx bit value (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledLocalResSecure(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Read bit j in register RCC_SECCFGR[i] */
  /* Return 1 when bit j is set and else 0 */
  return ((READ_BIT(RCC->SECCFGR[LocalResIndex >> 5], 1UL << (LocalResIndex & 0x1FU)) == \
           (1UL << (LocalResIndex & 0x1FU))) ? 1UL : 0UL);
}

