zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rcc.h
/* Manage RCC_PRIVCFGR0 - RCC_PRIVCFGR3 registers */
/**
  * @brief  Enable Privilege Filtering of RCC Local Resource Access
  * @rmtoll RCC_PRIVCFGRi      PRIVx   LL_RCC_EnableLocalResPrivilege
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   PRIVx bit is in register indexed i = LocalResIndex/32 at bit position j = LocalResIndex%32.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableLocalResPrivilege(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Set bit j in register RCC_PRIVCFGR[i] */
  SET_BIT(RCC->PRIVCFGR[LocalResIndex >> 5], 1UL << (LocalResIndex & 0x1FU));
}

/**
  * @brief  Disable Privilege Filtering of RCC Local Resource Access
  * @rmtoll RCC_PRIVCFGRi      PRIVx   LL_RCC_DisableLocalResPrivilege
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   PRIVx bit is in register indexed i = LocalResIndex/32, at bit position j = LocalResIndex%32.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableLocalResPrivilege(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Clear bit j in register RCC_PRIVCFGR[i] */
  CLEAR_BIT(RCC->PRIVCFGR[LocalResIndex >> 5], 1UL << (LocalResIndex & 0x1FU));
}

/**
  * @brief  Check whether Privilege Filtering of RCC Local Resource Access is enabled or not.
  * @rmtoll RCC_PRIVCFGRi      PRIVx   LL_RCC_IsEnabledLocalResPrivilege
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   PRIVx bit is in register indexed i = LocalResIndex/32, at bit position j = LocalResIndex%32.
  * @retval PRIVx bit value (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledLocalResPrivilege(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Read bit j in register RCC_PRIVCFGR[i] */
  /* Return 1 when bit j is set and else 0 */
  return ((READ_BIT(RCC->PRIVCFGR[LocalResIndex >> 5], 1UL << (LocalResIndex & 0x1FU)) == \
           (1UL << (LocalResIndex & 0x1FU))) ? 1UL : 0UL);
}

/* Manage RCC_RCFGLOCKR0 - RCC_RCFGLOCKR3 registers */
#if defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Lock RCC Local Resource RIF configuration
  * @rmtoll RCC_RCFGLOCKRi     RLOCKx  LL_RCC_LockLocalResConfig
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   RLOCKx bit is in register indexed i = LocalResIndex/32 at bit position j = LocalResIndex%32.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LockLocalResConfig(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Set bit j in register RCC_RCFGLOCKR[i] */
  SET_BIT(RCC->RCFGLOCKR[LocalResIndex >> 5], 1 << (LocalResIndex & 0x1F));
}
#endif /* CORTEX_IN_SECURE_STATE */

/**
  * @brief  Check whether RCC Local Resource RIF configuration is locked or not.
  * @rmtoll RCC_RCFGLOCKRi     RLOCKx  LL_RCC_IsLockedLocalResConfig()
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note   RLOCKx bit is in register indexed i = LocalResIndex/32, at bit position j = LocalResIndex%32.
  * @retval RLOCKx bit value (1 or 0)
  */
__STATIC_INLINE uint32_t LL_RCC_IsLockedLocalResConfig(uint32_t LocalResIndex)
{
  /* Compute register index i (LocalResIndex / 32) */
  /* Compute bit position j (LocalResIndex % 32) */
  /* Read bit j in register RCC_RCFGLOCKR[i] */
  /* Return 1 when bit j is set and else 0 */
  return ((READ_BIT(RCC->RCFGLOCKR[LocalResIndex >> 5], 1UL << (LocalResIndex & 0x1FU)) == \
           (1UL << (LocalResIndex & 0x1FU))) ? 1UL : 0UL);
}

/* Manage RCC_R0CIDCFGR - RCC_R113CIDCFGR registers */
#if defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Configure static CID filtering of RCC Local Resource Access
  * @rmtoll RCC_RxCIDCFGR      SEMWLC  LL_RCC_SetLocalResSCid\n
  * @rmtoll RCC_RxCIDCFGR      SCID    LL_RCC_SetLocalResSCid\n
  * @rmtoll RCC_RxCIDCFGR      SEM_EN  LL_RCC_SetLocalResSCid\n
  * @rmtoll RCC_RxCIDCFGR      CFEN    LL_RCC_SetLocalResSCid
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @param  StaticCid Value shall be one of the following :
  *         @arg @ref RCC_LOCALRES_CID_STATIC_0
  *         @arg @ref RCC_LOCALRES_CID_STATIC_1
  *         @arg @ref RCC_LOCALRES_CID_STATIC_2
  *         @arg @ref RCC_LOCALRES_CID_STATIC_3
  *         @arg @ref RCC_LOCALRES_CID_STATIC_4
  *         @arg @ref RCC_LOCALRES_CID_STATIC_5
  *         @arg @ref RCC_LOCALRES_CID_STATIC_6
  *         @arg @ref RCC_LOCALRES_CID_STATIC_7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLocalResSCid(uint32_t LocalResIndex, uint32_t StaticCid)
{
  /* In register RCC_RxCIDCFGR, where x is the local resource index : */
  /* - clear SEMWLC[7:0] (set to 0x00) and SEM_EN (set to 0b0) */
  /* - set SCID[2:0] according to input CID */
  /* - set CFEN to 0b1 */
  WRITE_REG(RCC->R[LocalResIndex].CIDCFGR, (StaticCid & RCC_LOCALRES_CID_STATIC_MSK));
}

/**
  * @brief  Configure dynamic CID filtering of RCC Local Resource Access
  * @rmtoll RCC_RxCIDCFGR      SEMWLC  LL_RCC_SetLocalResWLCid\n
  * @rmtoll RCC_RxCIDCFGR      SCID    LL_RCC_SetLocalResWLCid\n
  * @rmtoll RCC_RxCIDCFGR      SEM_EN  LL_RCC_SetLocalResWLCid\n
  * @rmtoll RCC_RxCIDCFGR      CFEN    LL_RCC_SetLocalResWLCid
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @param  DynamicCid Value shall be composed (through "or" operation) of the following :
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_0
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_1
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_2
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_3
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_4
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_5
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_6
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_7
  *         or equal to one of the following values :
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_NONE
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_ALL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLocalResWLCid(uint32_t LocalResIndex, uint32_t DynamicCid)
{
  /* In register RCC_RxCIDCFGR, where x is the local resource index : */
  /* - set SEMWLC[7:0] according to input CID whitelist */
  /* - clear SCID[2:0] (set to 0b000) */
  /* - set CFEN and SEM_EN to 0b1 */
  WRITE_REG(RCC->R[LocalResIndex].CIDCFGR, (DynamicCid & RCC_LOCALRES_CID_DYNAMIC_MSK));
}

/**
  * @brief  Disable CID filtering of RCC Local Resource Access
  * @rmtoll RCC_RxCIDCFGR      SEMWLC  LL_RCC_SetLocalResNoCid\n
  * @rmtoll RCC_RxCIDCFGR      SCID    LL_RCC_SetLocalResNoCid\n
  * @rmtoll RCC_RxCIDCFGR      SEM_EN  LL_RCC_SetLocalResNoCid\n
  * @rmtoll RCC_RxCIDCFGR      CFEN    LL_RCC_SetLocalResNoCid
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLocalResNoCid(uint32_t LocalResIndex)
{
  /* In register RCC_RxCIDCFGR, where x is the local resource index : */
  /* - clear SEMWLC[7:0] (set to 0x00) and SEM_EN (set to 0b0) */
  /* - clear SCID[2:0] (set to 0b000) and CFEN (set to 0b0) */
  WRITE_REG(RCC->R[LocalResIndex].CIDCFGR, RCC_LOCALRES_CID_TYPE_NONE);
}
#endif /* CORTEX_IN_SECURE_STATE */

/**
  * @brief  Get CID filtering configuration of RCC Local Resource Access
  * @rmtoll RCC_RxCIDCFGR      SEMWLC  LL_RCC_GetLocalResCid\n
  * @rmtoll RCC_RxCIDCFGR      SCID    LL_RCC_GetLocalResCid\n
  * @rmtoll RCC_RxCIDCFGR      SEM_EN  LL_RCC_GetLocalResCid\n
  * @rmtoll RCC_RxCIDCFGR      CFEN    LL_RCC_GetLocalResCid
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @retval Return value can be one of the following :
  *         @arg @ref RCC_LOCALRES_CID_TYPE_NONE
  *         @arg @ref RCC_LOCALRES_CID_STATIC_0
  *         @arg @ref RCC_LOCALRES_CID_STATIC_1
  *         @arg @ref RCC_LOCALRES_CID_STATIC_2
  *         @arg @ref RCC_LOCALRES_CID_STATIC_3
  *         @arg @ref RCC_LOCALRES_CID_STATIC_4
  *         @arg @ref RCC_LOCALRES_CID_STATIC_5
  *         @arg @ref RCC_LOCALRES_CID_STATIC_6
  *         @arg @ref RCC_LOCALRES_CID_STATIC_7
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_NONE
  *         or a composition (through "or" operation) of the following :
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_0
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_1
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_2
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_3
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_4
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_5
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_6
  *         @arg @ref RCC_LOCALRES_CID_DYNAMIC_7
  */
__STATIC_INLINE uint32_t LL_RCC_GetLocalResCid(uint32_t LocalResIndex)
{
  /* In register RCC_RxCIDCFGR, where x is the local resource index, */
  uint32_t rcc_rxcidcfgr = READ_REG(RCC->R[LocalResIndex].CIDCFGR);
  /* if CID filtering is Static (SEM_EN = 0 and CFEN = 1), */
  /* return static CID filtering configuration (SEMWLC=0x00, SCID, SEM_EN=0, CFEN=1) */
  /* else if CID filtering is Dynamic (SEM_EN = 1 and CFEN = 1), */
  /* return dynamic CID filtering configuration (SEMWLC, SCID=0b000, SEM_EN=1, CFEN=1) */
  /* else return RCC_LOCALRES_CID_TYPE_NONE */
#define SEM_EN_AND_CFEN_MSK (RCC_RxCIDCFGR_CFEN_Msk | RCC_RxCIDCFGR_SEM_EN_Msk)
  return ((READ_BIT(rcc_rxcidcfgr, SEM_EN_AND_CFEN_MSK) == SEM_EN_AND_CFEN_MSK) ? \
          (rcc_rxcidcfgr & RCC_LOCALRES_CID_DYNAMIC_MSK) :
          (READ_BIT(rcc_rxcidcfgr, SEM_EN_AND_CFEN_MSK) == RCC_RxCIDCFGR_CFEN) ? \
          (rcc_rxcidcfgr & RCC_LOCALRES_CID_STATIC_MSK) : RCC_LOCALRES_CID_TYPE_NONE);
}

/* Manage RCC_R0SEMCR - RCC_R113SEMCR registers */
/**
  * @brief  Take semaphore to access RCC Local Resource
  * @rmtoll RCC_RxSEMCR      SEM_MUTEX LL_RCC_TakeLocalResSem
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note If operation is successful, SEMCID[2:0] will be updated by HW.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_TakeLocalResSem(uint32_t LocalResIndex)
{
  /* In register RCC_RxSEMCR, where x is the local resource index, */
  /* set SEM_MUTEX to 0b1 (only writeable bit) */
  WRITE_REG(RCC->R[LocalResIndex].SEMCR, RCC_RxSEMCR_SEM_MUTEX);
}

/**
  * @brief  Release semaphore of RCC Local Resource Access
  * @rmtoll RCC_RxSEMCR      SEM_MUTEX LL_RCC_ReleaseLocalResSem
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @note Operation will be successful, only if current CID is equal to SEMCID[2:0], which has taken it.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ReleaseLocalResSem(uint32_t LocalResIndex)
{
  /* In register RCC_RxSEMCR, where x is the local resource index, */
  /* clear SEM_MUTEX (set to 0b0) (only writeable bit) */
  WRITE_REG(RCC->R[LocalResIndex].SEMCR, 0x0);
}

/**
  * @brief  Get semaphore status of RCC Local Resource Access
  * @rmtoll RCC_RxSEMCR      SEMCID    LL_RCC_GetLocalResSem\n
  * @rmtoll RCC_RxSEMCR      SEM_MUTEX LL_RCC_GetLocalResSem
  * @param  LocalResIndex Value in @ref RCC_LL_EC_RIF_LOCALRES
  * @retval Return value can be :
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID0
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID1
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID2
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID3
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID4
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID5
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID6
  *         @arg @ref RCC_LOCALRES_TAKEN_SEMCID7
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID0
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID1
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID2
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID3
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID4
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID5
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID6
  *         @arg @ref RCC_LOCALRES_RELEASED_SEMCID7
  */
__STATIC_INLINE uint32_t LL_RCC_GetLocalResSem(uint32_t LocalResIndex)
{
  /* Return value of register RCC_RxSEMCR, where x is the local resource index */
  return READ_REG(RCC->R[LocalResIndex].SEMCR);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/******************************************************************************/

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_LL_RCC_H */
